[
  {
    "id": "ec_001",
    "source": "sk_001",
    "target": "bg_001",
    "type": "contradicts",
    "weight": 3,
    "label": "Self as relational work vs. stable witnessing consciousness",
    "notes": "One of the deepest contradictions in the graph. Kierkegaard: the self is the active ongoing work of relating. The Gita: the real self is what remains when all relating is removed. These are incompatible accounts of what selfhood fundamentally is, arrived at through completely different frameworks."
  },
  {
    "id": "ec_002",
    "source": "mm_003",
    "target": "bg_001",
    "type": "contradicts",
    "weight": 3,
    "label": "Self as flux vs. stable atman",
    "notes": "Montaigne finds that every attempt to describe the self reveals a self that has already changed. The Gita insists the atman is eternal, unchanging, beyond all conditions. Same question — what is the deepest self? — answered with mutually exclusive answers."
  },
  {
    "id": "ec_003",
    "source": "eb_001",
    "target": "bg_001",
    "type": "contradicts",
    "weight": 3,
    "label": "Irresolvable body-self conflict vs. atman transcending embodiment",
    "notes": "Becker: the central tragedy is that we are simultaneously animals and symbolic selves, and this cannot be resolved. The Gita: the atman is entirely beyond embodiment — the body is a garment worn by the soul. One says the conflict is the human condition; the other says it dissolves on correct understanding."
  },
  {
    "id": "ec_004",
    "source": "bg_004",
    "target": "sk_016",
    "type": "contradicts",
    "weight": 3,
    "label": "Universal self vs. the single individual as irreducible",
    "notes": "The Gita: the atman in every individual is identical to Brahman — the universal self. Kierkegaard: the individual standing before God, not reducible to the universal, is the irreducible unit of all genuine ethical and religious significance. Both claim the deepest reality of the self; they locate it in opposite directions — universal vs. irreducibly particular."
  },
  {
    "id": "ec_005",
    "source": "bp_020",
    "target": "mm_002",
    "type": "contradicts",
    "weight": 2,
    "label": "Self as distorting lens vs. self as complete form of human condition",
    "notes": "Pascal: the self is hateful because it is a fundamentally distorting lens — we see everything in relation to ourselves and therefore almost never see anything clearly. Montaigne: each person carries within them the complete form of the human condition and studying the self honestly is the best available methodology. Same instrument — one condemns it, the other trusts it."
  },
  {
    "id": "ec_006",
    "source": "fn_006",
    "target": "vf_002",
    "type": "contradicts",
    "weight": 3,
    "label": "Meaning is created vs. meaning is discovered",
    "notes": "One of the three great incompatible responses to the meaning question in the graph. Nietzsche: there is no cosmic script — meaning is what you impose on existence. Frankl: meaning is already there waiting to be found in relationships, work, and the response to unavoidable suffering. These are not merely different emphases — they are structurally opposed accounts of meaning's ontological status."
  },
  {
    "id": "ec_007",
    "source": "ac_006",
    "target": "vf_002",
    "type": "contradicts",
    "weight": 3,
    "label": "Revolt without cosmic guarantee vs. meaning exists to be discovered",
    "notes": "Camus: the honest response to the absurd is revolt — holding the tension without resolving it, living without appeal to any discovered meaning. Frankl: meaning is not invented, it is discovered. Camus's revolt explicitly refuses the move Frankl makes — the appeal to something real beyond the revolting subject."
  },
  {
    "id": "ec_008",
    "source": "ac_009",
    "target": "vf_012",
    "type": "contradicts",
    "weight": 3,
    "label": "Living without hope vs. future goal as survival anchor",
    "notes": "The clearest single-sentence contradiction in the graph. Camus: the absurd man does not hope — hope is a subtle form of self-deception. Frankl: a person who has a why can endure almost any how — the clarity of a future goal is a biological and psychological anchor that keeps people alive. Both grounded in extreme experience; both serious; both irreconcilable."
  },
  {
    "id": "ec_009",
    "source": "sk_019",
    "target": "ma_002",
    "type": "contradicts",
    "weight": 2,
    "label": "Stoic inner retreat as insufficient vs. mind as inviolable refuge",
    "notes": "Kierkegaard: the knight of infinite resignation — which is what Stoicism achieves — makes peace with impossibility and recovers inner dignity. But this is not faith. Faith goes one step further: it expects the impossible to be returned. Marcus Aurelius: you can always retreat into your own mind; it is the one territory no external force can occupy. Kierkegaard diagnoses this achievement as real but insufficient."
  },
  {
    "id": "ec_010",
    "source": "sk_010",
    "target": "ac_005",
    "type": "contradicts",
    "weight": 3,
    "label": "Religious stage as genuine vs. religion as philosophical suicide",
    "notes": "Camus: leaping into religion to resolve the absurd is philosophical suicide — the most common and most dishonest escape. Kierkegaard: the religious stage is not a leap away from difficulty but a different kind of thing entirely — the absolute relation to the absolute. Both are describing the same move; one diagnoses it as the deepest human possibility, the other as bad faith."
  },
  {
    "id": "ec_011",
    "source": "sk_020",
    "target": "ac_009",
    "type": "contradicts",
    "weight": 3,
    "label": "Kierkegaard's absurd as ground of faith vs. Camus's absurd as ground of revolt",
    "notes": "The most philosophically interesting single edge in the graph. Both use the word 'absurd' with precision. For Kierkegaard: the absurd is the belief that by virtue of the absurd, the impossible will become possible — it is the ground of faith. For Camus: the absurd is the collision between human need for meaning and the universe's silence — the ground of revolt without hope. Same word; structurally opposite directions. They illuminate each other perfectly by their difference."
  },
  {
    "id": "ec_012",
    "source": "sw_005",
    "target": "vf_006",
    "type": "contradicts",
    "weight": 3,
    "label": "Affliction destroys capacity for meaning vs. suffering always transformable",
    "notes": "The most serious contradicts edge in the graph because both thinkers are drawing on extreme experience rather than armchair philosophy. Frankl: the moment you assign meaning to suffering, its weight changes — suffering without meaning is unbearable but meaning is always available. Weil: affliction is categorically different from suffering — it attacks the soul as well as the body and stamps the victim with contempt, destroying the very capacity that Frankl says can transform it. Unresolvable within either framework."
  },
  {
    "id": "ec_013",
    "source": "vf_007",
    "target": "eb_014",
    "type": "contradicts",
    "weight": 2,
    "label": "Love sustains life vs. love carries impossible weight in secular modernity",
    "notes": "Frankl: love is the highest human capacity — in the camps, the inner image of a beloved person could sustain life when nothing else could. Becker: romantic love in secular society carries an impossible weight because people increasingly ask their partner to provide what an entire cosmic framework used to provide. No human being can bear this weight. Both are serious; they are describing the same phenomenon from incompatible angles."
  },
  {
    "id": "ec_014",
    "source": "sw_012",
    "target": "vf_005",
    "type": "contradicts",
    "weight": 2,
    "label": "Force can destroy the last freedom vs. attitude always remains",
    "notes": "Frankl: everything can be taken from a person except the last of human freedoms — the choice of one's attitude. Weil: force, at its extreme, can convert a person into something that responds to stimuli rather than acts from freedom. Both draw on extreme experience. Frankl from inside the camps; Weil from analysis of the Iliad and her factory work. The disagreement is genuine and practically consequential."
  },
  {
    "id": "ec_015",
    "source": "sk_026",
    "target": "fn_010",
    "type": "contradicts",
    "weight": 3,
    "label": "Self without God as refined despair vs. Uebermensch as highest achievement",
    "notes": "The most philosophically dense contradicts cluster in the Kierkegaard extraction. Kierkegaard: the self can only resolve its despair in transparent relation to the power that established it — secular selfhood is structurally incomplete. Nietzsche: the Uebermensch — who creates their own values in full awareness of the death of God — is the highest human possibility. Kierkegaard would diagnose the Uebermensch project as the most refined available form of despair (sk_005). Nietzsche would diagnose Kierkegaard's theological resolution as weakness."
  },
  {
    "id": "ec_016",
    "source": "sk_026",
    "target": "ac_006",
    "type": "contradicts",
    "weight": 3,
    "label": "Secular revolt as refined despair vs. revolt as the only honest response",
    "notes": "Kierkegaard: secular selfhood — including Camus's revolt — is structurally incomplete because the self is a relation that includes a relation to what grounds all relations. Camus: revolt — holding the absurd tension without resolving it — is the only honest response. Kierkegaard would say revolt is the most sophisticated available form of despair. Camus would say Kierkegaard's religious resolution is philosophical suicide."
  },
  {
    "id": "ec_017",
    "source": "sk_026",
    "target": "mm_026",
    "type": "contradicts",
    "weight": 2,
    "label": "Secular self-belonging as incomplete vs. belonging to yourself as most important project",
    "notes": "Montaigne: to belong to yourself — to live by your own judgment rather than the judgments of others — is both the hardest and most important project of a human life. Kierkegaard: this secular self-belonging, however admirable, is structurally incomplete — the self includes a relation to what grounds it that secular self-ownership cannot satisfy."
  },
  {
    "id": "ec_018",
    "source": "sk_005",
    "target": "fn_010",
    "type": "contradicts",
    "weight": 3,
    "label": "Defiant self-willing as demonic despair vs. self-willing as highest achievement",
    "notes": "Kierkegaard's most direct engagement with the Nietzschean ideal. The person who insists on being themselves in defiance — on their own terms, answerable to nothing beyond themselves — is in Kierkegaard's third and most extreme form of despair: the demonic. This describes the Uebermensch project precisely. Nietzsche would say the person Kierkegaard diagnoses as despairingly demonic is the person who has genuinely achieved selfhood."
  },
  {
    "id": "ec_019",
    "source": "fd_019",
    "target": "fn_001",
    "type": "contradicts",
    "weight": 3,
    "label": "Without God everything permitted vs. God's death as liberation to create values",
    "notes": "The central debate about what the death of God actually means. Dostoevsky (through Ivan and Smerdyakov): without a transcendent source of value, the human tendency toward self-justification has no limit — without God everything is permitted. Nietzsche: God is dead and we have killed him — but this is not the end of value, it is the beginning of genuine value creation by those with the courage to face it. The diagnosis is shared; the prescription is opposite."
  },
  {
    "id": "ec_020",
    "source": "fd_019",
    "target": "ac_006",
    "type": "contradicts",
    "weight": 3,
    "label": "Without God everything permitted vs. secular revolt as honest response",
    "notes": "Dostoevsky: without transcendent grounding, moral distinctions become purely arbitrary preferences — without God everything is permitted. Camus: revolt — living and creating in full awareness that nothing is cosmically guaranteed — is the only honest response to the absurd. Camus explicitly refuses Dostoevsky's conclusion: the removal of transcendent grounding does not eliminate moral seriousness, it intensifies it."
  },
  {
    "id": "ec_021",
    "source": "cd_002",
    "target": "bo_012",
    "type": "contradicts",
    "weight": 3,
    "label": "No design in nature vs. everything contained in providential order",
    "notes": "Darwin: natural selection is a filter, not a designer — there is no foresight, no plan, no goal. What looks like design is the cumulative result of selection acting on random variation. Boethius: everything that happens, including catastrophe and injustice, is contained within a providential order that human reason cannot fully perceive. Empirically the most one-sided contradicts in the graph — the evidence for Darwin's position is overwhelming."
  },
  {
    "id": "ec_022",
    "source": "cd_002",
    "target": "ma_015",
    "type": "contradicts",
    "weight": 3,
    "label": "No design in nature vs. rational universe",
    "notes": "Darwin: no purpose, no goal, no preference for consciousness in the natural process. Marcus Aurelius: you are a fragment of a rational universe — what happens to you is not random noise but part of a process larger than your individual story. The Stoic logos — a rational principle immanent in nature — is precisely what natural selection removes."
  },
  {
    "id": "ec_023",
    "source": "cd_002",
    "target": "bg_023",
    "type": "contradicts",
    "weight": 2,
    "label": "No design in nature vs. dharma as alignment with deepest structure of reality",
    "notes": "Darwin: the appearance of purposive structure in nature is an illusion produced by selection. The Gita: dharma is both the cosmic structure of reality and the individual's alignment with it — nature has a righteous order that can be aligned with or violated. Darwin's mechanism removes the metaphysical foundation on which dharma as cosmic order rests."
  },
  {
    "id": "ec_024",
    "source": "cd_003",
    "target": "bo_014",
    "type": "contradicts",
    "weight": 3,
    "label": "Evolved moral sense vs. virtue as relation to cosmic good",
    "notes": "Darwin: the moral sense is an evolved disposition with identifiable precursors in other social animals — it has a natural history. Boethius: the good are ultimately rewarded because virtue makes you more fully human in a specifically cosmic sense — virtue is your alignment with the Good itself. Darwin's naturalization of the moral sense removes the metaphysical grounding on which Boethius's claim about the rewarding of virtue depends."
  },
  {
    "id": "ec_025",
    "source": "sw_002",
    "target": "fn_009",
    "type": "contradicts",
    "weight": 3,
    "label": "Decreation vs. self-overcoming",
    "notes": "One of the clearest directional contradicts in the graph. Nietzsche: self-overcoming is the continual process of identifying your current limits and surpassing them — the movement is always upward and outward. Weil: decreation is the voluntary reduction of the ego's claim to be the centre of reality — the movement is inward and downward. Not building up but clearing away. Both are serious and both are demanding; they go in opposite directions."
  },
  {
    "id": "ec_026",
    "source": "sw_001",
    "target": "fn_007",
    "type": "contradicts",
    "weight": 3,
    "label": "Psychological gravity vs. will to power as self-expansion",
    "notes": "Weil: everything obeys gravity — humans naturally fall toward comfort, self-assertion, and ego protection. Grace is the only force that moves against this tendency and it cannot be produced by the person who needs it. Nietzsche: the will to power is the fundamental drive — the self that cannot expand and overcome is simply weak. Weil says the Nietzschean self-expanding drive is what gravity looks like in human psychology. Nietzsche would say Weil's decreation is self-weakening dressed as spirituality."
  },
  {
    "id": "ec_027",
    "source": "lz_011",
    "target": "ar_005",
    "type": "contradicts",
    "weight": 2,
    "label": "Uncarved block vs. function argument for development",
    "notes": "Aristotle: eudaimonia is achieved by fulfilling the function specific to human nature — the excellent exercise of rational activity. Development, cultivation, and habit are the means. Laozi: the uncarved block is human potential before it is shaped by education, ambition, and social construction. Most of what civilisation does is carve away at this block in ways that reduce rather than enhance it. One sees development as the path; the other sees return as the path."
  },
  {
    "id": "ec_028",
    "source": "sk_012",
    "target": "ma_003",
    "type": "contradicts",
    "weight": 2,
    "label": "Anxiety as accurate perception of freedom vs. anxiety as cognitive error",
    "notes": "Marcus Aurelius: most anxiety is about things that never happen, things that are over, or things entirely outside your control — it is a systematic cognitive misdirection. Kierkegaard: anxiety is the dizziness of freedom — the accurate experience of what genuine openness feels like from the inside. It is not a pathology but a correct perception. Some anxiety, for Kierkegaard, should not be corrected away but held."
  },
  {
    "id": "ec_029",
    "source": "bo_010",
    "target": "ar_024",
    "type": "contradicts",
    "weight": 3,
    "label": "Unconditional happiness vs. external goods as necessary conditions for flourishing",
    "notes": "One of the clearest structural contradictions in the classical tradition. Aristotle: external goods — health, wealth, friendship, good luck — are genuinely necessary conditions for eudaimonia. You cannot flourish without a minimum of material and social conditions. Boethius: happiness that depends on external conditions is not happiness — it is hostage-taking. Real happiness must be unconditional or it is not real. Both are taking happiness seriously as the highest good; they disagree on whether it can be unconditional."
  },
  {
    "id": "ec_030",
    "source": "bo_010",
    "target": "ar_025",
    "type": "contradicts",
    "weight": 2,
    "label": "Unconditional happiness vs. good life requiring luck",
    "notes": "Aristotle: the good life requires a certain amount of luck — you must be born into decent conditions, avoid catastrophic misfortune, and live long enough. The tragic hero who loses everything through no fault of their own is not flourishing. Boethius: Fortune's wheel turns without malice — the person who understood from the start that Fortune's gifts were revocable would not be destroyed by their loss."
  },
  {
    "id": "ec_031",
    "source": "ma_002",
    "target": "ar_024",
    "type": "contradicts",
    "weight": 2,
    "label": "Inner retreat as sufficient vs. external goods as necessary",
    "notes": "Marcus Aurelius: you can always retreat into your own mind — it is the one territory no external force can occupy. This implies that genuine wellbeing is available regardless of external conditions. Aristotle: external goods are genuinely necessary conditions for flourishing — the inner life alone is not sufficient. A Stoic sage in chains is not flourishing in Aristotle's sense."
  },
  {
    "id": "ec_032",
    "source": "sk_018",
    "target": "ar_027",
    "type": "contradicts",
    "weight": 2,
    "label": "Teleological suspension of ethical vs. equity as justice's highest form",
    "notes": "Aristotle: equity is the correction of law's necessary generality by attention to the specific case — the highest form of justice is more attentive to particulars, not less bound by the universal. Kierkegaard: the knight of faith's absolute duty to God overrides the universal moral law entirely — the individual's relation to the absolute is categorically higher than justice. These are incompatible accounts of the relation between particular obligation and universal law."
  },
  {
    "id": "ec_033",
    "source": "ht_015",
    "target": "ar_019",
    "type": "contradicts",
    "weight": 2,
    "label": "Solitude as sufficient vs. friendship as constitutive of flourishing",
    "notes": "Aristotle: friendship is not a luxury or supplement to the good life — it is partly constitutive of it. Without genuine friendship, something essential to flourishing is missing. Thoreau: solitude is the satisfying fullness of your own company — not loneliness but its opposite. Most people have never experienced genuine solitude because they have never stopped filling the silence. The two accounts of what a complete human life requires are in direct tension."
  },
  {
    "id": "ec_034",
    "source": "sk_015",
    "target": "ar_033",
    "type": "contradicts",
    "weight": 2,
    "label": "Crowd as untruth vs. city as natural to humans",
    "notes": "Aristotle: the city — the political community — is natural to humans in the same sense that the bee's hive is natural to the bee. Human nature is fulfilled in the polis, not despite it. Kierkegaard: the crowd is untruth — existential truth requires a single individual's passionate appropriation and the moment it becomes a crowd's position it has lost the thing that made it truth. The collective is constitutive for Aristotle; it is the obstacle for Kierkegaard."
  },
  {
    "id": "ec_035",
    "source": "cd_001",
    "target": "ar_005",
    "type": "contradicts",
    "weight": 2,
    "label": "Differences of degree not kind vs. function argument for human distinctiveness",
    "notes": "Aristotle: every thing has a function specific to it, and the highest good for humans is the excellent exercise of what is distinctively human — rational activity. This requires that humans are genuinely distinct from other animals in kind. Darwin: the differences between humans and other animals are of degree, not of kind — every capacity used to define human uniqueness exists in some form in other species. Darwin's finding undermines the categorical distinctiveness on which Aristotle's function argument depends."
  },
  {
    "id": "ec_041",
    "source": "cd_007",
    "target": "ar_005",
    "type": "contradicts",
    "weight": 2,
    "label": "Intelligence as contingent local solution vs. rational activity as human function",
    "notes": "Darwin: natural selection has no preference for consciousness or intelligence — these emerged because they happened to confer survival advantages in specific environments. They could have not emerged. Human intelligence is a local contingent solution to a local problem. Aristotle: rational activity is the function specific to humans — the excellent exercise of which constitutes the highest good. Aristotle's function argument assumes that rational activity is what humans are for in a way that Darwin's account of its origin does not support."
  },
  {
    "id": "ec_036",
    "source": "bo_013",
    "target": "fd_002",
    "type": "contradicts",
    "weight": 2,
    "label": "Evil as privation vs. evil as a genuine positive force",
    "notes": "Boethius: evil is not a positive force — it is an absence, a privation, a failure of the good. The wicked are not powerful; they have lost alignment with the good. Ivan Karamazov's argument in Dostoevsky: the suffering of innocent children is a genuine positive evil that no providential framework can account for by calling it an absence of good. Ivan's rebellion depends on evil being something real, not merely a privation."
  },
  {
    "id": "ec_037",
    "source": "ag_008",
    "target": "ac_009",
    "type": "contradicts",
    "weight": 2,
    "label": "Hope can be redirected vs. the absurd man does not hope",
    "notes": "Gawande: there are different kinds of hope — shifting from hope for cure to hope for a good death is not the abandonment of hope but its most intelligent form. Hope is always available, just perhaps differently directed. Camus: the absurd man does not hope — hope is a subtle form of self-deception that trades the present for a future that may never arrive. Living without hope is clarity, not despair. Both are serious responses to finitude; they are structurally incompatible."
  },
  {
    "id": "ec_038",
    "source": "lz_013",
    "target": "ar_015",
    "type": "contradicts",
    "weight": 2,
    "label": "Wisdom subtracts vs. contemplative life as highest",
    "notes": "Aristotle: the contemplative life — the life of pure intellectual activity — is the highest human life and the one most closely approximating the divine. It involves accumulation and exercise of the highest intellectual capacities. Laozi: to pursue the Tao is to subtract every day — to remove the unnecessary, the performed, the accumulated armour of the ego. Knowledge accumulates; wisdom subtracts. The directions of the highest human aspiration are opposite."
  },
  {
    "id": "ec_039",
    "source": "sk_011",
    "target": "ar_007",
    "type": "contradicts",
    "weight": 2,
    "label": "Discontinuous leaps vs. virtue as gradual developmental habit",
    "notes": "Aristotle: virtue is acquired by practice — you become courageous by doing courageous things, just by doing just things. The process is gradual, cumulative, and continuous. Kierkegaard: the most important transitions in human existence — from aesthetic to ethical, from ethical to religious — are separated by leaps that cannot be derived from what precedes them. The decisive changes are not developmental but discontinuous."
  },
  {
    "id": "ec_040",
    "source": "eb_012",
    "target": "ma_003",
    "type": "contradicts",
    "weight": 2,
    "label": "Anxiety as appropriate response to human condition vs. anxiety as cognitive error",
    "notes": "Becker: anxiety is not a malfunction — it is the appropriate response to the human condition honestly perceived. The person who is not anxious has not looked clearly at their situation. Marcus Aurelius: most anxiety is about things that never happen, things that are over, or things entirely outside your control. The disagreement is about whether baseline existential anxiety is epistemically warranted or systematically mistaken."
  },
  {
    "id": "ec_042",
    "source": "ac_005",
    "target": "bp_013",
    "type": "contradicts",
    "weight": 3,
    "label": "Religion as philosophical suicide vs. faith as choice in presence of doubt",
    "notes": "Pascal: faith is a choice made in the presence of genuine doubt — it is not the suppression of uncertainty but a rational response to it under conditions of asymmetric stakes. Camus: leaping into religion to resolve the absurd is philosophical suicide — the most common and most dishonest escape. It is hope dressed as courage. Both are taking the question of God seriously under conditions of genuine uncertainty; they reach directly opposite prescriptions."
  },
  {
    "id": "ec_043",
    "source": "fn_012",
    "target": "vf_007",
    "type": "contradicts",
    "weight": 2,
    "label": "Pity as condescension vs. love as the highest human capacity",
    "notes": "Frankl: love is the highest and most complete act of which a human being is capable — in the camps, the inner image of a beloved person could sustain life when nothing else could. Nietzsche: pity — the sympathetic response to another's suffering — is not a virtue but a form of condescension that diminishes both parties. Nietzsche is not making a narrow claim about pity; he is making a broad claim about the orientation toward others' weakness that love, for Frankl, is precisely about."
  },
  {
    "id": "ec_044",
    "source": "lz_026",
    "target": "fn_024",
    "type": "contradicts",
    "weight": 2,
    "label": "Those who know do not speak vs. philosopher as legislator of new values",
    "notes": "Nietzsche: the philosopher must be a legislator of new values — someone with the courage and capacity to articulate, proclaim, and impose new frameworks of meaning after the death of God. The philosopher speaks with authority about values. Laozi: those who know do not speak; those who speak do not know. The deepest wisdom exceeds language and those who proclaim it loudest are furthest from it."
  },
  {
    "id": "ec_045",
    "source": "ht_022",
    "target": "ar_026",
    "type": "contradicts",
    "weight": 2,
    "label": "Individual conscience as only obligation vs. justice as virtue toward others",
    "notes": "Aristotle: justice is the complete virtue — it is virtue exercised in relation to others. Moral life is inherently social and justice is its highest expression. Thoreau: the only obligation a person has is to do what they believe is right. Law, custom, majority opinion, and social pressure are all subordinate to individual conscience. The social dimension is constitutive for Aristotle; it is an external pressure to be resisted for Thoreau."
  },
  {
    "id": "ec_046",
    "source": "sw_019",
    "target": "fd_011",
    "type": "contradicts",
    "weight": 2,
    "label": "Impersonal justice as purification vs. concrete personal love as essential",
    "notes": "Dostoevsky (Zosima): love actively, love concretely, love the person in front of you right now — not humanity in the abstract. Weil: the move from the personal toward the impersonal is not the destruction of the human but its purification. Impersonal justice does not require personal feeling and is more reliably available precisely because it is not dependent on sympathy. Both are making demands on the quality of attention given to the other; they pull in different directions on whether impersonal or concrete personal engagement is higher."
  },
  {
    "id": "ec_047",
    "source": "sk_026",
    "target": "vf_002",
    "type": "contradicts",
    "weight": 2,
    "label": "Secular selfhood as structurally incomplete vs. discovered meaning as sufficient",
    "notes": "Frankl: meaning is discovered in relationships, work, and the response to unavoidable suffering — secular discovery is sufficient and does not require theological grounding. Kierkegaard: secular selfhood is structurally incomplete because the self is a relation that includes a relation to the power that established it. The discovered meaning Frankl describes remains, for Kierkegaard, within the register of the ethical — it cannot reach the religious."
  },
  {
    "id": "em_001",
    "source": "bp_008",
    "target": "ac_001",
    "type": "mirrors",
    "weight": 3,
    "label": "Silence of infinite spaces vs. universe's silence to human need",
    "notes": "Pascal writes that the silence of infinite spaces terrifies him — the universe is completely indifferent. Camus opens the Myth of Sisyphus with almost the same observation: the absurd is born from the collision between the human need for clarity and the universe's complete silence. Three centuries apart, Christian apologist and atheist existentialist, identical experience of the same confrontation. One of the clearest mirrors in the graph."
  },
  {
    "id": "em_002",
    "source": "ht_023",
    "target": "lz_023",
    "type": "mirrors",
    "weight": 3,
    "label": "Rich in what you can afford to let alone vs. enough is enough",
    "notes": "Thoreau: a man is rich in proportion to the number of things he can afford to let alone. Laozi: the person who knows when enough is enough will always have enough. Two of the clearest formulations of the same inversion — wealth redefined as freedom from the need to acquire rather than as accumulation. Arrived at through experiment (Thoreau) and aphorism (Laozi) across 2400 years."
  },
  {
    "id": "em_003",
    "source": "bo_019",
    "target": "ac_006",
    "type": "mirrors",
    "weight": 3,
    "label": "Consolation as clarity not relief vs. revolt without resolution",
    "notes": "Boethius: Philosophy does not offer comfort by removing difficulty — she offers it by reframing what difficulty is and what it is for. The consolation is not relief — it is clarity. Camus: revolt — living without resolution in full awareness that nothing is cosmically guaranteed — is the only honest response to the absurd. Both are describing the same orientation: face the full weight of the situation without flinching or resolving it. Christian Neoplatonist and French atheist, structurally identical. Separated by 1400 years."
  },
  {
    "id": "em_004",
    "source": "lz_016",
    "target": "ma_008",
    "type": "mirrors",
    "weight": 3,
    "label": "Highest virtue does not think itself virtuous vs. virtue unwitnessed",
    "notes": "Marcus Aurelius: do the right thing without needing anyone to notice — virtue witnessed and unwitnessed are the same thing or they are neither. Laozi: the highest virtue does not think of itself as virtuous — the person constantly performing goodness has already lost the thing they are performing. Two independent traditions describing the same internal structure of genuine virtue: it is unconscious of itself and indifferent to observation."
  },
  {
    "id": "em_005",
    "source": "bb_021",
    "target": "bp_002",
    "type": "mirrors",
    "weight": 2,
    "label": "Universe knowing itself through human mind vs. thinking reed",
    "notes": "Bryson: we are the universe's way of knowing itself — the atoms forged in stars now arranged so they can contemplate their own origin. Pascal: man is the weakest thing in nature, a reed that can be crushed by a drop of water — but even if the universe crushed him, man would be nobler than what kills him because he knows he is dying and the universe knows nothing. Physics and theology arriving at the same observation: human consciousness is distinctive precisely in its capacity for self-aware knowing of the whole."
  },
  {
    "id": "em_006",
    "source": "sk_024",
    "target": "fn_015",
    "type": "mirrors",
    "weight": 3,
    "label": "Repetition as receiving the past as new vs. amor fati",
    "notes": "Nietzsche: amor fati — love your fate. Not mere acceptance but active love: the transformation of what has happened from something endured into something affirmed. Kierkegaard: repetition is the creative reception of what has been — facing forward but recovering what was as genuinely new. Both are describing the same fundamental reorientation toward the past: from grief or mere acceptance toward active affirmation. From thinkers who disagree about almost everything else."
  },
  {
    "id": "em_007",
    "source": "mm_034",
    "target": "sk_017",
    "type": "mirrors",
    "weight": 2,
    "label": "Transmitting the motion of thinking vs. indirect communication",
    "notes": "Kierkegaard writes under pseudonyms specifically to prevent himself from becoming an authority whose conclusions are received rather than appropriated — indirect communication is a philosophical necessity. Montaigne: what he transmits in the Essays is not conclusions but the motion of his thinking — the actual process of a mind working through things honestly. Both are making the same methodological claim: the most valuable thing to transmit is the movement of inquiry, not its results."
  },
  {
    "id": "em_008",
    "source": "bb_003",
    "target": "ma_004",
    "type": "mirrors",
    "weight": 2,
    "label": "Borrowed atoms vs. transformation not loss",
    "notes": "Marcus Aurelius: everything that exists is in constant transformation — nothing is lost, it changes form. Grief over loss misunderstands the nature of reality. Bryson: the atoms that make up your body have been part of countless other things — stars, rocks, ancient seas, other organisms. You are temporarily borrowing matter that has existed since the beginning of the universe. Physics and Stoic metaphysics arriving at the same observation about the nature of impermanence."
  },
  {
    "id": "em_009",
    "source": "lz_003",
    "target": "bg_005",
    "type": "mirrors",
    "weight": 3,
    "label": "Tao acts without claiming vs. karma yoga acting without attachment to fruits",
    "notes": "Bhagavad Gita: act without attachment to the fruits of action — work as an instrument of a larger process without claiming the outcomes. Laozi: the Tao produces everything and possesses nothing — it acts and takes no credit, nourishes and does not control. The structural description is identical. Two of the oldest wisdom traditions in the world, independent of each other, describing the same mode of action as the highest."
  },
  {
    "id": "em_010",
    "source": "sw_016",
    "target": "lz_004",
    "type": "mirrors",
    "weight": 3,
    "label": "Receptive waiting vs. wu wei",
    "notes": "Laozi: wu wei is action so perfectly aligned with the nature of things that it requires no force and leaves no unnecessary trace — receptive attunement rather than imposition. Weil: waiting — the patient, non-demanding waiting that Weil describes — is the most active possible orientation toward what cannot be forced. The person who grasps closes themselves to what they need. Two independent traditions — Taoism and Weil's mystical Christianity — describing the same orientation of non-grasping receptivity as the highest form of engagement."
  },
  {
    "id": "em_011",
    "source": "sw_016",
    "target": "bg_016",
    "type": "mirrors",
    "weight": 3,
    "label": "Waiting as most active orientation vs. prapatti as active surrender",
    "notes": "The Gita: prapatti — the most profound form of surrender — is not passive resignation but the most active possible engagement: complete openness to what is required rather than insistence on what is preferred. Weil: waiting is not passivity — it is the most active possible orientation toward what cannot be forced. Three independent traditions (add lz_004 for a three-way cluster) describing receptive non-grasping as the highest activity."
  },
  {
    "id": "em_012",
    "source": "bp_010",
    "target": "cd_018",
    "type": "mirrors",
    "weight": 2,
    "label": "Heart has reasons that reason does not know vs. instinct as accumulated wisdom",
    "notes": "Pascal: the heart has reasons that reason does not know — some things are known by direct apprehension, not by argument. This is a precise observation about the architecture of cognition. Darwin: instinct is the accumulated wisdom of millions of generations of selection — compressed, reliable, and fast. Reason is slower and more prone to error in novel situations. Both are describing a non-rational form of knowing that is not inferior to but often superior to explicit reasoning. Pascal anticipates cognitive science; Darwin provides the mechanism."
  },
  {
    "id": "em_013",
    "source": "eb_013",
    "target": "as_018",
    "type": "mirrors",
    "weight": 3,
    "label": "Vital lie of character vs. deception of nature",
    "notes": "One of the most striking mirrors in the graph because neither author knew the other's framework. Becker: the vital lie of character — the carefully maintained illusions that allow a person to function — is necessary. Full awareness of our condition would be paralysing. Smith: the deception of nature — the systematic self-deception that leads people to pursue wealth and status even though the impartial spectator would not endorse this — is what drives the economic activity in which all flourish. Both are describing a productive and necessary self-deception at the heart of human civilisation."
  },
  {
    "id": "em_014",
    "source": "mm_008",
    "target": "as_006",
    "type": "mirrors",
    "weight": 3,
    "label": "Judging others by actions and selves by intentions vs. self-deceit as greatest moral failure",
    "notes": "Smith: self-deceit is the greatest source of human moral failure — we are systematically biased toward seeing ourselves favourably and finding reasons why the rules that apply to others do not apply to us. Montaigne: we judge others by their actions and ourselves by our intentions — a specific and highly consequential instance of the same asymmetry. Both are describing the same systematic distortion; Montaigne names the mechanism, Smith names the stakes."
  },
  {
    "id": "em_015",
    "source": "as_005",
    "target": "ma_008",
    "type": "mirrors",
    "weight": 3,
    "label": "Praiseworthy vs. praised vs. virtue witnessed and unwitnessed",
    "notes": "Marcus Aurelius: virtue witnessed and virtue unwitnessed are the same thing, or they are neither. Smith: the desire to be praiseworthy — to actually merit the praise of the impartial spectator regardless of whether it is forthcoming — is fundamentally different from the desire to be praised. Both are making the same distinction: the internal reality of virtue and the external appearance of virtue must not be confused, and genuine virtue is indifferent to observation."
  },
  {
    "id": "em_016",
    "source": "as_003",
    "target": "ar_029",
    "type": "mirrors",
    "weight": 3,
    "label": "Impartial spectator vs. we are bad judges of our own cases",
    "notes": "Aristotle: we are bad judges of our own cases — self-interest, self-love, and the desire to find things as we wish them to be systematically distort self-assessment. Smith: the impartial spectator is the internalized imaginary figure whose perspective you consult when assessing your own conduct — a disinterested observer with no stake in the outcome. Both are proposing the same structural solution to the same structural problem: that genuine self-assessment requires the adoption of an external perspective."
  },
  {
    "id": "em_017",
    "source": "as_009",
    "target": "ar_009",
    "type": "mirrors",
    "weight": 3,
    "label": "Propriety as situational standard vs. virtue as the situational mean",
    "notes": "Aristotle: virtue is the mean between extremes — not arithmetic middle but the right response appropriate to the situation, determined by the person of practical wisdom. Smith: propriety is the appropriateness of an action or sentiment to its situation — before asking whether an action is useful or harmful, ask whether it fits. Both are insisting on the same structure: that moral correctness is inherently situational and cannot be reduced to a fixed rule."
  },
  {
    "id": "em_018",
    "source": "mm_006",
    "target": "ag_010",
    "type": "mirrors",
    "weight": 2,
    "label": "Near-death clarifies what philosophy cannot vs. medical knowledge insufficient",
    "notes": "Montaigne's riding accident gave him empirical evidence that dying is not terrible — the body cooperates in a gentle dissolution. The experience taught what philosophy reaches toward by argument. Gawande: his father — a neurosurgeon — had to navigate the same vulnerabilities as any patient when dying. Medical knowledge is not sufficient. Knowledge and wisdom are not the same thing. Both are describing the same moment: proximity to death as the teacher that no theoretical preparation fully replaces."
  },
  {
    "id": "em_019",
    "source": "mm_009",
    "target": "ag_005",
    "type": "mirrors",
    "weight": 3,
    "label": "Philosophy as learning to die vs. good death as authoring one's ending",
    "notes": "Montaigne: to philosophise is to learn to die — the practical work of confronting mortality and accepting impermanence is preparation for the one event that admits no further preparation. Gawande: a good death is a death in which the person remains the author of their own story rather than the object of medical management. Both are insisting that death requires preparation and that the quality of dying is a legitimate object of human concern and craft."
  },
  {
    "id": "em_020",
    "source": "ht_003",
    "target": "ag_002",
    "type": "mirrors",
    "weight": 3,
    "label": "Cost measured in life vs. meaningful life over safe life",
    "notes": "Thoreau: the cost of a thing is the amount of life you are required to exchange for it — can you afford it in life, not money? Gawande: there is a difference between a safe life and a meaningful life, and when patients are actually asked they consistently prefer meaning over safety. Both are making the same claim about how value should be measured: not in safety, comfort, or money but in lived experience and meaning. One from 1854, one from 2014."
  },
  {
    "id": "em_021",
    "source": "bp_021",
    "target": "ht_021",
    "type": "mirrors",
    "weight": 3,
    "label": "We care more about what others think than what we are vs. public opinion as most powerful force",
    "notes": "Pascal: we care far more about what others think of us than about what we actually are — our entire social existence is a performance for an audience whose opinion we have wildly overestimated. Thoreau: public opinion is one of the most powerful and least examined forces in human life — most people govern themselves almost entirely by what others think or might think. Same diagnosis; Pascal emphasises the vanity, Thoreau emphasises the conformity."
  },
  {
    "id": "em_022",
    "source": "bp_021",
    "target": "as_020",
    "type": "mirrors",
    "weight": 2,
    "label": "Performance for overestimated audience vs. approbation as primary motivation",
    "notes": "Smith: approbation — the approval of others — is what human beings most fundamentally desire. Not pleasure in the narrow sense but the sense that we are seen favourably. A moral philosophy that ignores this will consistently misunderstand why people do what they do. Pascal: we care far more about what others think than about what we actually are. Both are describing the same motivational reality; Smith builds a moral philosophy on it, Pascal diagnoses it as a source of disorder."
  },
  {
    "id": "em_023",
    "source": "sw_018",
    "target": "fn_015",
    "type": "mirrors",
    "weight": 3,
    "label": "Consenting to necessity as active freedom vs. amor fati",
    "notes": "Nietzsche: amor fati — not mere acceptance of what has happened but active love: the transformation of fate from something endured into something affirmed. Weil: the person who genuinely consents to necessity — who affirms what cannot be changed rather than merely submitting to it — has performed an act of freedom unavailable to one who simply fights or is crushed. Same structure: necessity acknowledged, then actively affirmed rather than merely tolerated. Christian mystic and atheist nihilist."
  },
  {
    "id": "em_024",
    "source": "sw_018",
    "target": "ma_003",
    "type": "mirrors",
    "weight": 2,
    "label": "Consenting to necessity vs. most anxiety concerns what cannot be controlled",
    "notes": "Marcus Aurelius: most anxiety is about things entirely outside your control — the present moment is almost always manageable. The solution is attending to what is within your control and releasing what is not. Weil: the person who genuinely consents to necessity — who affirms rather than merely submits — has performed an act of freedom. Different routes to the same fundamental orientation: active engagement with what is versus futile resistance to what must be."
  },
  {
    "id": "em_025",
    "source": "sw_018",
    "target": "vf_010",
    "type": "mirrors",
    "weight": 3,
    "label": "Consenting to necessity as freedom vs. courage of bearing what cannot be changed",
    "notes": "Frankl: there is a form of courage specific to suffering — the courage to bear it with dignity when it cannot be changed. This is a genuine human achievement, not passive resignation. Weil: the person who genuinely consents to necessity has performed an act of freedom that is unavailable to one who either fights or is simply crushed. Both are describing the same move — from submission to active affirmation — as a genuine achievement rather than defeat."
  },
  {
    "id": "em_026",
    "source": "fn_019",
    "target": "sk_024",
    "type": "mirrors",
    "weight": 3,
    "label": "Eternal recurrence as test vs. repetition as receiving the past as new",
    "notes": "Functionally one of the most significant mirrors in the graph because the two thinkers stand in genuine opposition. Nietzsche: the eternal recurrence — could you will that every moment of your life return infinitely? — is the ultimate test of amor fati. Kierkegaard: repetition is not mere recurrence but the creative reception of what has been as genuinely new. Both are describing a relationship to the past that is actively affirmative rather than grieving or merely accepting. They arrive at the same formal structure from opposite philosophical premises."
  },
  {
    "id": "em_027",
    "source": "cd_021",
    "target": "bb_019",
    "type": "mirrors",
    "weight": 3,
    "label": "Grandeur in the view of life vs. wonder as discipline",
    "notes": "Bryson: the correct response to existence is sustained active wonder — a deliberate refusal to take the improbability of everything for granted. Darwin: there is grandeur in this view of life — from so simple a beginning, endless forms most beautiful and most wonderful. Both are insisting that the scientific worldview, far from producing nihilism, generates a specific and demanding form of wonder that requires no supernatural supplement."
  },
  {
    "id": "em_028",
    "source": "cd_021",
    "target": "ht_025",
    "type": "mirrors",
    "weight": 2,
    "label": "Grandeur in evolution vs. sleepwalking through the astonishing",
    "notes": "Thoreau: most people sleepwalk through experiences that are, if examined, genuinely extraordinary — familiarity has made the astonishing invisible. Darwin: the grandeur in the view of life — the vast timescales, the endless forms, the common descent — is available to anyone willing to actually look. Both are insisting on the same failure of attention and the same remedy: looking at what is actually there."
  },
  {
    "id": "em_029",
    "source": "ma_004",
    "target": "lz_025",
    "type": "mirrors",
    "weight": 2,
    "label": "Nothing lost, everything transforms vs. death as phase in the Tao's process",
    "notes": "Laozi: the Tao gives birth to all things, nourishes them, develops them, and returns them to itself — death is not an exit from the process but a phase in it. Marcus Aurelius: everything that exists is in constant transformation — nothing is lost, it changes form. Stoic metaphysics and Taoist metaphysics arriving at the same consolation about death through completely different cosmological frameworks."
  },
  {
    "id": "em_030",
    "source": "as_022",
    "target": "bo_005",
    "type": "mirrors",
    "weight": 3,
    "label": "Poor man's son thought experiment vs. false goods",
    "notes": "Boethius: most of what humans pursue — wealth, power, fame — are false goods, not because they are worthless but because they are external, contingent, and revocable. Smith: the poor man's son pursues wealth and distinction his whole life, attains them in old age, and discovers they are empty — he sacrificed the things that actually constitute wellbeing for something he never really wanted. Both are describing the same structure: the mismatch between what is pursued and what is actually needed."
  },
  {
    "id": "em_031",
    "source": "as_008",
    "target": "fn_016",
    "type": "mirrors",
    "weight": 2,
    "label": "Admiring the rich as moral corruption vs. herd instinct toward conformity",
    "notes": "Nietzsche: the herd instinct — the tendency to find safety in numbers — produces conformity, the levelling of excellence, and the subordination of the genuinely valuable to the merely popular. Smith: the natural tendency to admire the rich and powerful and despise the poor is one of the greatest sources of moral corruption in any society. Different analyses of the same fundamental distortion: the social pressure to defer to what is successful or numerous regardless of its genuine value."
  },
  {
    "id": "em_032",
    "source": "as_019",
    "target": "sk_015",
    "type": "mirrors",
    "weight": 2,
    "label": "Man of system moving pieces on chessboard vs. crowd as untruth",
    "notes": "Kierkegaard: the crowd is untruth — truth about existence requires individual passionate appropriation and becomes distorted when it becomes a crowd's position. Smith: the man of system imagines he can move human beings like pieces on a chessboard, forgetting that each piece has its own principle of motion. Both are insisting on the irreducibility of the individual against the systematic — one from an epistemological angle, one from a political one."
  },
  {
    "id": "em_033",
    "source": "fd_011",
    "target": "sw_004",
    "type": "mirrors",
    "weight": 3,
    "label": "Love the concrete person in front of you vs. love as attention asking what you are going through",
    "notes": "The densest and most important converge-quality mirrors cluster in the graph. Dostoevsky (Zosima): love actively, love concretely, love the person in front of you right now — not humanity in the abstract. Weil: the love of neighbour is not a feeling but a form of attention — specifically the attention that asks of another: what are you going through? Both are insisting that genuine love is a mode of attention directed at the particular, present, specific other. Orthodox Christian literary voice and French mystic; same claim."
  },
  {
    "id": "em_034",
    "source": "mm_019",
    "target": "ar_019",
    "type": "mirrors",
    "weight": 3,
    "label": "Friendship of highest kind based on irreducible value of other vs. character friendship",
    "notes": "Aristotle: complete friendship is based on character — the recognition and appreciation of what is genuinely good in the other, not on utility or pleasure. It is rare and slow to develop. Montaigne on La Boetie: friendship of the highest kind is based on the recognition of something irreducibly valuable in the other person — not shared interest, not utility, not pleasure. Because it was he, because it was I. The descriptions are structurally identical across 1800 years."
  },
  {
    "id": "em_035",
    "source": "bg_012",
    "target": "ar_013",
    "type": "mirrors",
    "weight": 2,
    "label": "Viveka as discriminative intelligence vs. moral perception as partly aesthetic",
    "notes": "Aristotle: the person with practical wisdom does not apply a principle — they perceive what the situation actually requires. Moral perception is partly aesthetic — it is a trained sensitivity to the morally relevant features of situations. The Gita: viveka is the discriminative intelligence that distinguishes the real from the unreal, the essential from the accidental — a trained perceptual capacity, not rule-following. Both are describing the same cognitive achievement: direct perception of what matters, arrived at through development rather than calculation."
  },
  {
    "id": "em_036",
    "source": "eb_004",
    "target": "ac_014",
    "type": "mirrors",
    "weight": 2,
    "label": "Denial of death as foundation of civilisation vs. creating in full awareness",
    "notes": "Camus: a novel or painting does not solve anything — its value is in the act of making it under conditions of full awareness. The work is proof that the creator refused to look away. Becker: the greatest human achievements are driven by the terror of death — every cathedral and symphony is at some level a structure built to make the builder feel permanent. Both are locating the creative act in relation to mortality; they differ on whether this is honest revolt or denial, but agree on the motivational structure."
  },
  {
    "id": "em_037",
    "source": "cd_006",
    "target": "bb_003",
    "type": "mirrors",
    "weight": 2,
    "label": "Common descent as literal universal kinship vs. borrowed atoms",
    "notes": "Bryson: the atoms in your body have been part of stars, rocks, ancient seas, other organisms — you are temporarily borrowing matter that has existed since the beginning of the universe. Darwin: common descent means every living thing on Earth is literally related through an unbroken chain stretching back 3.8 billion years. Both are making the same structural point about deep kinship between the human and everything else — one through chemistry, one through genealogy."
  },
  {
    "id": "em_038",
    "source": "as_014",
    "target": "mm_016",
    "type": "mirrors",
    "weight": 3,
    "label": "Custom shapes moral judgment far more than acknowledged vs. custom as tyrant of moral imagination",
    "notes": "Montaigne: custom is the tyrant of moral imagination — most of what people regard as natural, universal, and obviously true is custom, the accumulated sediment of historical accident elevated to the status of necessity. Smith: custom and fashion have an enormous influence on moral judgment, far more than most moral philosophers acknowledge. Both are making the same corrosive observation: the baseline of moral intuition is largely cultural and historical, not rational or universal."
  },
  {
    "id": "em_039",
    "source": "ag_014",
    "target": "ac_007",
    "type": "mirrors",
    "weight": 2,
    "label": "Narrowing toward what matters most as mortality approaches vs. revolt generating breadth",
    "notes": "Camus: revolt against the absurd generates breadth of experience, because breadth replaces depth when eternity is off the table. Gawande (citing Carstensen): as mortality becomes proximate, people consistently narrow toward what matters most — deepest relationships, most significant experiences. The two movements are complementary rather than opposed: Camus describes the early-life response to mortality awareness, Carstensen/Gawande describe the late-life response."
  },
  {
    "id": "em_040",
    "source": "fn_015",
    "target": "bg_005",
    "type": "mirrors",
    "weight": 3,
    "label": "Amor fati vs. karma yoga acting without attachment to fruits",
    "notes": "One of the most structurally precise mirrors in the graph. The Gita: act without attachment to outcomes — perform the action fully, release the fruit completely. Nietzsche: amor fati — not just acceptance of what has happened but active love: affirm what is and what has been. Both describe a fundamental reorientation away from outcome-dependence toward the intrinsic engagement with the action or the moment itself. Hindu philosophy and German nihilism; identical structure."
  },
  {
    "id": "em_041",
    "source": "sw_007",
    "target": "bp_004",
    "type": "mirrors",
    "weight": 3,
    "label": "Void must be held not filled vs. inability to sit quietly in a room alone",
    "notes": "Pascal: all of humanity's problems stem from the inability to sit quietly in a room alone — distraction is a deliberate strategy to avoid confronting our condition. Weil: the void — the empty space left when all consolations are removed — must be held rather than immediately filled. The person who fills it with the first available consolation has prevented the only thing that could actually help. Both are describing the same pathological movement — the filling of necessary emptiness — and both insist on the same necessity: holding the emptiness."
  },
  {
    "id": "em_042",
    "source": "ma_017",
    "target": "lz_008",
    "type": "mirrors",
    "weight": 2,
    "label": "Time as river of vanishing moments vs. water as supreme model",
    "notes": "Marcus Aurelius: time is a river of vanishing moments — past is gone, future not yet real, present already slipping away. The metaphor implies that the correct response is to move with rather than against the current. Laozi: water is the central model for the Tao — it finds the lowest path, follows it with complete commitment, and over time nothing is more powerful. Both are using flowing water as the philosophical model for the correct relationship to time and change: go with, not against."
  },
  {
    "id": "em_043",
    "source": "cd_004",
    "target": "as_001",
    "type": "mirrors",
    "weight": 3,
    "label": "Sympathy as evolutionary foundation of morality vs. sympathy as foundation of moral judgment",
    "notes": "Adam Smith: the foundation of moral judgment is sympathy — the imaginative capacity to place yourself in another person's situation. Darwin: sympathy is the foundation of the social instincts from which all higher moral development grows. Darwin provides the evolutionary mechanism for precisely what Smith identified as the psychological foundation. Different centuries, different methods — the same claim about what grounds morality."
  },
  {
    "id": "em_044",
    "source": "eb_006",
    "target": "fn_003",
    "type": "mirrors",
    "weight": 2,
    "label": "Immortality projects as vehicles for transcending mortality vs. secular ideologies as God-substitutes",
    "notes": "Nietzsche: nationalism, secular ideologies, and the cult of progress fill the vacuum left by the death of God — they are attempts to provide meaning and significance without theological grounding. Becker: immortality projects are the specific vehicles through which individuals attempt to transcend mortality — career, religion, nation, children, ideology can all function this way. Both are describing the same psychological dynamic: meaning-structures that carry the weight of transcendence without acknowledging it."
  },
  {
    "id": "em_045",
    "source": "as_015",
    "target": "ma_008",
    "type": "mirrors",
    "weight": 2,
    "label": "Ordinary virtues over heroic vs. virtue unwitnessed same as witnessed",
    "notes": "Marcus Aurelius: do the right thing without needing anyone to notice. Virtue needs no audience. Smith: the virtues he most admires are not the heroic but the ordinary — prudence, justice, beneficence toward those in one's community, and the self-command that allows the others to function. Both are making the same move: against the glorification of the spectacular and in favour of the consistent, unobserved, ordinary exercise of character."
  },
{
    "id": "em_046",
    "source": "eb_003",
    "target": "bb_003",
    "type": "mirrors",
    "weight": 3,
    "label": "The Meat Mirror: Existential dread vs Secular wonder",
    "notes": "Both insist on the radical materiality of the human. Becker identifies the body as an 'embarrassment of meat,' leading to dread. Bryson identifies bodies as 'borrowed atoms from stars,' leading to wonder. Same data point, opposite affective response."
  },
{
    "id": "em_047",
    "source": "bg_032",
    "target": "cd_025",
    "type": "converges",
    "weight": 3,
    "label": "The Meta-Caveat: Social calcification of truth",
    "notes": "Identifies how both spiritual (Gita) and scientific (Darwin) frameworks can be used to calcify contemporary social prejudices (caste and racial hierarchy) into 'Eternal Truths' or 'Natural Laws.'"
  },
  {
    "id": "ev_001",
    "source": "sw_003",
    "target": "mm_037",
    "type": "converges",
    "weight": 3,
    "label": "Attention as receptive waiting converges with art of attention",
    "notes": "Densest attention cluster in the graph. Weil: attention is not concentration but receptive waiting — an emptying of the self to receive what is actually there. Montaigne: the art of attention is the capacity to actually notice what is in front of you, to receive the specific weight and texture of a particular moment. Both treating attention as the foundational capacity underlying all genuine knowing and ethical engagement."
  },
  {
    "id": "ev_002",
    "source": "sw_003",
    "target": "ht_024",
    "type": "converges",
    "weight": 3,
    "label": "Attention as receptive waiting converges with pond as object of sustained attention",
    "notes": "Thoreau: the pond at Walden is an object of sustained philosophical and scientific attention — any single thing, attended to with sufficient care, opens into inexhaustible depth. Weil: genuine attention is the emptying of the self to receive what is actually there. Both insisting on attention as a discipline and a mode of access rather than a tool."
  },
  {
    "id": "ev_003",
    "source": "sw_003",
    "target": "bg_012",
    "type": "converges",
    "weight": 2,
    "label": "Attention as receptive waiting converges with viveka as discriminative intelligence",
    "notes": "The Gita: viveka is the trained perceptual capacity to distinguish the real from the unreal — not rule-following but direct perception. Weil: attention is the receptive suspension of all thought the mind can produce in order to be available to what is actually there. Both describing a cultivated perceptual capacity that goes beyond ordinary cognition."
  },
  {
    "id": "ev_004",
    "source": "sw_003",
    "target": "ar_013",
    "type": "converges",
    "weight": 2,
    "label": "Attention as receptive waiting converges with moral perception as partly aesthetic",
    "notes": "Aristotle: moral perception — the capacity to see what the situation actually requires — is partly aesthetic, a trained sensitivity. Weil: genuine attention is the hardest thing a human being can do and the most important. Both insisting that the most important form of knowing is perceptual, cultivated, and cannot be reduced to calculation."
  },
  {
    "id": "ev_005",
    "source": "sw_024",
    "target": "vf_008",
    "type": "converges",
    "weight": 3,
    "label": "Creative act of seeing the other vs. love perceives essential self",
    "notes": "Frankl: love allows you to see the essential self of another person — not who they are now but who they are capable of becoming. Weil: the person who truly loves their neighbour performs a creative act — they bring into existence, for the other, the experience of being genuinely seen. Both treating love as a form of creative perception that reveals something real about the other."
  },
  {
    "id": "ev_006",
    "source": "fd_011",
    "target": "as_001",
    "type": "converges",
    "weight": 3,
    "label": "Concrete love as attention converges with sympathy as imaginative attention",
    "notes": "Adam Smith: sympathy is the imaginative capacity to place yourself in another's situation and ask how you would feel — it is the foundation of moral judgment. Dostoevsky (Zosima): love actively, love concretely, love the person in front of you right now. Both insisting that genuine moral engagement with the other is fundamentally a form of imaginative, concrete attention."
  },
  {
    "id": "ev_007",
    "source": "cd_004",
    "target": "fd_011",
    "type": "converges",
    "weight": 2,
    "label": "Sympathy as evolutionary foundation converges with concrete love as ethical foundation",
    "notes": "Dostoevsky: concrete love — attending to the specific person in front of you — is the only genuine ethical foundation. Darwin: sympathy is the most important single capacity in the moral evolution of the species. Both locating the ethical foundation in the specific capacity to be moved by another's experience rather than in rational principle."
  },
  {
    "id": "ev_008",
    "source": "as_006",
    "target": "ar_029",
    "type": "converges",
    "weight": 3,
    "label": "Self-deceit as greatest moral failure converges with bad judges of own cases",
    "notes": "Four-way cluster: see also mm_008 and bp_020. Aristotle: we are bad judges of our own cases — self-interest systematically distorts self-assessment. Smith: self-deceit is the greatest source of human moral failure — we are systematically biased toward seeing ourselves favourably. Same diagnosis; Aristotle identifies the structural problem, Smith names it as the primary moral failure."
  },
  {
    "id": "ev_009",
    "source": "as_006",
    "target": "mm_008",
    "type": "converges",
    "weight": 3,
    "label": "Self-deceit as greatest failure converges with judging others by actions, selves by intentions",
    "notes": "Montaigne names the specific mechanism of the asymmetry (actions vs. intentions); Smith names the general phenomenon (self-deceit as the greatest moral failure). Together they constitute the most thorough treatment of the same pathology in the graph."
  },
  {
    "id": "ev_010",
    "source": "as_006",
    "target": "bp_020",
    "type": "converges",
    "weight": 2,
    "label": "Self-deceit as greatest failure converges with self as distorting lens",
    "notes": "Pascal: the self is hateful because it is a fundamentally distorting lens — we see everything in relation to ourselves and therefore almost never see anything clearly. Smith: self-deceit is the greatest source of human moral failure. Pascal frames it as a metaphysical condition; Smith frames it as a moral one. Both are diagnosing the same systematic bias."
  },
  {
    "id": "ev_011",
    "source": "as_001",
    "target": "sw_004",
    "type": "converges",
    "weight": 3,
    "label": "Sympathy as foundation of moral judgment converges with love as attention",
    "notes": "Four-way cluster: see also cd_004 and fd_011. Weil: love of neighbour is a form of attention — asking of another: what are you going through? Smith: sympathy is the imaginative capacity to place yourself in another's situation. Both are describing moral engagement as fundamentally attentive and imaginative rather than rule-governed."
  },
  {
    "id": "ev_012",
    "source": "cd_010",
    "target": "ar_034",
    "type": "converges",
    "weight": 2,
    "label": "Social instincts inherited from primates converges with polis as natural",
    "notes": "Aristotle: the city is natural to humans — to live outside the polis is to be either a beast or a god. Darwin: the social instincts — sympathy, fidelity to the group, mutual aid — are inherited from primate ancestors. Darwin provides the evolutionary grounding for precisely what Aristotle identifies as natural: the human social impulse has deep biological roots."
  },
  {
    "id": "ev_013",
    "source": "ag_019",
    "target": "ma_003",
    "type": "converges",
    "weight": 3,
    "label": "Hospice empirically validates acceptance frameworks",
    "notes": "Most important empirical-philosophical convergence in the graph. Gawande: hospice care — organised around acceptance rather than defeat of death — produces better outcomes by almost every measure including in many cases longer survival. Marcus Aurelius: attending to what can be controlled and releasing what cannot is not resignation but practical wisdom. The empirical finding validates the philosophical orientation."
  },
  {
    "id": "ev_014",
    "source": "ag_019",
    "target": "bo_021",
    "type": "converges",
    "weight": 2,
    "label": "Hospice outcomes converge with adversity as more useful than prosperity",
    "notes": "Boethius: adversity is more useful than prosperity — it reveals the true nature of Fortune, friends, and yourself. Gawande: patients who stop fighting and focus on what matters live better and sometimes longer. Both are making the same counter-intuitive structural claim: the orientation that seems like defeat produces better outcomes than the orientation that seems like fighting."
  },
  {
    "id": "ev_015",
    "source": "ag_019",
    "target": "bg_016",
    "type": "converges",
    "weight": 2,
    "label": "Hospice outcomes converge with prapatti as active surrender",
    "notes": "The Gita: prapatti — complete surrender to what is required — is not passive resignation but the most active possible engagement. Gawande: acceptance of dying, organised into good palliative care, produces measurably better outcomes than aggressive intervention. Empirical and philosophical convergence on the same point: surrender when appropriate is not defeat."
  },
  {
    "id": "ev_016",
    "source": "mm_005",
    "target": "ag_011",
    "type": "converges",
    "weight": 2,
    "label": "Philosophy as learning to die converges with five questions for hard conversation",
    "notes": "Gawande's five questions — what do you understand about your situation, what are your fears, what are your hopes, what are you willing to go through, what is most important to you — are a practical clinical form of what Montaigne describes as the philosophical work of a lifetime: learning to die by confronting mortality, accepting impermanence, and releasing attachment to what cannot be held."
  },
  {
    "id": "ev_017",
    "source": "vf_006",
    "target": "ag_017",
    "type": "converges",
    "weight": 3,
    "label": "Meaning transforms suffering converges with dying person needs narrative",
    "notes": "Frankl: suffering without meaning is unbearable — the moment you assign meaning, its weight changes. Gawande: the dying person needs narrative as much as they need comfort — the capacity to understand one's life as a story with a shape and a possible ending that fits is a primary form of human dignity. Both are treating the meaning-structure of suffering as practically and clinically significant, not merely philosophical."
  },
  {
    "id": "ev_018",
    "source": "ag_005",
    "target": "bo_019",
    "type": "converges",
    "weight": 2,
    "label": "Good death as consistent with values converges with consolation as clarity",
    "notes": "Boethius: Philosophy does not offer relief — she offers clarity. The consolation is not the removal of difficulty but the reframing of what difficulty is. Gawande: a good death is consistent with what the dying person values — not a death without pain or difficulty but a death in which the person remains the author of their own story. Both insisting that the quality of difficult experience depends on its coherence with the person's own framework of value."
  },
  {
    "id": "ev_019",
    "source": "ag_019",
    "target": "sw_018",
    "type": "converges",
    "weight": 2,
    "label": "Hospice outcomes converge with consenting to necessity as freedom",
    "notes": "Weil: the person who genuinely consents to necessity — who affirms rather than fights what cannot be changed — has performed an act of freedom. Gawande: patients who consent to the fact of dying, who redirect their care toward what matters, produce measurably better outcomes. Clinical evidence for the philosophical claim: active acceptance outperforms futile resistance."
  },
  {
    "id": "ev_020",
    "source": "bo_005",
    "target": "ht_006",
    "type": "converges",
    "weight": 3,
    "label": "False goods converges with possessions possessing us",
    "notes": "Thoreau: our possessions possess us — every object you own makes a claim on your attention, time, and energy. Accumulation is self-enslavement. Boethius: most of what humans pursue are false goods — external, contingent, revocable. Both making the same structural claim: the goods most commonly pursued do not produce the wellbeing they promise and actively impede it."
  },
  {
    "id": "ev_021",
    "source": "bo_007",
    "target": "as_023",
    "type": "converges",
    "weight": 3,
    "label": "Fame as most hollow of false goods converges with rank as primary motivator",
    "notes": "Smith: rank and distinction — the desire to be noticed, attended to, seen as superior — is a more powerful motivator than pleasure in any narrow sense. Most wealth-seeking is actually about regard. Boethius: fame depends entirely on the opinions of others, who are themselves mortal, forgetful, and largely indifferent. To build your sense of self on that foundation is to build on sand. Both diagnose the same phenomenon: status-seeking as the primary human motivation and the primary source of misdirected effort."
  },
  {
    "id": "ev_022",
    "source": "as_022",
    "target": "ht_003",
    "type": "converges",
    "weight": 3,
    "label": "Poor man's son thought experiment converges with cost measured in life",
    "notes": "Thoreau: the cost of a thing is the amount of life you are required to exchange for it. The honest question is not 'can I afford it in money?' but 'can I afford it in life?' Smith: the poor man's son sacrifices health, leisure, and genuine relationships for wealth and distinction — he sacrificed the things that constitute wellbeing for something he never really wanted. Both measuring cost in life rather than money."
  },
  {
    "id": "ev_023",
    "source": "as_017",
    "target": "bo_005",
    "type": "converges",
    "weight": 2,
    "label": "Admiring the rich as projected happiness converges with false goods",
    "notes": "Boethius: wealth creates needs, dependencies, and anxieties that the person without wealth does not have. Smith: we admire the children of the wealthy not because they are more virtuous or capable but because we imaginatively project onto them the happiness we associate with their wealth — this is a systematic error of the moral imagination. Both analysing the same mismatch between projected and actual wellbeing."
  },
  {
    "id": "ev_024",
    "source": "cd_021",
    "target": "mm_037",
    "type": "converges",
    "weight": 2,
    "label": "Grandeur in view of life converges with art of attention",
    "notes": "Montaigne: the art of attention — the capacity to actually notice what is in front of you — is one of the rarest human achievements. Darwin: there is grandeur in this view of life, available to anyone willing to actually look at what the scientific worldview reveals. Both insisting on attention as the capacity that opens onto wonder."
  },
  {
    "id": "ev_025",
    "source": "bb_019",
    "target": "ht_025",
    "type": "converges",
    "weight": 3,
    "label": "Wonder as discipline converges with sleepwalking through the astonishing",
    "notes": "Thoreau: most people sleepwalk through experiences that are genuinely extraordinary — familiarity has made the astonishing invisible. Bryson: the correct response to existence is sustained active wonder — a deliberate refusal to take the improbability of everything for granted. Both insisting on the same failure of attention and the same remedy."
  },
  {
    "id": "ev_026",
    "source": "vf_012",
    "target": "bo_020",
    "type": "converges",
    "weight": 2,
    "label": "Future goal as survival anchor converges with adversity as more useful",
    "notes": "Boethius: adversity is more useful than prosperity — prosperity deceives, adversity reveals. Frankl: the clarity of a future goal — even a small one — is a biological and psychological anchor that keeps people alive. Both are making the same structural claim: difficulty, properly oriented to, is more generative than comfort."
  },
  {
    "id": "ev_027",
    "source": "vf_009",
    "target": "fd_008",
    "type": "converges",
    "weight": 3,
    "label": "Suffering as raw material converges with suffering as primary engine of development",
    "notes": "Dostoevsky: suffering is not an obstacle to human development — it is its primary engine. Characters who have not suffered are flat and morally shallow. Frankl: suffering is not the enemy of a meaningful life — it is one of its possible raw materials. The question is what this suffering is asking of you. Both insisting on suffering as potential generative material rather than pure obstacle."
  },
  {
    "id": "ev_028",
    "source": "as_008",
    "target": "eb_008",
    "type": "converges",
    "weight": 2,
    "label": "Admiring rich as moral corruption converges with universal need to feel heroic",
    "notes": "Becker: the need to be a hero is universal and deep — every person needs to feel their life has cosmic significance. Smith: we naturally admire the rich and powerful, which is one of the greatest sources of moral corruption — we defer to success regardless of its genuine value. Both are diagnosing the same distortion: the substitution of social status for genuine significance as a response to the need for heroic meaning."
  },
  {
    "id": "ev_029",
    "source": "fn_016",
    "target": "sk_015",
    "type": "converges",
    "weight": 3,
    "label": "Herd instinct as levelling force converges with crowd as untruth",
    "notes": "Kierkegaard: the crowd is untruth — existential truth requires individual passionate appropriation. The moment something becomes a crowd's position it has lost what made it truth for the individual. Nietzsche: the herd instinct produces the levelling of excellence, the subordination of the genuinely valuable to the merely popular. Both diagnosing the same social pressure; Nietzsche emphasises the levelling of excellence, Kierkegaard the destruction of genuine appropriation."
  },
  {
    "id": "ev_030",
    "source": "fd_001",
    "target": "bp_013",
    "type": "converges",
    "weight": 3,
    "label": "Faith as what remains after doubt converges with faith as choice in presence of doubt",
    "notes": "Pascal: faith is not the suppression of doubt but a choice made in the presence of doubt — certainty is not available, and the question is what you do in its absence. Dostoevsky: faith is not the absence of doubt but what remains after doubt has done its worst. Characters who have never doubted do not have faith, they have comfort. Both insisting that genuine faith requires passing through doubt rather than avoiding it."
  },
  {
    "id": "ev_031",
    "source": "sk_010",
    "target": "fd_001",
    "type": "converges",
    "weight": 2,
    "label": "Religious stage as absolute relation converges with faith as what survives doubt",
    "notes": "Dostoevsky: faith is not the absence of doubt but what remains after doubt has done its worst. Kierkegaard: the religious stage is the absolute relation to the absolute — the individual standing before God, not mediated by rational argument. Both insisting that genuine religious life is more demanding than its cultural versions and requires direct personal relation rather than inherited or comfortable assent."
  },
  {
    "id": "ev_032",
    "source": "fd_005",
    "target": "eb_009",
    "type": "converges",
    "weight": 3,
    "label": "Freedom as burden most will escape converges with society providing ready-made hero systems",
    "notes": "Becker: society provides ready-made hero systems — religion, nationalism, professional identity — that allow individuals to feel significant without constructing significance from scratch. Dostoevsky (Grand Inquisitor): most people will trade freedom for bread, miracle, and authority — they crave someone to tell them what to believe and how to live. Both diagnosing the same psychological reality: freedom is experienced as a burden that most people will trade for the comfort of a system."
  },
  {
    "id": "ev_033",
    "source": "fd_018",
    "target": "as_019",
    "type": "converges",
    "weight": 2,
    "label": "Cold ideologue as most dangerous converges with man of system",
    "notes": "Smith: the man of system — the political reformer who believes he can arrange human beings like pieces on a chessboard — produces the worst political outcomes not from malice but from confidence in his scheme. Dostoevsky: the most dangerous person is not the passionate sinner but the cold intellectual who has reasoned his way to permission. Ideology is far harder to dislodge than passion because it mistakes itself for reason."
  },
  {
    "id": "ev_034",
    "source": "eb_025",
    "target": "bp_011",
    "type": "converges",
    "weight": 2,
    "label": "Certainty about immortality project as precondition for atrocity converges with reason constructing arguments for any position",
    "notes": "Pascal: reason can construct a perfect argument for almost any position — the fact that you can argue for something is not evidence that it is true. Becker: the most dangerous human beings are those absolutely certain they have found meaning. Certainty about one's immortality project is the psychological precondition for atrocity. Both insisting that the most dangerous cognitive state is the one that presents itself as the most rational."
  },
  {
    "id": "ev_035",
    "source": "ht_004",
    "target": "fn_014",
    "type": "converges",
    "weight": 3,
    "label": "Living deliberately converges with becoming who you are",
    "notes": "Nietzsche: you must become who you are — not who your parents wanted, not who society shaped you into by default, but the self that is genuinely yours. Thoreau: to live deliberately is to make conscious choices about where your time and attention go, rather than drifting into the patterns society hands you. Both making the same demand: conscious ownership of your own life against the default of inherited pattern."
  },
  {
    "id": "ev_036",
    "source": "mm_026",
    "target": "fn_014",
    "type": "converges",
    "weight": 3,
    "label": "Belonging to yourself converges with becoming who you are",
    "notes": "Nietzsche: you must become who you are. Montaigne: the greatest thing in the world is to know how to be your own — to live by your own judgment rather than by the judgments of others. Three-way cluster with ht_004. The same fundamental demand stated in three registers: existentialist imperative, empirical observation, and ethical conclusion."
  },
  {
    "id": "ev_037",
    "source": "ac_015",
    "target": "mm_022",
    "type": "converges",
    "weight": 2,
    "label": "Camus insists on the body converges with body and mind in intimate conversation",
    "notes": "Montaigne: the body is not separate from the mind — they are in constant intimate conversation. The state of digestion, sleep, and physical comfort affects the quality of thinking in ways philosophy has consistently refused to take seriously. Camus: the warmth of the sun, the smell of the sea, the physical pleasure of being alive — these are not trivial. They are where the absurd is actually lived. Both insisting on the philosophical relevance of embodied experience."
  },
  {
    "id": "ev_038",
    "source": "fd_014",
    "target": "cd_015",
    "type": "converges",
    "weight": 2,
    "label": "Everyone responsible for everyone converges with moral circle extends gradually",
    "notes": "Darwin: the moral sense follows a trajectory of extension — sympathy for the immediate group gradually extends to wider circles. This extension is not automatic but requires deliberate cultivation. Dostoevsky: everyone is responsible for everyone and everything — every act of cruelty reverberates, every act of love also reverberates. Darwin provides the developmental trajectory toward what Dostoevsky insists on as already true."
  },
  {
    "id": "ev_039",
    "source": "sw_015",
    "target": "ar_034",
    "type": "converges",
    "weight": 2,
    "label": "Rootedness as fundamental need converges with polis exists for the good life",
    "notes": "Aristotle: the city exists for the sake of the good life, not merely for survival — human beings are fulfilled in genuine political community. Weil: rootedness is a fundamental human need — the need to be nourished by the particular place, community, tradition, and history into which one is born. Both insisting on the constitutive role of particular community in human flourishing; the uprooted or de-politicized person is lacking something essential."
  },
  {
    "id": "ev_040",
    "source": "mm_017",
    "target": "cd_024",
    "type": "converges",
    "weight": 3,
    "label": "Learned ignorance as achievement converges with Darwin's honesty about limits",
    "notes": "Darwin: Darwin's honesty about what natural selection cannot account for — the evolution of consciousness, the persistence of altruism — is one of the most philosophically important features of his work. Montaigne: learned ignorance — the recognition of how much you do not know — is a genuine intellectual achievement, harder and rarer than the accumulation of information. Both insisting that acknowledging the limits of one's framework is itself a form of intellectual achievement."
  },
  {
    "id": "ev_041",
    "source": "mm_001",
    "target": "bb_006",
    "type": "converges",
    "weight": 2,
    "label": "Que sais-je converges with 95% of universe unknown",
    "notes": "Bryson: most of the universe is made of things we cannot see, cannot detect, and do not understand — dark matter and dark energy account for roughly 95% of everything. Our confident theories describe a 5% sliver of reality. Montaigne: what do I know? — not rhetorical modesty but a genuine epistemological position, systematic doubt as a permanent orientation. Physics and philosophy arriving at the same epistemic humility by different routes."
  },
  {
    "id": "ev_042",
    "source": "ag_020",
    "target": "ar_011",
    "type": "converges",
    "weight": 3,
    "label": "Better-directed medicine vs. phronesis as master virtue",
    "notes": "Aristotle: phronesis is the master virtue that governs what technical skill is used for — the practically wise person knows not just how to do something but what to do it for, and whether to do it at all. Gawande: the argument is not for less medicine but for better-directed medicine — the question is not whether to treat but what to treat for, what goals the treatment serves and whether those goals are the patient's own. A clinical example of Aristotle's most important claim."
  },
  {
    "id": "ev_043",
    "source": "ag_021",
    "target": "sw_004",
    "type": "converges",
    "weight": 3,
    "label": "Good doctor has moral not technical competence converges with love as attention",
    "notes": "Weil: the love of neighbour is the attention that asks of another: what are you going through? — not what do I do for you, but what are you actually experiencing. Gawande: the good doctor is the one who can ask what matters most to the patient, hear the answer without distorting it through professional assumptions, and then deploy technical skill in the service of what the patient actually values. Weil's mystical attention and Gawande's clinical attention are describing the same quality."
  },
  {
    "id": "ev_044",
    "source": "ar_007",
    "target": "bp_014",
    "type": "converges",
    "weight": 2,
    "label": "Virtue acquired by practice converges with behave your way to faith",
    "notes": "Pascal: you cannot reason your way to faith, but you can behave your way to it — act as if, engage with the community, perform the rituals, and something may open that argument alone cannot unlock. Aristotle: you become virtuous by doing virtuous things — the virtuous disposition is shaped by action before it is felt as natural. Both insisting on the priority of practice over cognition in producing genuine character and orientation."
  },
  {
    "id": "ev_045",
    "source": "bg_017",
    "target": "ar_007",
    "type": "converges",
    "weight": 2,
    "label": "Gunas can be shifted through practice converges with virtue acquired by practice",
    "notes": "Aristotle: virtue is acquired by practice — you become what you repeatedly do. The Gita: the human constitution is not fixed — the balance of gunas can be shifted through deliberate practice, diet, company, and attention. Both insisting that character is malleable through disciplined practice rather than fixed by nature."
  },
  {
    "id": "ev_046",
    "source": "cd_003",
    "target": "fn_001",
    "type": "converges",
    "weight": 2,
    "label": "Moral sense as evolved converges with God is dead as cultural diagnosis",
    "notes": "Nietzsche: God is dead — not as triumphant atheism but as a diagnosis of what has already happened. The shared framework of meaning that Christianity provided has collapsed. Darwin: the moral sense is an evolved disposition with a natural history. Both are making claims about the natural origins of morality that remove its transcendent grounding. Darwin provides the mechanism; Nietzsche diagnoses the cultural consequences."
  },
  {
    "id": "ev_047",
    "source": "as_011",
    "target": "ar_034",
    "type": "converges",
    "weight": 2,
    "label": "Social order maintained by internalized spectator converges with polis as natural",
    "notes": "Aristotle: the polis exists for the sake of the good life — human beings are political animals whose nature is fulfilled in genuine community. Smith: the social order is maintained not primarily by law but by the internalization of the impartial spectator — most people, most of the time, govern their conduct by asking how it would appear to a disinterested observer. Smith provides the psychological mechanism for what Aristotle identifies as natural."
  },
  {
    "id": "ev_048",
    "source": "ag_013",
    "target": "bg_025",
    "type": "converges",
    "weight": 2,
    "label": "Old age as distinct existential stage converges with ashrama system",
    "notes": "The Gita: the four stages of life — student, householder, forest dweller, renunciant — each have their own dharma. Later stages involve progressive release from earlier obligations and orientation toward deeper questions. Gawande: old age is a distinct existential stage with its own specific losses, possibilities, and demands. The failure to take it seriously as a stage is a source of medicine's systematic failure. Both insisting on stage-specificity against the assumption that all of life is the same project."
  },
  {
    "id": "ev_049",
    "source": "mm_024",
    "target": "ag_013",
    "type": "converges",
    "weight": 2,
    "label": "Old age brings genuine gifts converges with old age as distinct stage",
    "notes": "Montaigne: old age is not simply the subtraction of youth — it brings genuine gifts: the reduction of certain desires that consumed enormous energy, the clarification of what actually matters, and the freedom from needing to prove oneself. Gawande: old age is a distinct existential stage with its own possibilities. Both insisting on the positive content of late life rather than defining it purely by its losses."
  },
  {
    "id": "ev_050",
    "source": "cd_023",
    "target": "bb_010",
    "type": "converges",
    "weight": 2,
    "label": "Darwin's intellectual courage converges with science as deeply human process",
    "notes": "Bryson: science is not a clean linear march toward truth — it is a deeply human process full of ego, accident, rivalry, and missed connections. Darwin: spent twenty years accumulating evidence before publishing, understanding what he was doing. The courage of honest inquiry against institutional and social pressure is a moral achievement. Both insisting on intellectual honesty as a moral virtue, not merely an epistemic one."
  },
  {
    "id": "ev_051",
    "source": "cd_019",
    "target": "mm_017",
    "type": "converges",
    "weight": 2,
    "label": "Evidence having priority over received belief converges with learned ignorance",
    "notes": "Montaigne: learned ignorance — the recognition of how much you do not know — is a genuine intellectual achievement harder than the accumulation of information. Darwin: the intellectual courage required by evolutionary theory is itself a moral achievement — following evidence against the weight of cultural and religious authority. Both treating intellectual honesty about the limits of one's beliefs as a demanding ethical practice."
  },
  {
    "id": "ev_052",
    "source": "fd_016",
    "target": "sk_009",
    "type": "converges",
    "weight": 3,
    "label": "Guilt as navigational force converges with ethical stage failing through guilt",
    "notes": "Kierkegaard: the ethical stage fails through the honest experience of guilt — the person who genuinely tries to fulfil the universal moral law discovers they cannot. Dostoevsky: guilt, taken seriously and honestly, is not destructive but navigational — the characters who deny guilt become monsters. Both insisting that guilt is not to be managed away but engaged with honestly as information about one's actual moral position."
  },
  {
    "id": "ev_053",
    "source": "bp_009",
    "target": "sk_011",
    "type": "converges",
    "weight": 2,
    "label": "Reason insufficient for final step converges with stages require discontinuous leaps",
    "notes": "Kierkegaard: the most important transitions in human existence are separated by discontinuous leaps that cannot be derived from what precedes them — you cannot reason your way from the ethical to the religious. Pascal: reason is powerful but not sufficient — it can take you very far but not all the way. The final step is made by the heart, not the head. Both insisting on reason's genuine but limited jurisdiction."
  },
  {
    "id": "ev_054",
    "source": "sw_011",
    "target": "bp_015",
    "type": "converges",
    "weight": 2,
    "label": "Force turns persons into things converges with justice without power is helpless",
    "notes": "Pascal: justice without power is helpless, power without justice is tyranny — and the powerful almost always manage to define justice as whatever benefits them. Weil: force is the dominating power that turns persons into things, treating human beings as objects to be moved rather than subjects to be encountered. Both analysing the same phenomenon from different angles: the political reality of force and what it does to persons and to justice."
  },
  {
    "id": "ev_055",
    "source": "sw_013",
    "target": "ar_027",
    "type": "converges",
    "weight": 2,
    "label": "Justice requires attention converges with equity as correction of law's generality",
    "notes": "Aristotle: equity is the correction of law's necessary generality by attention to the specific case — the highest form of justice sees particular persons, not only general categories. Weil: justice requires not just absence of cruelty but the positive act of attention — asking of another what they are going through. Both insisting that genuine justice requires a quality of attention to particulars that systematic rules cannot provide."
  },
{
    "id": "ev_056",
    "source": "eb_021",
    "target": "ma_012",
    "type": "converges",
    "weight": 2,
    "label": "Chosen engagement as functional remedy",
    "notes": "Adds nuance to ec_040. While they disagree on the diagnosis of anxiety, they converge on the remedy. Becker’s 'creative illusion' — a chosen engagement despite known mortality — is functionally almost identical to the Stoic 'governing faculty' choosing how to respond to an indifferent universe."
  },
{
    "id": "ev_057",
    "source": "lz_004",
    "target": "ar_011",
    "type": "converges",
    "weight": 2,
    "label": "Non-formulaic situational wisdom",
    "notes": "Nuance to eu_001. While Taoism undermines Aristotle's metaphysics, it converges with his ethics of phronesis (ar_011). Both Wu Wei and practical wisdom describe a non-formulaic, situational intelligence that cannot be reduced to rules."
  },
  {
    "id": "eu_001",
    "source": "lz_001",
    "target": "ar_001",
    "type": "undermines",
    "weight": 3,
    "label": "Deepest reality exceeds language undermines systematic ethical framework",
    "notes": "Laozi: the Tao that can be named is not the eternal Tao — ultimate reality exceeds language, concept, and definition. Any description is already a reduction. Aristotle: eudaimonia is the highest good, and the entire Nicomachean Ethics is a systematic verbal articulation of what it is and how to achieve it. Laozi's opening claim undermines the methodological premise of every systematic philosophy in the graph — not any specific conclusion but the assumption that the most important things can be clearly articulated."
  },
  {
    "id": "eu_002",
    "source": "lz_026",
    "target": "fn_024",
    "type": "undermines",
    "weight": 2,
    "label": "Those who know do not speak undermines philosopher as legislator of values",
    "notes": "Nietzsche: the philosopher must be a legislator of new values — must articulate, proclaim, and impose new frameworks of meaning. The philosopher speaks with authority. Laozi: those who know do not speak; those who speak do not know. Not a direct contradiction of Nietzsche's specific values but a systematic undermining of the authority-through-proclamation model of philosophy."
  },
  {
    "id": "eu_003",
    "source": "lz_001",
    "target": "mm_002",
    "type": "undermines",
    "weight": 2,
    "label": "Deepest reality exceeds language undermines self as philosophical method",
    "notes": "Montaigne: each person carries the complete form of the human condition, and studying the self honestly is the best available methodology for philosophical inquiry. Laozi: the most important reality exceeds linguistic articulation entirely. If Laozi is right, Montaigne's method — which proceeds through careful verbal self-observation — can only reach as far as language goes, which is not far enough."
  },
  {
    "id": "eu_004",
    "source": "cd_001",
    "target": "ar_005",
    "type": "undermines",
    "weight": 3,
    "label": "No fundamental human-animal discontinuity undermines function argument",
    "notes": "Aristotle's function argument depends on a sharp distinction between what is distinctively human — rational activity — and what is shared with animals. If that distinction is one of degree rather than kind, as Darwin argues, the concept of a function specific to humans becomes problematic. This is an undermines rather than a full contradicts because Aristotle might accommodate the finding while insisting that the degree of difference is still philosophically relevant."
  },
  {
    "id": "eu_005",
    "source": "bb_017",
    "target": "ar_005",
    "type": "undermines",
    "weight": 2,
    "label": "98.7% DNA overlap with chimpanzees undermines human distinctiveness claim",
    "notes": "The empirical grounding for the same undermining as cd_001, but from molecular biology rather than behavioural observation. If the genetic difference between humans and chimpanzees is smaller than the genetic difference between some species of fruit fly, the claim that rational activity is a function specific to humans requires more careful argument."
  },
  {
    "id": "eu_006",
    "source": "cd_007",
    "target": "bp_002",
    "type": "undermines",
    "weight": 2,
    "label": "Intelligence as contingent local solution undermines thinking reed's dignity claim",
    "notes": "Pascal: man is nobler than what kills him because he knows he is dying and the universe knows nothing — human consciousness confers a specific dignity. Darwin: natural selection has no preference for consciousness or intelligence — they emerged because they happened to confer survival advantages in specific environments. They could have not emerged. If consciousness is contingent in this way, the dignity Pascal derives from it needs a different foundation."
  },
  {
    "id": "eu_007",
    "source": "cd_007",
    "target": "bg_004",
    "type": "undermines",
    "weight": 2,
    "label": "Intelligence as contingent undermines atman as universal consciousness",
    "notes": "The Gita: the atman in every individual is identical to Brahman — the universal self, the ground of all consciousness. Darwin: human consciousness is a locally contingent solution to locally contingent problems. If consciousness is a contingent evolutionary product rather than the fundamental structure of reality, the Gita's identification of the individual consciousness with the universal ground becomes harder to ground."
  },
  {
    "id": "eu_008",
    "source": "cd_002",
    "target": "bo_012",
    "type": "undermines",
    "weight": 3,
    "label": "Natural selection without design undermines providential order broadly",
    "notes": "Broader version of ec_021. Boethius: everything that happens is contained within a providential order that human reason cannot fully perceive. Darwin: the process that produced everything that exists has no foresight, plan, goal, or preference. The undermining here is not just of specific claims about providence but of the methodological move of inferring design from the appearance of order in natural systems."
  },
  {
    "id": "eu_009",
    "source": "cd_002",
    "target": "ma_016",
    "type": "undermines",
    "weight": 2,
    "label": "Natural selection without purpose undermines nature does nothing wastefully",
    "notes": "Marcus Aurelius: nature does nothing wastefully — everything that happens is material you can use. The first sentence is a Stoic teleological assertion about nature's purposiveness. Darwin: natural selection is a filter, not a designer. There is no purpose in nature to generate the claim that nothing is wasted. The practical second sentence (everything is material you can use) survives; the metaphysical first sentence does not."
  },
  {
    "id": "eu_010",
    "source": "bp_003",
    "target": "ar_001",
    "type": "undermines",
    "weight": 2,
    "label": "Irreducible human contradiction undermines systematic ethical resolution",
    "notes": "Aristotle's Nicomachean Ethics moves systematically toward the conclusion that eudaimonia is achievable by the person who develops virtue through practice. Pascal: human nature is fundamentally contradictory — any philosophy that resolves this contradiction too cleanly is lying. This is a meta-level critique: not of Aristotle's specific conclusions but of the confidence of his systematic resolution."
  },
  {
    "id": "eu_011",
    "source": "bp_003",
    "target": "vf_001",
    "type": "undermines",
    "weight": 2,
    "label": "Irreducible human contradiction undermines primary drive as meaning",
    "notes": "Frankl: the primary human drive is the search for meaning. Pascal: human nature is fundamentally contradictory — we are simultaneously capable of the highest reason and the lowest baseness, often simultaneously. If human nature is this contradictory, identifying a single primary drive — even meaning — oversimplifies the structure of motivation in a way that may not survive honest examination."
  },
  {
    "id": "eu_012",
    "source": "fn_018",
    "target": "ar_001",
    "type": "undermines",
    "weight": 2,
    "label": "Philosophers always have hidden drives undermines philosophical authority",
    "notes": "Nietzsche: the philosophers who claim to speak for reason or truth are almost always disguising drives, temperamental preferences, and will-to-power behind the appearance of rational argument. The philosopher's biography is philosophically relevant data. This undermines not Aristotle's specific conclusions but the implicit claim that Aristotle's arguments are the deliverances of pure reason rather than of a particular person with particular drives and commitments."
  },
  {
    "id": "eu_013",
    "source": "fn_017",
    "target": "bb_006",
    "type": "undermines",
    "weight": 1,
    "label": "Perspective as condition not limitation undermines objective scientific description",
    "notes": "Bryson presents scientific knowledge as objective description of what is actually there. Nietzsche: perspective is not a limitation to be overcome but the condition of all knowing — there is no view from nowhere, only views from somewhere. This does not refute scientific findings but undermines the implicit claim that science provides a perspective-free account of reality rather than a powerful and disciplined perspective among others."
  },
  {
    "id": "eu_014",
    "source": "bp_016",
    "target": "ar_026",
    "type": "undermines",
    "weight": 2,
    "label": "Custom as foundation of most moral intuition undermines justice as complete virtue",
    "notes": "Aristotle: justice is the complete virtue — the highest expression of virtue exercised in relation to others. Pascal: custom and habit are the true foundations of most of what people call morality, justice, and truth — very little was arrived at by reason. If Pascal is right, Aristotle's confidence that the just person's intuitions track genuine virtue needs to account for the degree to which those intuitions are culturally shaped rather than rationally derived."
  },
  {
    "id": "eu_015",
    "source": "mm_016",
    "target": "as_009",
    "type": "undermines",
    "weight": 2,
    "label": "Custom as tyrant undermines propriety as reliable standard",
    "notes": "Smith: propriety — the appropriateness of an action to its situation — is the first and most fundamental moral standard. Montaigne: custom is the tyrant of moral imagination — most of what people regard as natural and obvious is custom elevated to the status of necessity. If what counts as appropriate is substantially shaped by custom, the impartial spectator's judgment of propriety may be less universal than Smith assumes."
  },
  {
    "id": "eu_016",
    "source": "as_014",
    "target": "ar_012",
    "type": "undermines",
    "weight": 2,
    "label": "Custom shapes moral judgment undermines practical wisdom's reliability",
    "notes": "Aristotle: the practically wise person perceives what the situation actually requires — their trained moral perception reliably tracks what is genuinely good. Smith: custom and fashion have an enormous influence on moral judgment, far more than most moral philosophers acknowledge. If the practically wise person's perceptions are substantially shaped by cultural custom, the reliability of phronesis as a guide to genuine virtue is compromised."
  },
  {
    "id": "eu_017",
    "source": "bp_020",
    "target": "mm_002",
    "type": "undermines",
    "weight": 2,
    "label": "Self as distorting lens undermines self-study as reliable method",
    "notes": "Montaigne: each person carries the complete form of the human condition, and studying the self honestly with sufficient care produces reliable philosophical knowledge. Pascal: the self is hateful — not because people are bad but because the self is a fundamentally distorting lens. If Pascal is right, Montaigne's method is systematically compromised by the instrument it uses: the self studying itself through the self."
  },
  {
    "id": "eu_018",
    "source": "bb_004",
    "target": "ma_015",
    "type": "undermines",
    "weight": 2,
    "label": "Universe not graspable by intuition undermines you are a fragment of a rational universe",
    "notes": "Marcus Aurelius: you are a fragment of a rational universe — what happens to you is part of a process larger than your individual story. Bryson: the universe is not large in a way human intuition can genuinely grasp. The human brain did not evolve to perceive scales like this. Humility about our place is the only rational response. If the universe genuinely exceeds human comprehension, the Stoic claim to understand its rational structure — and one's place in it — is harder to sustain."
  },
  {
    "id": "eu_019",
    "source": "bb_009",
    "target": "eb_005",
    "type": "undermines",
    "weight": 2,
    "label": "Extinction as default undermines civilisation as durable immortality project",
    "notes": "Becker: human civilisation is a collectively elaborated defence against mortality awareness — it is our most elaborate immortality project. Bryson: extinction is the default state of species — more than 99% of all species that have ever existed are gone. Human civilisation may be our immortality project but it has no cosmic protection from the same fate. The project's ultimate futility is written into the same record that makes it understandable."
  },
  {
    "id": "eu_020",
    "source": "cd_013",
    "target": "eb_006",
    "type": "undermines",
    "weight": 2,
    "label": "Extinction as normal undermines durability of immortality projects",
    "notes": "Darwin: extinction is the normal condition of species — survival is the exception. Becker: immortality projects — careers, religions, nations, children — are the vehicles through which individuals attempt to transcend mortality. If the species itself is subject to normal extinction, the projects that extend the individual into the collective or the historical are building on ground that is not itself secure."
  },
  {
    "id": "eu_021",
    "source": "fn_018",
    "target": "mm_002",
    "type": "undermines",
    "weight": 2,
    "label": "Philosopher's biography as data undermines neutral self-observation",
    "notes": "Montaigne: studying the self honestly and carefully produces reliable knowledge of the human condition. Nietzsche: the philosopher's drives, temperamental preferences, and will-to-power shape their conclusions in ways they cannot fully see. If this applies to Nietzsche's other philosophical targets, it applies to Montaigne's self-observation too: what Montaigne takes to be honest self-knowledge may be systematically shaped by drives he cannot observe from inside."
  },
  {
    "id": "eu_022",
    "source": "cd_017",
    "target": "as_001",
    "type": "undermines",
    "weight": 2,
    "label": "Evolved sympathy insufficient for modern scale undermines sympathy as foundation",
    "notes": "Smith: sympathy — the imaginative capacity to place yourself in another's situation — is the foundation of moral judgment. Darwin: if the moral sense is an evolved adaptation, it is fitted to ancestral environments of small-group social life. It may be systematically insufficient for the moral demands of the modern world where strangers and distant others are morally relevant but not naturally salient. Smith's foundation may be reliable at ancestral social scales but distorted at modern ones."
  },
  {
    "id": "eu_023",
    "source": "cd_017",
    "target": "fd_014",
    "type": "undermines",
    "weight": 1,
    "label": "Evolved sympathy insufficient for modern scale undermines universal responsibility",
    "notes": "Dostoevsky: everyone is responsible for everyone and everything. Darwin: evolved sympathy works well for kin and tribe and may be systematically insufficient for strangers and distant others. Dostoevsky's ethical demand may be right as a normative claim while Darwin shows why it is so difficult to fulfil: we are trying to extend a biological capacity beyond the scale for which it evolved."
  },
  {
    "id": "eu_024",
    "source": "lz_013",
    "target": "ar_015",
    "type": "undermines",
    "weight": 2,
    "label": "Wisdom subtracts undermines contemplative life as highest through accumulation",
    "notes": "Aristotle: the contemplative life — the life of pure intellectual activity — is the highest and involves the fullest exercise of the distinctively human faculty. It is cumulative and active. Laozi: to pursue wisdom is to subtract every day — to remove the unnecessary, the performed, the accumulated armour of the ego. If the direction of the highest human activity is subtraction rather than accumulation, the contemplative model of highest life needs reconsideration."
  },
  {
    "id": "eu_025",
    "source": "bp_011",
    "target": "ar_026",
    "type": "undermines",
    "weight": 2,
    "label": "Reason can argue for anything undermines justice derivable through reason",
    "notes": "Aristotle: justice is the highest virtue, discoverable through careful rational argument about what human beings are for and what relations between them best express this. Pascal: reason can construct a perfect argument for almost any position — the fact that you can argue for something is not evidence that it is true. If Pascal is right, the Aristotelian project of deriving justice through rational argument is more exposed to motivated reasoning than it acknowledges."
  },
  {
    "id": "eu_026",
    "source": "mm_003",
    "target": "ar_006",
    "type": "undermines",
    "weight": 2,
    "label": "Self as flux undermines virtue as stable disposition",
    "notes": "Aristotle: virtue is a stable disposition of character — a reliable tendency to feel and act appropriately that has been shaped by practice into something permanent. Montaigne: the self is not a stable entity but a process, a flux — every time he tries to describe himself he finds the described thing has already changed. If the self is fundamentally in flux, the stability that Aristotle's virtue requires may be an achievement harder to sustain than the Nicomachean Ethics acknowledges."
  },
  {
    "id": "eu_027",
    "source": "fd_017",
    "target": "fn_006",
    "type": "undermines",
    "weight": 2,
    "label": "Ideas have consequences undermines value creation without responsibility for effects",
    "notes": "Nietzsche: meaning is created — the philosopher is a legislator of new values and should not hesitate to impose them. Dostoevsky: evil is always the product of a specific philosophical error taken to its conclusion — Smerdyakov murders because he absorbed Ivan's framework that without God everything is permitted. Ideas have consequences. The philosopher-legislator who creates values without accounting for how they are received and used has not fully reckoned with their own activity."
  },
  {
    "id": "eu_028",
    "source": "eb_003",
    "target": "bg_002",
    "type": "undermines",
    "weight": 2,
    "label": "Body as embarrassment of symbolic self undermines soul wearing body as garment",
    "notes": "The Gita: the body is a garment worn by the soul — the atman is entirely beyond embodiment, unchanging and unaffected by the body's conditions. Becker: the body is the great embarrassment of the symbolic self — it bleeds, excretes, ages, desires, gets sick, and dies. The enormous human investment in transcendence is partly an attempt to forget that we are at the most fundamental level meat. Becker does not say the Gita is wrong, but shows that the desire to see the body as merely a garment is itself a symptom of the death anxiety that needs examining."
  },
  {
    "id": "eu_029",
    "source": "sk_014",
    "target": "bb_019",
    "type": "undermines",
    "weight": 1,
    "label": "Subjectivity is truth undermines wonder as sufficient response to scientific worldview",
    "notes": "Bryson: the correct response to existence is sustained active wonder — the scientific worldview, if genuinely absorbed, produces this naturally. Kierkegaard: subjectivity is truth — truths about existence cannot be grasped by detached objective observation; they must be appropriated into the lived experience of the person. The scientific worldview, however wonderful, produces objective knowledge about the world rather than appropriated existential orientation. Bryson's wonder may be the right response to the world; it is not sufficient as an answer to the question of how to live."
  },
  {
    "id": "eu_030",
    "source": "eb_011",
    "target": "ma_003",
    "type": "undermines",
    "weight": 2,
    "label": "Death anxiety as primary anxiety undermines most anxiety as cognitive error",
    "notes": "Marcus Aurelius: most anxiety is about things that never happen, are over, or are outside your control — the present moment is almost always manageable. The prescription is cognitive correction. Becker: death anxiety is not one anxiety among many but the primary anxiety from which most others derive. If Becker is right, what Marcus Aurelius treats as a correctable cognitive error may be rooted in an accurate perception of something that cannot simply be reframed away."
  },
  {
    "id": "eu_031",
    "source": "as_012",
    "target": "ht_016",
    "type": "undermines",
    "weight": 2,
    "label": "Social approval as mechanism of moral development undermines solitude as defence against conformity",
    "notes": "Thoreau: society exerts constant low-level pressure to conform — solitude is the primary defence against this pressure. Smith: the desire for approval of others is the psychological mechanism by which moral development occurs — we learn what is appropriate by attending to how others respond to us. Smith's developmental account undercuts Thoreau's prescription: if social mirroring is constitutive of moral development, wholesale retreat from it may produce not freedom but arrested development."
  },
  {
    "id": "eu_032",
    "source": "mm_022",
    "target": "ar_015",
    "type": "undermines",
    "weight": 1,
    "label": "Body and mind in intimate conversation undermines pure contemplative life",
    "notes": "Aristotle: the contemplative life — the life of pure intellectual activity — is the highest, most closely approximating the divine. Montaigne: the body is in constant intimate conversation with the mind — the state of digestion, sleep, and physical comfort affects the quality of thinking in ways philosophy has consistently refused to acknowledge. If Montaigne is right, the ideal of pure contemplation unaffected by bodily conditions is not achievable and the philosophical tradition's refusal to acknowledge the body produces systematically incomplete accounts of the intellectual life."
  },
  {
    "id": "eu_033",
    "source": "sw_012",
    "target": "ar_018",
    "type": "undermines",
    "weight": 1,
    "label": "Force can ontologically convert persons undermines akrasia as philosophical problem",
    "notes": "Aristotle: akrasia — weakness of will — is philosophically important because it proves that rational knowledge does not automatically produce rational action. Weil: force, at its extreme, can convert a person into something that responds to stimuli rather than acts from freedom. If force can destroy the capacity for rational agency entirely, Aristotle's puzzle about weakness of will is addressing a capacity whose availability cannot be assumed. The philosophical problem of akrasia presupposes an agent who retains the capacity to act otherwise."
  },
  {
    "id": "ee_001",
    "source": "ag_019",
    "target": "ma_003",
    "type": "extends",
    "weight": 3,
    "label": "Hospice outcomes empirically ground Stoic acceptance",
    "notes": "Marcus Aurelius argues philosophically that most anxiety concerns what cannot be controlled and acceptance is the rational response. Gawande provides clinical data: patients who accept rather than fight terminal illness consistently live longer, experience less pain, and report better quality of life. The philosophical claim and the empirical finding converge; Gawande extends Marcus Aurelius by grounding him."
  },
  {
    "id": "ee_002",
    "source": "ag_019",
    "target": "bo_021",
    "type": "extends",
    "weight": 2,
    "label": "Hospice outcomes extend Boethius on adversity revealing truth",
    "notes": "Boethius argues that adversity is more useful than prosperity because it reveals the true nature of Fortune and of yourself. Gawande's data extends this: the acceptance of dying, rather than fighting it, turns out to produce better outcomes by every measure including medical ones. Genuine confrontation with limitation is more productive than denial."
  },
  {
    "id": "ee_003",
    "source": "ag_015",
    "target": "eb_004",
    "type": "extends",
    "weight": 3,
    "label": "Medicalization of dying extends Becker on civilisation as death denial",
    "notes": "Becker argues that civilisation is a collectively elaborated defence mechanism against mortality awareness. Gawande shows exactly what this looks like institutionalised in a specific domain: modern medicine's slow, technical, stripped death is the most elaborate expression of that denial ever constructed. Gawande is providing the concrete institutional case that Becker describes abstractly."
  },
  {
    "id": "ee_004",
    "source": "ag_001",
    "target": "eb_002",
    "type": "extends",
    "weight": 2,
    "label": "Medicine defined as defeating death extends Becker on man as the only death-aware animal",
    "notes": "Becker: man is the only animal that knows it will die and carries this awareness as a permanent background condition. Gawande extends this: medicine's structural error — defining its task as the defeat of death — is the institutional expression of that permanent death anxiety. The profession exists to do what the individual psyche also does: deny the finality."
  },
  {
    "id": "ee_005",
    "source": "ag_022",
    "target": "eb_011",
    "type": "extends",
    "weight": 2,
    "label": "Decomposing death fear extends Becker on death anxiety as primary",
    "notes": "Becker: death anxiety is the primary anxiety from which most others derive — an undifferentiated terror underlying fear of failure, rejection, and abandonment. Gawande extends this by decomposing the cluster: fear of pain, dependence, loss of control, being a burden, dying alone, meaninglessness. Each can be addressed specifically. The decomposition is clinically useful and confirms Becker's diagnosis."
  },
  {
    "id": "ee_006",
    "source": "ag_003",
    "target": "sw_011",
    "type": "extends",
    "weight": 2,
    "label": "Institutional design extends Weil on force turning persons into things",
    "notes": "Weil: force is the power that turns persons into things — that reduces a subject to an object. Gawande extends this into the specific institutional domain of end-of-life care: nursing homes and ICUs were designed for institutional convenience, not the resident's experience of living. Structural arrangements systematically reduce persons to objects regardless of individual intent — exactly Weil's analysis."
  },
  {
    "id": "ee_007",
    "source": "cd_010",
    "target": "ar_034",
    "type": "extends",
    "weight": 3,
    "label": "Social instincts inherited from primates extend Aristotle's political animal",
    "notes": "Aristotle observes that humans are political animals by nature — they naturally form communities and cannot live well outside them. Darwin extends this by providing the evolutionary mechanism: the social instincts are inherited from primate ancestors and are older than the species. Aristotle's observation is confirmed and grounded. Darwin is the naturalistic foundation of Aristotle's political philosophy."
  },
  {
    "id": "ee_008",
    "source": "cd_015",
    "target": "fd_014",
    "type": "extends",
    "weight": 2,
    "label": "Gradual extension of moral circle extends universal responsibility",
    "notes": "Dostoevsky (Zosima): everyone is responsible for everyone and everything. This is a direct ethical claim. Darwin extends it into a developmental trajectory: the moral sense follows a specific path — sympathy for the immediate group extends gradually to tribe, nation, all humans, other species. Darwin provides the natural history of the ethical aspiration Dostoevsky insists on."
  },
  {
    "id": "ee_009",
    "source": "cd_003",
    "target": "fn_001",
    "type": "extends",
    "weight": 2,
    "label": "Natural history of morality extends the diagnosis of God's death",
    "notes": "Nietzsche: God is dead and we have killed him — the shared framework of meaning that Christianity provided has collapsed. Darwin extends this by showing the specific mechanism: the moral sense is an evolved disposition with identifiable precursors in other social animals. The supernatural grounding of morality is not just culturally lost; it was never the actual source of moral behaviour."
  },
  {
    "id": "ee_010",
    "source": "cd_022",
    "target": "vf_017",
    "type": "extends",
    "weight": 2,
    "label": "Altruism as evolutionary puzzle extends observed altruism as counter-determinism",
    "notes": "Frankl: even in the most dehumanising environment, some people chose to comfort others and share their last piece of bread — this proves conditions do not dictate character. Darwin extends this: genuine altruism presents the most serious challenge to natural selection as a complete explanation of behaviour. Both treat extreme altruism as philosophically significant data; Darwin provides the evolutionary framework for why it is puzzling rather than simple."
  },
  {
    "id": "ee_011",
    "source": "cd_012",
    "target": "vf_007",
    "type": "extends",
    "weight": 2,
    "label": "Emotional continuity across mammals extends love as highest human capacity",
    "notes": "Frankl: love is the highest and most complete act of which a human being is capable. Darwin extends this by showing that the emotional capacities underlying love — attachment, grief, affection, jealousy — have identifiable precursors in other mammals and are inherited rather than uniquely human. This does not reduce love but shows it has deep biological roots that Frankl's account does not reach."
  },
  {
    "id": "ee_012",
    "source": "cd_008",
    "target": "ar_034",
    "type": "extends",
    "weight": 2,
    "label": "Cooperation as fundamental extends political animal observation",
    "notes": "Aristotle observes that humans are political animals who form communities by nature. Darwin extends this: the struggle for existence includes cooperation, mutualism, and interdependence as fundamentally as competition. The popular Darwinian metaphor of red-in-tooth-and-claw is false — cooperation is equally primitive. Aristotle's political nature is confirmed at the biological level."
  },
  {
    "id": "ee_013",
    "source": "as_010",
    "target": "ar_027",
    "type": "extends",
    "weight": 2,
    "label": "Justice from gratitude and resentment extends equity as correction of law",
    "notes": "Aristotle: equity is the correction of law's necessary generality by attention to the specific case. Smith extends this by providing the emotional mechanism: gratitude and resentment are the primary materials from which the sense of justice is built. Smith's account explains why equity is psychologically available and why it works — it is not pure reason correcting rule but felt response calibrated by the impartial spectator."
  },
  {
    "id": "ee_014",
    "source": "as_021",
    "target": "cd_004",
    "type": "extends",
    "weight": 2,
    "label": "Empirical moral philosophy extends evolutionary grounding of sympathy",
    "notes": "Darwin: sympathy is an evolved disposition with precursors in other social animals — it has a natural history. Smith extends this empirically: he treats observed human psychology as the starting point for moral philosophy rather than as an obstacle to be overcome by reason. Both are insisting that moral philosophy must start from what humans actually are; Smith provides the systematic moral framework that Darwin's biology points toward."
  },
  {
    "id": "ee_015",
    "source": "as_011",
    "target": "ar_033",
    "type": "extends",
    "weight": 2,
    "label": "Internalized impartial spectator extends natural political community",
    "notes": "Aristotle: the city is natural to humans in the same sense that the bee's hive is natural to the bee. Smith extends this by showing the specific psychological mechanism: social order is maintained by the internalized impartial spectator — most people, most of the time, govern their conduct by asking how it would appear to a disinterested observer. Smith provides the moral psychology that Aristotle's political theory requires."
  },
  {
    "id": "ee_016",
    "source": "as_012",
    "target": "cd_015",
    "type": "extends",
    "weight": 2,
    "label": "Social approval as mechanism of moral development extends gradual extension of moral circle",
    "notes": "Darwin: the moral sense follows a trajectory where sympathy extends gradually to wider circles. Smith extends this by identifying the mechanism: the desire for the approval of others is how moral development actually occurs in individuals — we learn what is appropriate by attending to how others respond. Smith provides the individual-level mechanism for the population-level trajectory Darwin describes."
  },
  {
    "id": "ee_017",
    "source": "eb_007",
    "target": "fn_003",
    "type": "extends",
    "weight": 3,
    "label": "Colliding immortality projects extend the vacuum of God's death",
    "notes": "Nietzsche: the death of God creates a vacuum that nationalism, secular ideology, and various substitutes rush to fill — all inadequate. Becker extends this by providing the mechanism: when two immortality projects collide — two religions, two ideologies, two nations — the result is often extraordinary violence because each is an existential threat to the other's symbolic system. Becker explains why the inadequate substitutes are not merely intellectually unsatisfying but actively catastrophic."
  },
  {
    "id": "ee_018",
    "source": "eb_023",
    "target": "fn_024",
    "type": "extends",
    "weight": 2,
    "label": "New honest hero systems extend philosopher as legislator of values",
    "notes": "Nietzsche: the philosopher must be a legislator of new values after the death of God — someone with the courage to articulate new frameworks of meaning. Becker extends this by specifying what those frameworks need to do: new hero systems that are honest about what they are — providing meaning, significance, and community without requiring the suppression of reality. He does not say what they look like, but he provides the functional specification."
  },
  {
    "id": "ee_019",
    "source": "eb_018",
    "target": "sk_022",
    "type": "extends",
    "weight": 2,
    "label": "Depression as failed immortality project extends despair of necessity",
    "notes": "Kierkegaard: despair of necessity is the despair of the person so locked into what they take to be determined that they cannot imagine anything being different — they have abandoned possibility entirely. Becker extends this into the clinical domain: depression is what happens when your immortality project fails and you have no replacement. The project collapses and with it the structure that was making mortality bearable — despair of necessity made concrete."
  },
  {
    "id": "ee_020",
    "source": "sk_023",
    "target": "fn_004",
    "type": "extends",
    "weight": 2,
    "label": "Present age of reflection without passion extends passive nihilism",
    "notes": "Nietzsche: passive nihilism is the most common response to the death of God — a collapse into resignation, comfort-seeking, and the avoidance of commitment. Kierkegaard extends this diagnosis to the social level: the present age is an age of reflection without passion. People can see all sides of every question and therefore act on none of them. Reflection has become a substitute for action. Both are diagnosing the same failure of commitment from different angles."
  },
  {
    "id": "ee_021",
    "source": "sk_007",
    "target": "bp_018",
    "type": "extends",
    "weight": 2,
    "label": "Aesthetic stage failure extends boredom as philosophical state",
    "notes": "Pascal: boredom is not trivial — it is the experience of the self confronting itself without distraction, one of the most philosophically revealing states available to humans. Kierkegaard extends this into a full developmental account: the aesthetic stage — the life organised around immediate experience and novelty — eventually produces a boredom so total it extends to the self itself. Pascal diagnoses; Kierkegaard shows the trajectory."
  },
  {
    "id": "ee_022",
    "source": "sw_026",
    "target": "ht_019",
    "type": "extends",
    "weight": 2,
    "label": "Labour as spiritual practice extends question of what work demands",
    "notes": "Thoreau: most jobs require you to sell not just your time but your attention, your judgment, and your sense of self. Weil extends this by asking whether, under the right quality of attention, even the most dehumanising labour can become a form of spiritual practice. She worked in factories to test this. The extension is not a resolution of Thoreau's concern but a deepening of the same question."
  },
  {
    "id": "ee_023",
    "source": "sw_007",
    "target": "sk_007",
    "type": "extends",
    "weight": 2,
    "label": "Void must be held extends aesthetic stage failure into spiritual dimension",
    "notes": "Kierkegaard: the aesthetic stage fails into a boredom so total it extends to the self itself — a void that the rotation method cannot fill. Weil extends this: the void left when all consolations are removed is not nothing — it is the space in which grace can act. The person who fills the void immediately with the first available consolation has prevented the only thing that could actually help. Weil takes Kierkegaard's diagnosis to its spiritual conclusion."
  },
  {
    "id": "ee_024",
    "source": "cd_025",
    "target": "fd_017",
    "type": "extends",
    "weight": 2,
    "label": "Darwin's racial hierarchy claims extend ideas having consequences",
    "notes": "Dostoevsky (through Smerdyakov and Ivan): evil in Dostoevsky is always the product of a specific philosophical error taken to its conclusion — ideas have consequences. Darwin's caveat node extends this: the racial and sexual hierarchy claims in The Descent of Man are not incidental — they are integral to the argument as Darwin presents it. They have been used to justify atrocities. The philosopher's biography is philosophically relevant."
  },
  {
    "id": "ee_025",
    "source": "cd_025",
    "target": "eb_007",
    "type": "extends",
    "weight": 2,
    "label": "Darwin's racial claims extend how immortality projects produce violence",
    "notes": "Becker: when immortality projects collide, the result is often extraordinary violence because a competing symbolic system poses an existential threat. Darwin's caveat extends this: the racial hierarchy claims in The Descent of Man provided scientific legitimation for one of the most catastrophic immortality projects in history — racial nationalism. The caveat node is itself an example of Becker's mechanism."
  },
  {
    "id": "ee_026",
    "source": "bb_021",
    "target": "bp_002",
    "type": "extends",
    "weight": 3,
    "label": "Universe knowing itself through human mind extends thinking reed",
    "notes": "Pascal: man is the weakest thing in nature, a reed that can be crushed by a drop of water — but even if the entire universe were to crush him, he would still be nobler than what kills him, because he knows he is dying. Bryson extends this from a scientific direction: we are the universe's way of knowing itself — the atoms forged in stars now arranged in such a way that they can contemplate their own origin. Pascal and Bryson reach structurally identical insights through completely different routes."
  },
  {
    "id": "ee_027",
    "source": "bb_007",
    "target": "eb_004",
    "type": "extends",
    "weight": 2,
    "label": "Mass extinctions extend civilisation as death denial",
    "notes": "Becker: the denial of death is the foundation of civilisation — every achievement is at some level a structure built to make the builder feel permanent. Bryson extends this with the cosmic perspective: life on Earth has been nearly wiped out at least five times by events of staggering violence. The permanence that civilisation seeks to project is not only psychologically illusory but cosmically groundless."
  },
  {
    "id": "ee_028",
    "source": "bo_020",
    "target": "vf_009",
    "type": "extends",
    "weight": 2,
    "label": "Adversity as more useful than prosperity extends suffering as raw material",
    "notes": "Frankl: suffering is not the enemy of a meaningful life — it is one of its possible raw materials. Boethius extends this with a structural argument: adversity is more useful than prosperity not incidentally but necessarily. Prosperity deceives. Adversity reveals. The disclosure of suffering is not accidental but intrinsic to what suffering does."
  },
  {
    "id": "ee_029",
    "source": "bp_014",
    "target": "ar_007",
    "type": "extends",
    "weight": 2,
    "label": "Behaving your way into faith extends virtue acquired by practice",
    "notes": "Aristotle: you become virtuous by doing virtuous things — virtue is acquired by practice, not by knowing. Pascal extends this into the domain of faith: you cannot reason your way into it, but you can behave your way into it. Act as if, engage with the community, perform the rituals — and something may open that argument alone cannot unlock. Pascal applies the Aristotelian insight to the domain where Aristotle did not reach."
  },
  {
    "id": "ee_030",
    "source": "fn_021",
    "target": "vf_011",
    "type": "extends",
    "weight": 2,
    "label": "Bad conscience as cruelty turned inward extends tragic triad",
    "notes": "Frankl: guilt, suffering, and death — the tragic triad — are not obstacles to meaning but the conditions under which meaning becomes possible and necessary. Nietzsche extends the guilt component: bad conscience originated as the instinct for cruelty turned inward when external expression was blocked. Guilt is not a moral signal — it is a form of self-torture. Frankl and Nietzsche both take guilt seriously; Nietzsche provides the genealogical mechanism."
  },
  {
    "id": "ee_031",
    "source": "fn_028",
    "target": "ac_013",
    "type": "extends",
    "weight": 2,
    "label": "Art as making life bearable extends art as most honest response to absurd",
    "notes": "Camus: art is the most honest response to the absurd because it neither explains the world nor escapes it — it describes it exactly as it is. Nietzsche extends this: art is the primary means by which human beings make life bearable rather than merely endurable. Nietzsche is not describing art's honesty but its necessity — art is a survival mechanism, not merely an intellectual achievement."
  },
  {
    "id": "ee_032",
    "source": "mm_010",
    "target": "bp_016",
    "type": "extends",
    "weight": 2,
    "label": "Cannibals of Brazil extend custom as foundation of moral intuition",
    "notes": "Pascal: custom and habit are the true foundations of most of what people call morality — very little was arrived at by reason. Montaigne extends this empirically by providing the case: the cannibals of Brazil are not barbaric by any standard that survives honest examination. European practices are equally strange and violent by any impartial standard. Montaigne gives Pascal's structural claim its most confronting concrete instantiation."
  },
  {
    "id": "ee_033",
    "source": "mm_028",
    "target": "ar_009",
    "type": "extends",
    "weight": 2,
    "label": "Stoicism too rigid for actual humans extends virtue as the situational mean",
    "notes": "Aristotle: virtue is the mean between extremes appropriate to the situation — not a fixed rule but a contextual judgment. Montaigne extends this critique of systematic virtue: Stoic philosophy, which he studied intensively, eventually struck him as too rigid — too confident that reason could govern emotion, too demanding of a consistency that no actual human being achieves. The situational flexibility Aristotle builds in is in tension with Stoicism's demand for consistency."
  },
  {
    "id": "ee_034",
    "source": "fd_021",
    "target": "cd_012",
    "type": "extends",
    "weight": 2,
    "label": "Intergenerational transmission of psychological patterns extends emotional continuity",
    "notes": "Darwin: emotional expression and its patterns are continuous across mammals — these are inherited rather than constructed. Dostoevsky extends this into the domain of family psychology: the sins of parents are structurally transmitted through the psychological environment they create. Dostoevsky anticipates modern developmental psychology. Darwin provides the evolutionary underpinning for the transmission mechanism."
  },
  {
    "id": "ee_035",
    "source": "vf_004",
    "target": "ma_001",
    "type": "extends",
    "weight": 3,
    "label": "Stimulus-response gap extends event vs. judgment of event",
    "notes": "Marcus Aurelius: the event and your judgment of the event are two separate things — suffering comes almost entirely from the latter. Frankl extends this with clinical and experiential precision: between stimulus and response there is a space, and in that space is your freedom. This is not a metaphor — it is a physiological and psychological reality. Frankl provides the mechanism for what Marcus Aurelius asserts."
  },
  {
    "id": "ee_036",
    "source": "fd_025",
    "target": "vf_012",
    "type": "extends",
    "weight": 2,
    "label": "Memory of good moment as moral force extends future goal as survival anchor",
    "notes": "Frankl: a person who has a why can endure almost any how — the clarity of a future goal is an anchor. Dostoevsky extends this backward: the memory of a single good moment, a single act of genuine connection, can sustain a human being through enormous darkness. Frankl looks forward; Dostoevsky looks backward. Both identify the same mechanism of meaning-as-anchor operating in different temporal directions."
  },
  {
    "id": "ee_037",
    "source": "ar_031",
    "target": "eb_016",
    "type": "extends",
    "weight": 2,
    "label": "Catharsis extends the cost of seeing too clearly",
    "notes": "Becker: some forms of mental illness are failures of the vital lie — the person who sees too clearly the full weight of the human condition is not broken but too honest for survival. Aristotle extends this by providing the social mechanism: tragedy produces catharsis — the purgation or clarification of the emotions of pity and fear. Tragedy is the controlled exposure to what Becker's person sees without control. Drama provides the psychological safety valve."
  },
  {
    "id": "ee_038",
    "source": "bg_025",
    "target": "ag_013",
    "type": "extends",
    "weight": 2,
    "label": "Stage-specific dharma extends old age as distinct existential stage",
    "notes": "Gawande: old age is a distinct existential stage with its own specific losses, possibilities, and demands — not simply a longer middle age. The Gita extends this structurally: the four stages of life — student, householder, forest dweller, renunciant — each have their own specific dharma. Old age is not the failure of middle age but its own form with its own demands. Gawande and the Gita converge on the stage-specificity of what is required."
  },
  {
    "id": "ee_039",
    "source": "ag_020",
    "target": "ar_011",
    "type": "extends",
    "weight": 3,
    "label": "Better-directed medicine extends phronesis as master virtue",
    "notes": "Aristotle: phronesis — practical wisdom — is the master virtue that governs what technical skill is used for. It cannot be replaced by expertise alone. Gawande extends this into the specific domain of end-of-life medicine: the argument is not for less medicine but for better-directed medicine — the question is what goals the treatment serves and whether those goals are the patient's own. The technical capacity to intervene has outrun the wisdom about when to do so. This is precisely the absence of phronesis."
  },
  {
    "id": "ee_040",
    "source": "as_009",
    "target": "ar_012",
    "type": "extends",
    "weight": 2,
    "label": "Propriety extends practical wisdom as perception not principle",
    "notes": "Aristotle: the practically wise person is not applying a principle — they are perceiving what the situation requires. This cannot be codified. Smith extends this with the specific mechanism: propriety — the appropriateness of action and sentiment to situation — is the first moral standard and it is situational. Smith provides the moral phenomenology that Aristotle's claim about perception requires."
  },
  {
    "id": "ee_041",
    "source": "sw_013",
    "target": "ag_021",
    "type": "extends",
    "weight": 2,
    "label": "Justice as attention extends good doctor as moral not technical competence",
    "notes": "Gawande: the good doctor is one who can ask what matters most, hear the answer without distorting it, and deploy technical skill in the service of what the patient actually values — this is a moral competence, not a technical one. Weil extends the philosophical grounding: justice requires not just the absence of cruelty but the positive act of attention — the willingness to ask of another what they are going through and receive the answer without distortion. Gawande is describing what Weil is specifying."
  },
  {
    "id": "ee_042",
    "source": "eb_020",
    "target": "ac_013",
    "type": "extends",
    "weight": 2,
    "label": "Terror of death driving achievement extends art as response to absurd",
    "notes": "Camus: art is the most honest response to the absurd because it describes the world exactly as it is without explaining or escaping it. Becker extends the motivational analysis: the greatest human achievements are driven by the terror of death rather than the love of life. Camus describes art's honesty; Becker provides its engine. Both are describing the same phenomenon; Becker adds the psychological mechanism."
  },
  {
    "id": "ee_043",
    "source": "bg_019",
    "target": "mm_037",
    "type": "extends",
    "weight": 2,
    "label": "Lotus in mud as ideal mode of presence extends art of attention",
    "notes": "Montaigne: the art of attention — actually noticing what is in front of you, receiving the specific weight and texture of a particular moment — is one of the rarest human achievements. The Gita extends this with a specific image: the lotus in the mud — fully engaged in the world, uncontaminated by it. Both are describing an ideal quality of presence; the Gita adds the framework of non-attachment that makes it sustainable."
  },
  {
    "id": "ee_044",
    "source": "as_018",
    "target": "eb_013",
    "type": "extends",
    "weight": 2,
    "label": "Deception of nature extends vital lie of character",
    "notes": "Becker: the vital lie of character is the set of carefully maintained illusions that allow a person to function — we narrow perception and invest in certain fictions because full awareness would be paralysing. Smith extends this to the civilisational level: the deception of nature — the person who sacrifices their actual wellbeing in pursuit of wealth and distinction that will not deliver it — is what drives economic activity in which all flourish. Both are describing necessary self-deceptions at different scales."
  },
  {
    "id": "es_001",
    "source": "ac_002",
    "target": "ac_001",
    "type": "extends",
    "weight": 2,
    "label": "Absurd as relational extends the collision that produces it",
    "notes": "ac_002 specifies the structural character of the absurd introduced in ac_001: it lives in the relation between human need and cosmic silence, belonging to neither side alone."
  },
  {
    "id": "es_002",
    "source": "ac_003",
    "target": "ac_001",
    "type": "extends",
    "weight": 2,
    "label": "The suicide question extends the absurd",
    "notes": "The most serious philosophical question — whether life is worth living given the absurd — follows directly from ac_001's diagnosis of the collision."
  },
  {
    "id": "es_003",
    "source": "ac_004",
    "target": "ac_003",
    "type": "extends",
    "weight": 2,
    "label": "Physical suicide as one response extends the question",
    "notes": "ac_004 maps one of three possible responses to the question posed in ac_003."
  },
  {
    "id": "es_004",
    "source": "ac_008",
    "target": "vf_005",
    "type": "mirrors",
    "weight": 2,
    "label": "True freedom as facing condition vs freedom as inviolable attitude",
    "notes": "Both locate genuine freedom in the refusal to flinch from one's actual situation rather than in any change of external conditions. Camus: freedom is facing without escape. Frankl: everything can be taken except the attitude chosen. The same inner territory, differently named."
  },
  {
    "id": "es_005",
    "source": "ac_010",
    "target": "ac_006",
    "type": "extends",
    "weight": 2,
    "label": "Sisyphus as perfect absurd hero extends revolt",
    "notes": "Sisyphus embodies ac_006's revolt: no illusion, no reward, no future redemption, and full ownership of the condition anyway."
  },
  {
    "id": "es_006",
    "source": "ac_011",
    "target": "ac_010",
    "type": "extends",
    "weight": 2,
    "label": "The descent is where the victory lives",
    "notes": "The moment Sisyphus walks back down is the completion of what ac_010 establishes about the absurd hero — the most conscious, most free moment."
  },
  {
    "id": "es_007",
    "source": "ac_012",
    "target": "ac_011",
    "type": "extends",
    "weight": 2,
    "label": "Imagine Sisyphus happy extends the descent",
    "notes": "The conclusion follows from ac_011: full ownership of the descent, not despite the condition but because of it."
  },
  {
    "id": "es_008",
    "source": "ac_016",
    "target": "ac_015",
    "type": "extends",
    "weight": 2,
    "label": "Mediterranean landscape as philosophy extends insistence on body",
    "notes": "ac_016 makes the philosophical claim explicit that ac_015 establishes through the body: the concrete immediate world is not a consolation prize but the prize itself."
  },
  {
    "id": "es_009",
    "source": "ac_017",
    "target": "ac_006",
    "type": "extends",
    "weight": 2,
    "label": "Death reveals meaning as responsibility extends revolt",
    "notes": "ac_017 names what revolt generates: the awareness that meaning was always the revolting subject's responsibility, not a cosmic endowment."
  },
  {
    "id": "es_010",
    "source": "ac_018",
    "target": "ac_017",
    "type": "extends",
    "weight": 2,
    "label": "Awareness of death as clarification extends death revealing responsibility",
    "notes": "The absurd man's intense awareness of death is precisely the clarification that removes the luxury of postponement described in ac_017."
  },
  {
    "id": "es_011",
    "source": "ag_004",
    "target": "ag_001",
    "type": "extends",
    "weight": 2,
    "label": "The right question extends medicine's structural error",
    "notes": "ag_004's distinction between what do you want us to do and what matters most to you is the practical correction to the error diagnosed in ag_001."
  },
  {
    "id": "es_012",
    "source": "ag_006",
    "target": "ag_001",
    "type": "extends",
    "weight": 2,
    "label": "Avoidance by doctors extends medicine's misdefined task",
    "notes": "The hard conversation being avoided by physicians rather than patients is a direct consequence of medicine defining its task as defeating death."
  },
  {
    "id": "es_013",
    "source": "ag_007",
    "target": "ag_019",
    "type": "extends",
    "weight": 3,
    "label": "Palliative care producing longer survival extends hospice outcomes",
    "notes": "ag_007 is the specific empirical finding that grounds ag_019's broader claim: care organised around comfort and patient goals is medically superior even by survival metrics."
  },
  {
    "id": "es_014",
    "source": "ag_009",
    "target": "ag_002",
    "type": "extends",
    "weight": 2,
    "label": "What you sacrifice for more time extends safe vs meaningful life",
    "notes": "The question of sacrifice makes concrete what ag_002 establishes abstractly: most patients, when honestly asked, prefer meaning over safety."
  },
  {
    "id": "es_015",
    "source": "ag_012",
    "target": "ag_008",
    "type": "extends",
    "weight": 2,
    "label": "Courage to stop extends intelligent shifting of hope",
    "notes": "The transition from cure-seeking to comfort-seeking is the practical act that ag_008 describes at the level of hope: the intelligent redirection rather than abandonment."
  },
  {
    "id": "es_016",
    "source": "ag_016",
    "target": "sk_016",
    "type": "converges",
    "weight": 2,
    "label": "Preserving authorship of one's story converges with irreducibility of the individual",
    "notes": "Gawande: good assisted living preserves the sense that one is still the author of one's own life. Kierkegaard: the single individual standing before God is the irreducible unit of all genuine significance. Both insist that the particular person's self-determination cannot be subordinated to institutional management without genuine loss."
  },
  {
    "id": "es_017",
    "source": "ag_018",
    "target": "ag_003",
    "type": "extends",
    "weight": 2,
    "label": "Institution interests opposing patient interests extends institution design problem",
    "notes": "ag_018 identifies the structural cause of what ag_003 describes at the level of physical environment and schedule."
  },
  {
    "id": "es_018",
    "source": "ag_023",
    "target": "ag_012",
    "type": "extends",
    "weight": 2,
    "label": "Courage equals having the conversation extends courage to stop",
    "notes": "ag_023 names the specific act that ag_012 describes abstractly: the harder and less supported form of courage at the end of life."
  },
  {
    "id": "es_019",
    "source": "ag_024",
    "target": "ag_015",
    "type": "extends",
    "weight": 2,
    "label": "Medical bias toward maximum intervention extends power outrunning wisdom",
    "notes": "ag_024 identifies the institutional mechanism by which ag_015's structural failure operates in practice."
  },
  {
    "id": "es_020",
    "source": "ag_025",
    "target": "ag_023",
    "type": "extends",
    "weight": 2,
    "label": "Conversation is the intervention extends courage equals having it",
    "notes": "The closing node of Gawande's argument: the intervention most feared (stopping treatment) is less available and less important than the conversation that could have happened years earlier."
  },
  {
    "id": "es_021",
    "source": "ar_002",
    "target": "ar_001",
    "type": "extends",
    "weight": 2,
    "label": "Happiness as activity extends eudaimonia as highest good",
    "notes": "The key specification: happiness is not a state that happens to you but an activity you perform. This is why Aristotle's account of the good life is inherently active."
  },
  {
    "id": "es_022",
    "source": "ar_003",
    "target": "ar_001",
    "type": "extends",
    "weight": 2,
    "label": "Every action aims at some good extends the highest good",
    "notes": "The architectonic structure: all goods are ordered toward some highest good, which ar_001 identifies as eudaimonia."
  },
  {
    "id": "es_023",
    "source": "ar_004",
    "target": "mm_009",
    "type": "converges",
    "weight": 2,
    "label": "Good life assessed from end converges with philosophy as preparation for death",
    "notes": "Aristotle: you cannot say whether a life was good until it is complete — the ending matters to the assessment of the whole. Montaigne: the practical work of philosophy is preparation for the one event that admits no further preparation. Both treat the ending of a life as philosophically central."
  },
  {
    "id": "es_024",
    "source": "ar_008",
    "target": "ar_006",
    "type": "extends",
    "weight": 2,
    "label": "Unity of virtues extends virtue as stable disposition",
    "notes": "The unity of the virtues follows from ar_006's account of virtue as a unified disposition: because phronesis underlies all of them, they cannot be genuinely separated."
  },
  {
    "id": "es_025",
    "source": "ar_010",
    "target": "ar_007",
    "type": "extends",
    "weight": 2,
    "label": "We are what we repeatedly do extends virtue acquired by practice",
    "notes": "ar_010 is the most memorable formulation of ar_007's argument: the stable disposition of character is built by repeated action, not by knowing what virtue is."
  },
  {
    "id": "es_026",
    "source": "ar_014",
    "target": "ar_009",
    "type": "extends",
    "weight": 2,
    "label": "Pleasure as accompaniment of excellent activity extends the mean",
    "notes": "Pleasure for Aristotle is the sign that the activity is being performed excellently — it is not the goal but the natural accompaniment. This extends ar_009's account of how virtue registers."
  },
  {
    "id": "es_027",
    "source": "ar_016",
    "target": "ar_014",
    "type": "extends",
    "weight": 2,
    "label": "Pleasure-seeking as self-defeating extends pleasure as accompaniment",
    "notes": "If pleasure is the accompaniment of excellent activity, then making pleasure the goal destroys the conditions of its production — the argument of ar_016 follows directly."
  },
  {
    "id": "es_028",
    "source": "ar_017",
    "target": "ar_006",
    "type": "extends",
    "weight": 2,
    "label": "Right emotions toward right people at right time extends stable disposition",
    "notes": "The emotional dimension of virtue: the stable disposition includes feeling the right thing, not merely doing it."
  },
  {
    "id": "es_029",
    "source": "ar_020",
    "target": "ar_019",
    "type": "extends",
    "weight": 2,
    "label": "Three kinds of friendship extends friendship as constitutive of flourishing",
    "notes": "ar_020 provides the taxonomic structure for the claim of ar_019: only one of the three kinds — character friendship — is genuinely constitutive of flourishing."
  },
  {
    "id": "es_030",
    "source": "ar_021",
    "target": "ar_020",
    "type": "extends",
    "weight": 2,
    "label": "Complete friendship rare and slow extends three kinds",
    "notes": "The rarity and difficulty of character friendship follows from what distinguishes it in ar_020: it requires time, shared experience, and genuine virtue on both sides."
  },
  {
    "id": "es_031",
    "source": "ar_022",
    "target": "ar_029",
    "type": "extends",
    "weight": 2,
    "label": "Self-knowledge as precondition for virtue extends bad judges of own cases",
    "notes": "ar_022 is the positive prescription that ar_029's negative diagnosis implies: because we are systematically bad judges of ourselves, self-knowledge requires deliberate and difficult effort."
  },
  {
    "id": "es_032",
    "source": "ar_023",
    "target": "ar_009",
    "type": "extends",
    "weight": 2,
    "label": "Generosity as mean extends virtue as situational mean",
    "notes": "Generosity — giving the right amount to the right people at the right time — is a specific application of the general principle in ar_009."
  },
  {
    "id": "es_033",
    "source": "ar_028",
    "target": "ar_022",
    "type": "extends",
    "weight": 2,
    "label": "Magnanimity as accurate self-assessment extends self-knowledge as precondition",
    "notes": "The great-souled person's accurate self-assessment — neither inflating nor deflating — is the application of ar_022's requirement for genuine self-knowledge."
  },
  {
    "id": "es_034",
    "source": "ar_030",
    "target": "ar_028",
    "type": "extends",
    "weight": 2,
    "label": "Honour-driven life as failure of magnanimity extends magnanimity",
    "notes": "The person who organises their life around honour has externalised the assessment that ar_028 says must be internal: they have become dependent on others' judgment rather than their own."
  },
  {
    "id": "es_035",
    "source": "ar_032",
    "target": "ar_031",
    "type": "extends",
    "weight": 2,
    "label": "Best plots as necessary or probable extends tragedy producing catharsis",
    "notes": "The formal account of good plot structure extends ar_031: catharsis requires that events feel necessary or probable, not arbitrary, so the emotional clarification can occur."
  },
  {
    "id": "es_036",
    "source": "as_002",
    "target": "as_001",
    "type": "extends",
    "weight": 2,
    "label": "Sympathy never perfect extends sympathy as foundation",
    "notes": "The structural gap in sympathy — we always fall somewhat short of what the other feels — is an essential feature of as_001's account, not a defect. It creates the distance necessary for judgment."
  },
  {
    "id": "es_037",
    "source": "as_004",
    "target": "fd_012",
    "type": "mirrors",
    "weight": 2,
    "label": "Proximity bias in moral concern mirrors love of humanity vs actual humans",
    "notes": "Both diagnose the same psychological structure from different directions. Smith: we are naturally more moved by those near us — this is not a failure but a feature of how sympathy works. Dostoevsky: love of humanity in the abstract is almost always a substitute for inability to love actual people in particular. Same diagnosis; Smith's is descriptive, Dostoevsky's is indicting."
  },
  {
    "id": "es_038",
    "source": "as_007",
    "target": "as_006",
    "type": "extends",
    "weight": 2,
    "label": "Wealth corrupting impartial spectator extends self-deceit",
    "notes": "The structural mechanism by which wealth corrupts moral judgment is a specific instance of as_006's account of systematic self-deception: the powerful are surrounded by favorable mirrors."
  },
  {
    "id": "es_039",
    "source": "as_013",
    "target": "as_010",
    "type": "extends",
    "weight": 2,
    "label": "Beneficence vs justice distinction extends foundation in gratitude and resentment",
    "notes": "The distinction between what can and cannot be compelled follows from the emotional foundation: justice commands from the impartial spectator's sympathy with resentment; beneficence flows from sympathy with gratitude, which cannot be coerced."
  },
  {
    "id": "es_040",
    "source": "as_016",
    "target": "ar_007",
    "type": "converges",
    "weight": 2,
    "label": "Self-command as foundational virtue converges with virtue acquired by practice",
    "notes": "Both identify a foundational virtue without which the others collapse: for Aristotle this is practical wisdom (phronesis), for Smith it is self-command. Both agree the foundation must be cultivated through practice rather than known as a principle."
  },
  {
    "id": "es_041",
    "source": "as_024",
    "target": "as_008",
    "type": "extends",
    "weight": 2,
    "label": "Society admiring rich regardless of virtue extends natural tendency to admire wealthy",
    "notes": "as_024 describes the civilisational consequence of the individual bias diagnosed in as_008: when the individual distortion becomes systemic, the moral infrastructure of society begins to fail."
  },
  {
    "id": "es_042",
    "source": "as_025",
    "target": "as_001",
    "type": "extends",
    "weight": 2,
    "label": "Adam Smith problem extends sympathy as foundation",
    "notes": "The tension between the Theory of Moral Sentiments and the Wealth of Nations returns the reader to as_001's foundation: if sympathy is genuinely the basis of moral judgment, can self-interest be the basis of political economy without contradiction?"
  },
  {
    "id": "es_043",
    "source": "bb_001",
    "target": "bb_003",
    "type": "extends",
    "weight": 2,
    "label": "Probability of existing extends borrowed atoms",
    "notes": "The probability calculation depends on the same chain bb_003 describes: every ancestor had to survive long enough to reproduce, through the same matter that has been cycling since the beginning."
  },
  {
    "id": "es_044",
    "source": "bb_002",
    "target": "ma_017",
    "type": "mirrors",
    "weight": 2,
    "label": "Universe history before humans mirrors time as river",
    "notes": "Both situate the human moment within a timescale that dwarfs it. Marcus Aurelius uses river metaphor for the vanishing present; Bryson uses deep time to show that human existence is an extremely late and improbable arrival. The humbling effect is structurally identical."
  },
  {
    "id": "es_045",
    "source": "bb_005",
    "target": "bb_004",
    "type": "extends",
    "weight": 2,
    "label": "Speed of light as permanent isolation extends incomprehensible scale",
    "notes": "bb_005 gives the physical mechanism for what bb_004 establishes epistemologically: not only is the universe ungraspably large, but its structure permanently forecloses most of it from access."
  },
  {
    "id": "es_046",
    "source": "bb_008",
    "target": "bb_009",
    "type": "extends",
    "weight": 2,
    "label": "Bacteria as true owners extends extinction as default",
    "notes": "The bacterial case is the paradigm example of bb_009's claim: bacteria have survived every extinction event, represent the most successful life strategy, and will almost certainly outlast complex organisms."
  },
  {
    "id": "es_047",
    "source": "bb_011",
    "target": "bb_010",
    "type": "extends",
    "weight": 2,
    "label": "Amateurs making discoveries extends science as human process",
    "notes": "The amateur and outsider scientists are the most striking evidence for bb_010's claim that science is not a clean linear march of credentialed professionals toward truth."
  },
  {
    "id": "es_048",
    "source": "bb_012",
    "target": "bb_011",
    "type": "extends",
    "weight": 2,
    "label": "Scientists working against consensus extends amateurs making discoveries",
    "notes": "bb_012 deepens bb_011: the most transformative work was done not merely outside institutions but actively against the grain of established consensus."
  },
  {
    "id": "es_049",
    "source": "bb_013",
    "target": "bb_003",
    "type": "extends",
    "weight": 2,
    "label": "Biosphere produced by life extends borrowed atoms",
    "notes": "The oxygen you breathe was made by organisms — this is the atmospheric version of bb_003's atomic insight: you are not separate from the living process but embedded in it."
  },
  {
    "id": "es_050",
    "source": "bb_014",
    "target": "bb_004",
    "type": "extends",
    "weight": 2,
    "label": "Geological timescales extend incomprehensible scale",
    "notes": "bb_014 applies bb_004's epistemic point to landscape: the permanence of rock and mountain is an illusion produced by the brevity of human lives."
  },
  {
    "id": "es_051",
    "source": "bb_015",
    "target": "bb_007",
    "type": "extends",
    "weight": 2,
    "label": "Yellowstone extends life nearly wiped out five times",
    "notes": "A specific live instance of bb_007's historical pattern: the capacity for mass extinction is not only past but present and geologically imminent."
  },
  {
    "id": "es_052",
    "source": "bb_016",
    "target": "bb_010",
    "type": "extends",
    "weight": 2,
    "label": "Behavioural modernity mystery extends science as human process",
    "notes": "The genuine uncertainty about what changed 50,000 years ago is itself evidence for bb_010's point about science: confident accounts of human uniqueness consistently outrun the evidence."
  },
  {
    "id": "es_053",
    "source": "bb_018",
    "target": "bb_001",
    "type": "extends",
    "weight": 2,
    "label": "37 trillion cells extends probability of existing",
    "notes": "The cellular complexity of a single body is the internal dimension of the external improbability bb_001 describes: every one of those cells is running thousands of simultaneous reactions that are each an implausible achievement."
  },
  {
    "id": "es_054",
    "source": "bb_020",
    "target": "bb_019",
    "type": "extends",
    "weight": 2,
    "label": "History of curiosity extends wonder as discipline",
    "notes": "The history of science is the institutional history of bb_019's claim: curiosity as the deliberate refusal to take existence for granted, often at great personal cost."
  },
  {
    "id": "es_055",
    "source": "bg_003",
    "target": "bg_001",
    "type": "extends",
    "weight": 2,
    "label": "Arjuna's crisis extends the atman teaching",
    "notes": "The crisis at Kurukshetra is what occasions the teaching: Arjuna's identification with the body and relationships is the precise condition the atman doctrine corrects."
  },
  {
    "id": "es_056",
    "source": "bg_006",
    "target": "bg_005",
    "type": "extends",
    "weight": 2,
    "label": "Attachment to outcomes as source of suffering extends karma yoga",
    "notes": "bg_006 specifies the psychological mechanism that karma yoga is designed to address: acting without attachment to outcomes removes the causal chain from action to suffering."
  },
  {
    "id": "es_057",
    "source": "bg_007",
    "target": "bg_016",
    "type": "extends",
    "weight": 2,
    "label": "Three paths to liberation extend prapatti",
    "notes": "The three paths — karma yoga, jnana yoga, bhakti yoga — are all routes to the same destination that bg_016 describes as prapatti: surrender that is the most active form of engagement."
  },
  {
    "id": "es_058",
    "source": "bg_008",
    "target": "bg_017",
    "type": "extends",
    "weight": 2,
    "label": "Mind as source of bondage and liberation extends gunas can shift",
    "notes": "bg_008's psychological teaching is the mechanism behind bg_017's claim: because the balance of gunas can be shifted, the mind's orientation can change — from binding to liberating."
  },
  {
    "id": "es_059",
    "source": "bg_009",
    "target": "ma_003",
    "type": "converges",
    "weight": 3,
    "label": "Equanimity as central teaching converges with present moment as manageable",
    "notes": "The most direct cross-book converges in the Gita-Marcus Aurelius cluster. Samatvam — equanimity toward gain and loss, pleasure and pain — is the Gita's central practical teaching. Marcus Aurelius's core insight is that anxiety is about the non-present and the uncontrollable; the present moment is almost always manageable. Two frameworks 500 years apart arriving at structurally identical practical teaching."
  },
  {
    "id": "es_060",
    "source": "bg_010",
    "target": "bg_008",
    "type": "extends",
    "weight": 2,
    "label": "Senses drawing mind outward extends mind as source of bondage",
    "notes": "bg_010 identifies the specific mechanism by which the mind becomes enslaved: the senses pull it toward their objects, dispersing the attention that bg_008 says must be mastered."
  },
  {
    "id": "es_061",
    "source": "bg_011",
    "target": "bg_005",
    "type": "extends",
    "weight": 2,
    "label": "Wise person acts without ego-identification extends karma yoga",
    "notes": "bg_011 is the psychological portrait of the karma yogi: they act as an instrument of something larger than the personal ego."
  },
  {
    "id": "es_062",
    "source": "bg_013",
    "target": "bg_006",
    "type": "extends",
    "weight": 2,
    "label": "Ego-driven desire as problem extends attachment to outcomes",
    "notes": "bg_013 refines bg_006's diagnosis: desire itself is not the problem — it is ego-driven desire, the desire that identifies with the small self's outcomes, that produces suffering."
  },
  {
    "id": "es_063",
    "source": "bg_014",
    "target": "bg_017",
    "type": "extends",
    "weight": 2,
    "label": "Three gunas described extends gunas can be shifted",
    "notes": "bg_014 describes the taxonomy whose practical implications bg_017 draws: because the gunas are identifiable and their effects known, their balance can be deliberately cultivated."
  },
  {
    "id": "es_064",
    "source": "bg_015",
    "target": "bg_001",
    "type": "extends",
    "weight": 2,
    "label": "Fear from ego-identification extends the atman teaching",
    "notes": "Fear arises from identifying with the body and ego — which the atman teaching of bg_001 directly addresses. The cure is the diagnosis."
  },
  {
    "id": "es_065",
    "source": "bg_018",
    "target": "ma_004",
    "type": "mirrors",
    "weight": 2,
    "label": "Cyclical time mirrors everything transforms and returns",
    "notes": "The Gita's cyclical kalpas — vast cycles of creation and dissolution — are the cosmological version of Marcus Aurelius's river of transformation. Both locate the individual within a process of change so fundamental that death is not exit but phase."
  },
  {
    "id": "es_066",
    "source": "bg_020",
    "target": "ar_012",
    "type": "converges",
    "weight": 2,
    "label": "Context-dependent ethics converges with practically wise person perceiving situation",
    "notes": "The Gita's radical situational ethics — Arjuna's duty is what it is because of who he is in this situation — converges with Aristotle's account of phronesis as the perception of what the particular situation requires. Neither is applying a universal rule; both are responding to the particular."
  },
  {
    "id": "es_067",
    "source": "bg_021",
    "target": "bg_016",
    "type": "extends",
    "weight": 2,
    "label": "Bhakti yoga extends prapatti",
    "notes": "Devotional love — bhakti — is the emotional and relational form of the surrender described in bg_016. It is available to everyone regardless of intellectual capacity."
  },
  {
    "id": "es_068",
    "source": "bg_022",
    "target": "bg_004",
    "type": "extends",
    "weight": 2,
    "label": "Divine sees all equally extends atman identical to Brahman",
    "notes": "The divine equality of vision follows directly from bg_004's metaphysics: if the atman in every being is identical to Brahman, all beings are equally the divine looking at itself."
  },
  {
    "id": "es_069",
    "source": "bg_024",
    "target": "ma_003",
    "type": "converges",
    "weight": 2,
    "label": "Self-controlled person moving through world converges with present moment as manageable",
    "notes": "The sthitaprajna's movement through sensory experience — receiving neither pleasure nor pain — is the Gita's portrait of what Marcus Aurelius's practical teaching looks like when embodied: full engagement without reactivity."
  },
  {
    "id": "es_070",
    "source": "bg_026",
    "target": "bg_001",
    "type": "extends",
    "weight": 2,
    "label": "Field and knower of the field extends atman",
    "notes": "bg_026's distinction between kshetra (body-mind-world as the field) and kshetrajna (the knower) is an elaboration of bg_001's core claim: the real self is not the body."
  },
  {
    "id": "es_071",
    "source": "bg_027",
    "target": "bg_004",
    "type": "extends",
    "weight": 2,
    "label": "Vishvarupa vision extends atman identical to Brahman",
    "notes": "The vision of Krishna's cosmic form is the direct perception of what bg_004 states philosophically: the individual is a manifestation of the universal, and the universal contains all."
  },
  {
    "id": "es_072",
    "source": "bg_028",
    "target": "bg_016",
    "type": "extends",
    "weight": 2,
    "label": "Gita's final resolution as surrender extends prapatti",
    "notes": "The final teaching — sarva-dharman parityajya, abandon all dharmas and take refuge in me alone — is the fullest statement of bg_016's prapatti as the most complete form of surrender."
  },
  {
    "id": "es_073",
    "source": "bg_029",
    "target": "lz_004",
    "type": "mirrors",
    "weight": 3,
    "label": "Sthitaprajna mirrors wu wei",
    "notes": "The sthitaprajna — the person of steady wisdom who acts from equanimity without ego-driven desire — is the Gita's portrait of what the Tao Te Ching's wu wei describes from a different metaphysical starting point. Both describe a mode of effortless, ego-free action that leaves no unnecessary trace. One of the strongest cross-tradition mirrors in the graph."
  },
  {
    "id": "es_074",
    "source": "bg_030",
    "target": "bg_012",
    "type": "extends",
    "weight": 2,
    "label": "Teaching readiness extends viveka",
    "notes": "bg_030's claim that the teaching cannot be received by one who is not ready depends on bg_012's account of viveka — discriminative intelligence — as the faculty that makes reception possible."
  },
  {
    "id": "es_075",
    "source": "bg_031",
    "target": "bo_013",
    "type": "mirrors",
    "weight": 2,
    "label": "Evil as adharma mirrors evil as privation",
    "notes": "The Gita: evil is not a cosmological principle but a process quality — adharma, disorder, the failure of alignment with dharmic order. Boethius: evil is not a positive force but an absence, a privation, a failure of the good. Two frameworks separated by 800 years arriving at structurally identical diagnoses of evil as privation rather than positive force."
  },
  {
    "id": "es_076",
    "source": "bg_032",
    "target": "cd_025",
    "type": "mirrors",
    "weight": 2,
    "label": "Caveat on historical context mirrors Darwin caveat",
    "notes": "Both are caveat nodes acknowledging that the text was composed in a historical context that includes claims — about caste in the Gita, about racial and sexual hierarchy in Darwin — that are morally indefensible by any standard that survives honest examination. Intellectual honesty within both nodes names what must be named."
  },
  {
    "id": "es_077",
    "source": "bo_001",
    "target": "ma_001",
    "type": "converges",
    "weight": 2,
    "label": "Fortune not cruel converges with suffering from judgment not event",
    "notes": "Fortune is honest about what it always was — the suffering comes from misreading the contract, not from Fortune's betrayal. Marcus Aurelius: suffering comes almost entirely from the judgment of the event, not the event itself. Both locate the problem in cognitive misattribution rather than in the external circumstance."
  },
  {
    "id": "es_078",
    "source": "bo_002",
    "target": "bo_005",
    "type": "extends",
    "weight": 2,
    "label": "Wheel of Fortune extends false goods",
    "notes": "The wheel operates on what bo_005 identifies as false goods: they rise and fall precisely because they are external, contingent, and revocable."
  },
  {
    "id": "es_079",
    "source": "bo_003",
    "target": "bo_002",
    "type": "extends",
    "weight": 2,
    "label": "Fortune smiling as trap extends the wheel",
    "notes": "Prosperity creates attachment, which creates the conditions for suffering when the wheel turns — the mechanism by which bo_002's wheel produces harm."
  },
  {
    "id": "es_080",
    "source": "bo_004",
    "target": "bo_001",
    "type": "extends",
    "weight": 2,
    "label": "Fortune's direct speech extends Fortune not cruel",
    "notes": "Fortune speaks in her own voice to make the argument of bo_001 explicit: the contract was clear, and those who accepted the gifts accepted the terms."
  },
  {
    "id": "es_081",
    "source": "bo_006",
    "target": "bo_005",
    "type": "extends",
    "weight": 2,
    "label": "Wealth doesn't make wealthy extends false goods",
    "notes": "The specific argument against wealth as a good: it creates needs, dependencies, and anxieties that the person without wealth does not have. The more you accumulate, the more there is to lose."
  },
  {
    "id": "es_082",
    "source": "bo_008",
    "target": "bo_005",
    "type": "extends",
    "weight": 2,
    "label": "Power corrupts by externalising self-worth extends false goods",
    "notes": "Power is a false good for the same structural reason as wealth: it makes your sense of self contingent on something external and revocable."
  },
  {
    "id": "es_083",
    "source": "bo_009",
    "target": "ma_012",
    "type": "converges",
    "weight": 3,
    "label": "Internal goods cannot be taken converges with you are not your body",
    "notes": "One of the strongest converges pairs in the graph. Boethius: the only goods that cannot be taken from you are internal — virtue, wisdom, the quality of your character. Marcus Aurelius: you are not your body, not your reputation, not your role — you are the faculty that chooses. Both identify the same inviolable interior from different directions."
  },
  {
    "id": "es_084",
    "source": "bo_011",
    "target": "bo_005",
    "type": "extends",
    "weight": 2,
    "label": "You already possess the good extends false goods",
    "notes": "The positive formulation: if what you are seeking is internal goods, and you already have internal goods, you are seeking what you already possess — the misdirection of desire."
  },
  {
    "id": "es_085",
    "source": "bo_015",
    "target": "bo_012",
    "type": "extends",
    "weight": 2,
    "label": "God's knowledge not sequential extends providential order",
    "notes": "The philosophical account of how providence is compatible with contingency: God's knowledge is not sequential but simultaneous, which is why foreknowledge does not create necessity."
  },
  {
    "id": "es_086",
    "source": "bo_016",
    "target": "bo_015",
    "type": "extends",
    "weight": 2,
    "label": "Contingent from inside, necessary from outside extends God's non-sequential knowledge",
    "notes": "bo_016 draws the consequence of bo_015: the same event appears contingent from the inside of time and necessary from outside it. Both perspectives are simultaneously correct."
  },
  {
    "id": "es_087",
    "source": "bo_017",
    "target": "bo_015",
    "type": "extends",
    "weight": 2,
    "label": "Free will and providence compatible extends God's non-sequential knowledge",
    "notes": "The logical point — observation does not create necessity — resolves the apparent tension: God's foreknowledge is more like watching than determining."
  },
  {
    "id": "es_088",
    "source": "bo_018",
    "target": "bo_017",
    "type": "extends",
    "weight": 2,
    "label": "Free will as spectrum extends free will and providence compatible",
    "notes": "The hierarchy of soul levels introduces gradation: at higher levels of reason the will is most free; at lower levels it is most determined. This refines bo_017's account."
  },
  {
    "id": "es_089",
    "source": "bp_001",
    "target": "bb_021",
    "type": "converges",
    "weight": 3,
    "label": "Wretched and magnificent converges with universe knowing itself",
    "notes": "One of the most significant cross-book converges in the graph. Pascal: humans are simultaneously the most wretched and most magnificent creatures — wretched because finite and mortal, magnificent because we know it. Bryson: we are the universe's way of knowing itself. Same paradox; Pascal names it as tragedy, Bryson as astonishment."
  },
  {
    "id": "es_090",
    "source": "bp_005",
    "target": "mm_018",
    "type": "converges",
    "weight": 2,
    "label": "Hunting not for hare converges with ambition not about what it claims",
    "notes": "Both diagnose the same structural substitution: the stated goal (the hare, the achievement) is not the real goal. The real goal is the avoidance of the self and the sensation of forward movement. Pascal's hunting example and Montaigne's ambition analysis are the same observation from different angles."
  },
  {
    "id": "es_091",
    "source": "bp_006",
    "target": "bp_004",
    "type": "extends",
    "weight": 2,
    "label": "Diversion as most powerful force extends inability to sit quietly",
    "notes": "bp_006 makes explicit the mechanism bp_004 introduces: diversion is specifically the response to the confrontation with mortality, meaninglessness, and loneliness that sitting quietly would produce."
  },
  {
    "id": "es_092",
    "source": "bp_007",
    "target": "bp_002",
    "type": "extends",
    "weight": 2,
    "label": "Suspended between infinities extends the thinking reed",
    "notes": "bp_007 develops bp_002's paradox spatially: the human position between the infinitely large and the infinitely small is not central but radically displaced — weak but aware of the weakness."
  },
  {
    "id": "es_093",
    "source": "bp_012",
    "target": "bp_013",
    "type": "extends",
    "weight": 2,
    "label": "Pascal's Wager extends faith as choice in presence of doubt",
    "notes": "The Wager is the decision-theoretic argument for taking the question seriously that bp_013's account of faith requires: faith is not certainty but a choice made under genuine uncertainty, and the Wager addresses the rationality of that choice."
  },
  {
    "id": "es_094",
    "source": "bp_017",
    "target": "bp_002",
    "type": "extends",
    "weight": 2,
    "label": "Awareness of misery as sign of greatness extends the thinking reed",
    "notes": "The argument of bp_002 applied: only a being capable of imagining something better can be dissatisfied with what is. Suffering is evidence of depth. The thinking reed's awareness is the measure of its greatness, not evidence of its smallness."
  },
  {
    "id": "es_095",
    "source": "bp_019",
    "target": "ma_017",
    "type": "converges",
    "weight": 2,
    "label": "Never fully present converges with time as river",
    "notes": "Pascal: we live in anticipation of the future or memory of the past — the present is the one place we almost never actually inhabit. Marcus Aurelius: time is a river of vanishing moments. Both identify the same failure of presence; Marcus Aurelius diagnoses the flow, Pascal diagnoses the avoidance."
  },
  {
    "id": "es_096",
    "source": "cd_005",
    "target": "cd_003",
    "type": "extends",
    "weight": 2,
    "label": "Conscience from conflict extends moral sense as evolved",
    "notes": "cd_005 gives the specific evolutionary mechanism behind cd_003's claim: conscience arises from the conflict between persistent social instincts and transient individual desires — this is what gives conscience its characteristic phenomenology of retrospective shame."
  },
  {
    "id": "es_097",
    "source": "cd_009",
    "target": "cd_002",
    "type": "extends",
    "weight": 2,
    "label": "Sexual selection extends no design in nature",
    "notes": "Sexual selection is a second mechanism alongside natural selection, with structurally identical absence of purpose: mate preferences are not designed by God or explained by survival advantage but are the accumulated result of selecting organisms."
  },
  {
    "id": "es_098",
    "source": "cd_011",
    "target": "cd_001",
    "type": "extends",
    "weight": 2,
    "label": "Language as evolved expression extends no fundamental discontinuity",
    "notes": "Language — the capacity most often used to define human uniqueness — is shown by cd_011 to be an elaboration of communicative capacities that exist in other species, consistent with cd_001's claim that differences are of degree not kind."
  },
  {
    "id": "es_099",
    "source": "cd_014",
    "target": "cd_002",
    "type": "extends",
    "weight": 2,
    "label": "Individual as temporary population expression extends no design",
    "notes": "The statistical reality behind natural selection: the individual is a momentary configuration of variation in a population, significant to itself but ephemeral in the evolutionary process that cd_002 describes."
  },
  {
    "id": "es_100",
    "source": "cd_016",
    "target": "cd_001",
    "type": "extends",
    "weight": 2,
    "label": "Rudiments of all faculties in lower animals extends no discontinuity",
    "notes": "The most comprehensive empirical support for cd_001: Darwin documents precursors of every human mental and moral capacity — memory, attention, curiosity, sympathy, aesthetic appreciation — in other animals."
  },
  {
    "id": "es_101",
    "source": "cd_020",
    "target": "ac_006",
    "type": "converges",
    "weight": 3,
    "label": "Naturalisation without nihilism converges with revolt",
    "notes": "One of the most important cross-book converges. Darwin: the fact that humans are the product of natural selection does not make human life meaningless — it changes what meaning means without eliminating it. Camus: revolt holds the absurd tension without resolving it, living and creating without cosmic guarantee. Both refuse the slide from the removal of transcendent grounding to nihilism."
  },
  {
    "id": "es_102",
    "source": "eb_010",
    "target": "eb_009",
    "type": "extends",
    "weight": 2,
    "label": "Crisis of secular society extends hero systems",
    "notes": "The crisis follows from eb_009's structure: modern society has dismantled the traditional hero systems without replacing them with anything of comparable psychological power, leaving heroic needs unmet."
  },
  {
    "id": "es_103",
    "source": "eb_015",
    "target": "eb_014",
    "type": "extends",
    "weight": 2,
    "label": "Lover who sees you as god extends romantic love's impossible weight",
    "notes": "eb_015 names the specific psychological mechanism by which eb_014's impossible weight operates: the lover who idealizes has turned their partner into an immortality project, which no human being can sustain."
  },
  {
    "id": "es_104",
    "source": "eb_017",
    "target": "eb_016",
    "type": "extends",
    "weight": 2,
    "label": "Schizophrenia extends some mental illness as failure of vital lie",
    "notes": "Becker's most speculative application of the framework: if eb_016 describes mental illness as too-clear vision of the human condition, schizophrenia is the collapse of all symbolic defence in the most extreme form. Flagged as contested."
  },
  {
    "id": "es_105",
    "source": "eb_019",
    "target": "lz_014",
    "type": "mirrors",
    "weight": 2,
    "label": "Life and death instincts as entangled mirrors everything contains its opposite",
    "notes": "Becker: the life instinct and death instinct are not opposites but entangled — pure Eros without Thanatos produces delusions of omnipotence. Laozi: everything contains its opposite and depends on it — being and non-being produce each other. Two frameworks describing the same structural interdependence of apparent opposites."
  },
  {
    "id": "es_106",
    "source": "eb_021",
    "target": "ac_006",
    "type": "converges",
    "weight": 2,
    "label": "Creative illusion as mature response converges with revolt",
    "notes": "Becker: the mature response to mortality awareness is the creative illusion — a chosen engagement that is honest about its fictional scaffolding but committed anyway. Camus: revolt holds the absurd tension without resolving it. Both refuse denial and paralysis; both choose a form of honest engagement that requires no metaphysical guarantee."
  },
  {
    "id": "es_107",
    "source": "eb_022",
    "target": "eb_021",
    "type": "extends",
    "weight": 2,
    "label": "Genuine confrontation producing freedom extends mature response",
    "notes": "eb_022 describes the person who has done what eb_021 prescribes: confronted mortality without flinching and chosen engagement anyway. The freedom, generosity, and creativity that follow are the empirical signature of the mature response."
  },
  {
    "id": "es_108",
    "source": "eb_024",
    "target": "fd_017",
    "type": "converges",
    "weight": 2,
    "label": "Evil as psychological converges with evil from philosophical error",
    "notes": "Becker: evil is what happens when an immortality project is pursued with such intensity that other human lives become instrumental. Dostoevsky: evil is the product of a specific philosophical error taken to its conclusion — the idea absorbed and enacted. Both locate evil not in malice but in the structure of belief meeting the structure of need."
  },
  {
    "id": "es_109",
    "source": "fd_003",
    "target": "fd_001",
    "type": "extends",
    "weight": 2,
    "label": "Alyosha's faith extends faith after doubt",
    "notes": "Alyosha's response is the embodiment of fd_001: not the suppression of Ivan's doubts but a life lived with such love that the question of justification becomes secondary to the act of presence."
  },
  {
    "id": "es_110",
    "source": "fd_004",
    "target": "fd_005",
    "type": "extends",
    "weight": 2,
    "label": "Grand Inquisitor extends freedom as burden",
    "notes": "The Grand Inquisitor is the most fully developed character who has accepted fd_005's thesis: he has spent his life managing the freedom that ordinary humans cannot bear, providing bread, miracle, and authority instead."
  },
  {
    "id": "es_111",
    "source": "fd_006",
    "target": "fd_004",
    "type": "extends",
    "weight": 2,
    "label": "Three temptations as map of political psychology extends Grand Inquisitor",
    "notes": "fd_006 provides the analytical structure behind fd_004's narrative: the three temptations are the complete taxonomy of what the Grand Inquisitor offers, and what humans reliably choose over freedom."
  },
  {
    "id": "es_112",
    "source": "fd_007",
    "target": "fd_005",
    "type": "extends",
    "weight": 2,
    "label": "Freedom requiring capacity to choose badly extends freedom as burden",
    "notes": "fd_007 specifies what genuine freedom requires that makes it so burdensome in fd_005: a supervised freedom that is protected from error is not freedom but a comfortable cage."
  },
  {
    "id": "es_113",
    "source": "fd_009",
    "target": "fd_002",
    "type": "extends",
    "weight": 2,
    "label": "Ivan's rebellion about children extends Ivan as honest atheist",
    "notes": "fd_009 gives the specific argument underlying fd_002's characterisation: Ivan disbelieves specifically because of children's suffering — they have not sinned, cannot be justified by any future harmony, and their suffering is therefore the hardest possible case for any theodicy."
  },
  {
    "id": "es_114",
    "source": "fd_010",
    "target": "fd_011",
    "type": "extends",
    "weight": 2,
    "label": "Redemption as specific and embodied extends love actively and concretely",
    "notes": "fd_010 is the narrative enactment of fd_011's principle: redemption in Dostoevsky is always a specific act of love toward a specific person at a specific moment — never abstract belief."
  },
  {
    "id": "es_115",
    "source": "fd_012",
    "target": "fd_011",
    "type": "extends",
    "weight": 2,
    "label": "Love of humanity vs actual humans extends love concretely",
    "notes": "fd_012 is the negative case that makes fd_011's principle precise: the love of humanity in the abstract is the specific pathology that concrete love — asking what this person in front of me is going through — is designed to correct."
  },
  {
    "id": "es_116",
    "source": "fd_013",
    "target": "fd_011",
    "type": "extends",
    "weight": 2,
    "label": "Unconditional love extends love actively and concretely",
    "notes": "The deepest form of what fd_011 prescribes: love that does not require the other to deserve it — that cannot be manipulated because it cannot be earned."
  },
  {
    "id": "es_117",
    "source": "fd_015",
    "target": "fd_014",
    "type": "extends",
    "weight": 2,
    "label": "Failure to act extends everyone responsible for everything",
    "notes": "fd_015 specifies the mechanism of fd_014's universal responsibility: silence in the face of cruelty is not neutral — it is a choice with consequences as real as any direct action."
  },
  {
    "id": "es_118",
    "source": "fd_020",
    "target": "fd_022",
    "type": "extends",
    "weight": 2,
    "label": "Karamazov family as microcosm extends Russia as humanity universally",
    "notes": "The family is the micro-level instance of what fd_022 claims at the national level: the Karamazov mix of aspiration and degradation is the human condition in concentrated form."
  },
  {
    "id": "es_119",
    "source": "fd_022",
    "target": "fd_008",
    "type": "extends",
    "weight": 2,
    "label": "Russia as humanity universally extends suffering as engine of development",
    "notes": "The universality of the Russian soul's condition in fd_022 is grounded in fd_008's claim: suffering is the primary engine of moral development, and Russia's extremity makes it the clearest case of the universal."
  },
  {
    "id": "es_120",
    "source": "fd_023",
    "target": "bp_003",
    "type": "mirrors",
    "weight": 2,
    "label": "Monasteries and taverns not in opposition mirrors human contradiction irreducible",
    "notes": "Dostoevsky: the sacred and the degraded are not enemies but neighbours — sometimes inhabiting the same person simultaneously. Pascal: human nature is fundamentally contradictory, and any philosophy that resolves this contradiction too cleanly is lying. Both treat the coexistence of high aspiration and low degradation as constitutive of human nature rather than as a failure to be corrected."
  },
  {
    "id": "es_121",
    "source": "fd_024",
    "target": "fd_019",
    "type": "mirrors",
    "weight": 2,
    "label": "Without immortality no virtue mirrors without God everything permitted",
    "notes": "Two formulations of the same underlying argument. fd_019: without a transcendent source of value, self-justification has no limit. fd_024: without immortality, moral distinctions become arbitrary preferences. Both are Ivan's logic; fd_024 is the more explicitly metaphysical version."
  },
  {
    "id": "es_122",
    "source": "fn_002",
    "target": "fn_001",
    "type": "extends",
    "weight": 2,
    "label": "We killed God extends God is dead",
    "notes": "fn_002 is the phenomenological intensification of fn_001's diagnosis: not just that God is dead but that we — secular modernity — killed him, and the blood is on our hands. The guilt is ours."
  },
  {
    "id": "es_123",
    "source": "fn_005",
    "target": "fn_004",
    "type": "extends",
    "weight": 2,
    "label": "Active nihilism extends passive nihilism",
    "notes": "Active nihilism is the honest response to the same diagnosis that produces passive nihilism in fn_004: the recognition that old values have no foundation. Active nihilism tears them down deliberately rather than sinking into them quietly."
  },
  {
    "id": "es_124",
    "source": "fn_008",
    "target": "fn_016",
    "type": "extends",
    "weight": 2,
    "label": "Ressentiment extends herd instinct",
    "notes": "Ressentiment is the emotional engine behind the herd instinct of fn_016: the repressed resentment of the weak, turned inward, crystallised into a value system that condemns the strong as evil."
  },
  {
    "id": "es_125",
    "source": "fn_011",
    "target": "fn_007",
    "type": "extends",
    "weight": 2,
    "label": "Master morality extends will to power",
    "notes": "Master morality is the value system that emerges from the affirmative will to power: what is good is what expresses and expands the self's capacities. It is the value system of those who have not had their power suppressed."
  },
  {
    "id": "es_126",
    "source": "fn_013",
    "target": "fn_001",
    "type": "extends",
    "weight": 2,
    "label": "Christian morality as historical construction extends God is dead",
    "notes": "fn_013 provides the historical genealogy that fn_001's diagnosis implies: if God is dead and morality was sustained by the idea of God, then what presented itself as universal and eternal was a specific historical construction."
  },
  {
    "id": "es_127",
    "source": "fn_020",
    "target": "fn_009",
    "type": "extends",
    "weight": 2,
    "label": "Three metamorphoses extend self-overcoming",
    "notes": "The camel, lion, and child are the developmental stages through which self-overcoming moves: bearing burdens, destroying old values, and creating new ones with the innocence of a child who says yes."
  },
  {
    "id": "es_128",
    "source": "fn_022",
    "target": "fn_009",
    "type": "extends",
    "weight": 2,
    "label": "Asceticism extends self-overcoming",
    "notes": "Nietzsche's analysis of asceticism reframes it as a perverse form of will to power — the will turning against itself. It is self-overcoming in a self-defeating direction, relevant to understanding what genuine self-overcoming is not."
  },
  {
    "id": "es_129",
    "source": "fn_023",
    "target": "fn_007",
    "type": "extends",
    "weight": 2,
    "label": "What doesn't kill me makes me stronger extends will to power",
    "notes": "fn_023 qualifies the aphorism carefully: only if you have the constitution to benefit from adversity does it strengthen. This is the will to power applied to suffering: strength is not given by adversity but revealed or destroyed by it."
  },
  {
    "id": "es_130",
    "source": "fn_025",
    "target": "sk_015",
    "type": "converges",
    "weight": 3,
    "label": "Herd instinct converges with crowd as untruth",
    "notes": "The most direct cross-book converges between Nietzsche and Kierkegaard, who are usually placed in opposition. Both identify the same pathology: the tendency to find safety in collective identity, to let the group think for you. Nietzsche frames it as a biological inheritance; Kierkegaard frames it as an epistemological failure. The diagnosis is identical."
  },
  {
    "id": "es_131",
    "source": "fn_026",
    "target": "fn_028",
    "type": "extends",
    "weight": 2,
    "label": "Apollonian impulse extends art as primary means of facing existence",
    "notes": "fn_026 introduces the conceptual pair of which fn_028 draws the philosophical conclusion: the Apollonian and Dionysian together constitute the mechanism by which art lets humans face otherwise unbearable truth."
  },
  {
    "id": "es_132",
    "source": "fn_027",
    "target": "fn_026",
    "type": "extends",
    "weight": 2,
    "label": "Greeks not serene optimists extends Apollonian impulse",
    "notes": "fn_027 establishes the historical basis for fn_026's claim: the Apollonian form was not naive optimism but a hard-won response to fully perceived darkness, which makes its beauty an achievement rather than an inheritance."
  },
  {
    "id": "es_133",
    "source": "fn_029",
    "target": "mm_002",
    "type": "mirrors",
    "weight": 2,
    "label": "Philosophy as self-experiment mirrors each person as complete form of humanity",
    "notes": "Nietzsche: his philosophy is a self-experiment — he is not reporting results but conducting them. He is using himself as the material. Montaigne: each person carries within them the complete form of the human condition — studying the self honestly produces something universal. Both justify self-investigation as the most rigorous available method."
  },
  {
    "id": "es_134",
    "source": "fn_030",
    "target": "cd_025",
    "type": "mirrors",
    "weight": 2,
    "label": "Nietzsche caveat mirrors Darwin caveat",
    "notes": "Both caveat nodes name how a thinker's work was systematically misread to justify atrocities: Nietzsche's philosophy was appropriated by the Nazis; Darwin's evolutionary framework was used to justify scientific racism. In both cases the misreading required selective quotation and the suppression of what the thinker actually argued."
  },
  {
    "id": "es_135",
    "source": "ht_001",
    "target": "sk_002",
    "type": "converges",
    "weight": 3,
    "label": "Quiet desperation converges with despair as universal human condition",
    "notes": "The most direct cross-book converges in the entire graph for this theme. Thoreau: most people live lives of quiet desperation — not because their circumstances are unbearable but because they have accepted unexamined assumptions. Kierkegaard: despair is the universal human condition — the failure to become oneself. Both are identifying the same phenomenon; Thoreau grounds it in economic life, Kierkegaard in the structure of selfhood."
  },
  {
    "id": "es_136",
    "source": "ht_002",
    "target": "ht_004",
    "type": "extends",
    "weight": 2,
    "label": "Central experiment extends living deliberately",
    "notes": "Walden is the empirical test of what ht_004 prescribes: going to the woods and stripping life to its essentials is how Thoreau tests whether living deliberately is possible and what it requires."
  },
  {
    "id": "es_137",
    "source": "ht_005",
    "target": "ht_002",
    "type": "extends",
    "weight": 2,
    "label": "Simplicity not deprivation extends central experiment",
    "notes": "The core finding of ht_002's experiment: the person who has reduced their needs to what is genuine has more freedom than the person who has everything. Simplicity is what the experiment reveals."
  },
  {
    "id": "es_138",
    "source": "ht_007",
    "target": "ht_002",
    "type": "extends",
    "weight": 2,
    "label": "Building house and keeping accounts extends central experiment",
    "notes": "ht_007 establishes the empirical method of ht_002: Thoreau kept accounts because he was testing a hypothesis, not making a lifestyle choice."
  },
  {
    "id": "es_139",
    "source": "ht_008",
    "target": "ht_003",
    "type": "extends",
    "weight": 2,
    "label": "Time cannot be recovered extends cost measured in life",
    "notes": "ht_008 specifies the currency of ht_003's calculation: if the cost of a thing is the life exchanged for it, then the irreversibility of time is what makes that cost absolute."
  },
  {
    "id": "es_140",
    "source": "ht_009",
    "target": "ht_004",
    "type": "extends",
    "weight": 2,
    "label": "Morning as sacred extends living deliberately",
    "notes": "The morning hours are the practical site where deliberate living begins: before the world's noise arrives, the self is most available to itself. This is what living deliberately looks like at the level of daily practice."
  },
  {
    "id": "es_141",
    "source": "ht_010",
    "target": "ht_004",
    "type": "extends",
    "weight": 2,
    "label": "Signal from noise extends living deliberately",
    "notes": "Distinguishing what actually deserves your attention from what merely competes for it is the practical skill that deliberate living requires."
  },
  {
    "id": "es_142",
    "source": "ht_011",
    "target": "ht_024",
    "type": "extends",
    "weight": 2,
    "label": "Nature as readable text extends pond as object of attention",
    "notes": "ht_011 generalises what ht_024 demonstrates through the pond: any natural phenomenon, attended to with sufficient care and patience, opens into inexhaustible depth."
  },
  {
    "id": "es_143",
    "source": "ht_012",
    "target": "ht_011",
    "type": "extends",
    "weight": 2,
    "label": "Seasons as philosophical events extends nature as text",
    "notes": "The seasons are the most readily available text for the reader of nature: each makes a different argument about the nature of existence."
  },
  {
    "id": "es_144",
    "source": "ht_013",
    "target": "ht_011",
    "type": "extends",
    "weight": 2,
    "label": "Wildness as preservation extends nature as text",
    "notes": "Wildness is what makes nature worth reading: the unmanaged, unnarrated, fully itself character of wild nature is what carries the knowledge that civilisation cannot provide."
  },
  {
    "id": "es_145",
    "source": "ht_014",
    "target": "lz_011",
    "type": "mirrors",
    "weight": 2,
    "label": "Animals living with completeness mirrors the uncarved block",
    "notes": "Thoreau: animals live with a completeness and unselfconsciousness that humans have traded away for abstract thought. Laozi: the uncarved block is human potential before education, ambition, and social construction carve away at it. Both find in the non-human a wholeness that civilisation removes. Two independent traditions arriving at the same observation about what development costs."
  },
  {
    "id": "es_146",
    "source": "ht_017",
    "target": "ht_015",
    "type": "extends",
    "weight": 2,
    "label": "Thoreau not anti-social extends solitude not loneliness",
    "notes": "ht_017 corrects the most common misreading of Walden: the argument is not for permanent isolation but for an inner life strong enough to engage with society on your own terms — which requires the genuine solitude of ht_015 first."
  },
  {
    "id": "es_147",
    "source": "ht_018",
    "target": "ht_003",
    "type": "extends",
    "weight": 2,
    "label": "Economy of the self extends cost measured in life",
    "notes": "ht_018 names what ht_003 is actually calculating: the economy of the self is how you spend the irreplaceable currency of your days, and financial economy is downstream of this."
  },
  {
    "id": "es_148",
    "source": "ht_020",
    "target": "ht_019",
    "type": "extends",
    "weight": 2,
    "label": "Railroad extends most jobs selling attention and judgment",
    "notes": "The railroad is the specific symbol of ht_019's diagnosis in Thoreau's historical moment: who is riding whom? The question applies to every labour arrangement that extracts more than time."
  },
  {
    "id": "es_149",
    "source": "lz_002",
    "target": "lz_001",
    "type": "extends",
    "weight": 2,
    "label": "Tao as unnamed process extends Tao that cannot be named",
    "notes": "lz_002 describes what lz_001 refuses to name: the process that underlies everything, operates without command or preference, and aligns with rather than commands."
  },
  {
    "id": "es_150",
    "source": "lz_005",
    "target": "lz_004",
    "type": "extends",
    "weight": 2,
    "label": "Sage accomplishes without striving extends wu wei",
    "notes": "The sage is the portrait of wu wei in action: accomplishment without effort, the result of perfect alignment rather than force."
  },
  {
    "id": "es_151",
    "source": "lz_006",
    "target": "lz_004",
    "type": "extends",
    "weight": 2,
    "label": "Trying too hard is obstacle extends wu wei",
    "notes": "The negative case for wu wei: the student who strains, the leader who micromanages, the person who forces outcomes — all working against the grain of things."
  },
  {
    "id": "es_152",
    "source": "lz_007",
    "target": "lz_004",
    "type": "extends",
    "weight": 2,
    "label": "Act without acting paradox extends wu wei",
    "notes": "lz_007 pushes wu wei to its paradoxical limit: the formulation as paradox is not incoherence but a pointer toward a mode of engagement that cannot be approached directly."
  },
  {
    "id": "es_153",
    "source": "lz_009",
    "target": "lz_008",
    "type": "extends",
    "weight": 2,
    "label": "Soft overcomes hard extends water metaphor",
    "notes": "lz_009 draws the general principle from lz_008's central metaphor: the willow survives the storm; the oak breaks. Water carves the Grand Canyon without fighting it."
  },
  {
    "id": "es_154",
    "source": "lz_010",
    "target": "lz_008",
    "type": "extends",
    "weight": 2,
    "label": "Seek lowest place extends water metaphor",
    "notes": "Water's natural movement toward the lowest place is the model for lz_010's prescription: the valley is more generative than the mountain peak."
  },
  {
    "id": "es_155",
    "source": "lz_012",
    "target": "lz_011",
    "type": "extends",
    "weight": 2,
    "label": "Simplicity as recovery extends the uncarved block",
    "notes": "lz_012 describes the direction of movement: not toward greater complexity but toward the recovery of what was present before sophistication complicated it. The uncarved block is the destination."
  },
  {
    "id": "es_156",
    "source": "lz_014",
    "target": "bp_003",
    "type": "mirrors",
    "weight": 2,
    "label": "Everything contains its opposite mirrors human contradiction irreducible",
    "notes": "Laozi: beauty exists only because ugliness exists, good only because evil exists — opposites produce each other. Pascal: human nature is fundamentally contradictory — any philosophy that resolves this too cleanly is lying. Both insist on the structural necessity of apparent opposites, though Pascal names it as tragedy and Laozi as cosmological law."
  },
  {
    "id": "es_157",
    "source": "lz_015",
    "target": "lz_001",
    "type": "extends",
    "weight": 2,
    "label": "Usefulness of emptiness extends Tao that cannot be named",
    "notes": "lz_015 gives the practical application of lz_001's metaphysical point: non-being, like the Tao itself, is not nothing — it is the condition that makes being functional."
  },
  {
    "id": "es_158",
    "source": "lz_017",
    "target": "lz_002",
    "type": "extends",
    "weight": 2,
    "label": "Tao flows everywhere extends Tao as unnamed process",
    "notes": "lz_017 specifies the non-partiality of the process described in lz_002: the Tao flows to left and right without preference — the sage's non-imposition mirrors this structural impartiality."
  },
  {
    "id": "es_159",
    "source": "lz_018",
    "target": "lz_003",
    "type": "extends",
    "weight": 2,
    "label": "Best leader barely known extends Tao produces without possessing",
    "notes": "Human leadership at its best mirrors the Tao's action in lz_003: the Tao nourishes everything without controlling it. The leader who makes themselves invisible is applying the same principle."
  },
  {
    "id": "es_160",
    "source": "lz_019",
    "target": "lz_018",
    "type": "extends",
    "weight": 2,
    "label": "Governing like frying small fish extends best leader barely known",
    "notes": "lz_019 is the practical argument for lz_018's principle: over-governance ruins society as surely as over-turning ruins a delicate fish."
  },
  {
    "id": "es_161",
    "source": "lz_020",
    "target": "lz_004",
    "type": "extends",
    "weight": 2,
    "label": "Sage does not compete extends wu wei",
    "notes": "The sage who has released ego is not a weaker competitor but a different kind of player — the non-competitive orientation is wu wei applied to the social domain."
  },
  {
    "id": "es_162",
    "source": "lz_021",
    "target": "fn_014",
    "type": "converges",
    "weight": 2,
    "label": "Knowing yourself true wisdom converges with become who you are",
    "notes": "Laozi: knowing others is intelligence; knowing yourself is true wisdom. Nietzsche: you must become who you are — the imperative of self-knowledge as the central ethical task. Two frameworks with incompatible metaphysics arriving at the same demand for genuine self-knowledge as the foundation."
  },
  {
    "id": "es_163",
    "source": "lz_022",
    "target": "ht_023",
    "type": "mirrors",
    "weight": 3,
    "label": "Sage does not accumulate mirrors man rich by what he can let alone",
    "notes": "One of the clearest mirrors edges in the entire graph. Laozi: the more the sage gives to others, the more he has — certain goods are amplified by sharing, not depleted. Thoreau: a man is rich in proportion to the number of things he can afford to let alone. Both redefine wealth not as what you have but as what you do not need."
  },
  {
    "id": "es_164",
    "source": "lz_024",
    "target": "ma_004",
    "type": "converges",
    "weight": 2,
    "label": "Die but not be lost converges with everything transforms",
    "notes": "Laozi: to die but not be lost is to be present forever — death is not exit from the Tao's process. Marcus Aurelius: everything transforms; nothing is truly lost but changes form. Both offer the same consolation through different frameworks: death as phase in a continuing process rather than cessation."
  },
  {
    "id": "es_165",
    "source": "lz_027",
    "target": "lz_026",
    "type": "extends",
    "weight": 2,
    "label": "Truth not always beautiful extends those who know do not speak",
    "notes": "lz_027 develops the epistemological implications of lz_026: the inversions of common assumptions — beautiful words vs truth, goodness vs argument, wisdom vs knowing everything — all follow from the insight that language and appearance systematically mislead."
  },
  {
    "id": "es_166",
    "source": "ma_005",
    "target": "bo_007",
    "type": "converges",
    "weight": 2,
    "label": "All forgotten eventually converges with fame as hollow false good",
    "notes": "Marcus Aurelius: all emperors and philosophers are forgotten eventually — your reputation is not worth protecting at the cost of your character. Boethius: fame depends entirely on the opinions of others, who are themselves mortal and forgetful. Two formulations of the same liberating recognition."
  },
  {
    "id": "es_167",
    "source": "ma_006",
    "target": "ag_014",
    "type": "converges",
    "weight": 2,
    "label": "Length of life irrelevant to quality converges with mortality narrowing toward what matters",
    "notes": "Marcus Aurelius: a day lived with full attention is not inferior to a century lived in distraction. Gawande: as mortality becomes proximate, people consistently narrow toward what matters most. The narrowing that proximity to death produces is what Marcus Aurelius prescribes as the permanent orientation."
  },
  {
    "id": "es_168",
    "source": "ma_007",
    "target": "ma_003",
    "type": "extends",
    "weight": 2,
    "label": "Not born for comfort extends anxiety about uncontrollables",
    "notes": "The positive prescription follows from ma_003's diagnostic: if most anxiety is about things outside your control, the response is not withdrawal but engagement — you were built to act, contribute, engage."
  },
  {
    "id": "es_169",
    "source": "ma_009",
    "target": "ma_001",
    "type": "extends",
    "weight": 2,
    "label": "Work with difficult people as doctor extends event and judgment",
    "notes": "The practical application of ma_001: because suffering comes from judgment rather than event, you can choose to adopt the physician's stance — without contempt, without surprise, with a clear purpose."
  },
  {
    "id": "es_170",
    "source": "ma_010",
    "target": "ar_033",
    "type": "converges",
    "weight": 2,
    "label": "Social animals in deepest sense converges with city as natural",
    "notes": "Marcus Aurelius: to withdraw from others is to amputate part of yourself. Aristotle: the city is natural to humans in the same sense that the bee's hive is natural to the bee. Both insist on the constitutive rather than instrumental character of human sociality."
  },
  {
    "id": "es_171",
    "source": "ma_011",
    "target": "ma_001",
    "type": "extends",
    "weight": 2,
    "label": "What false belief extends event and judgment",
    "notes": "ma_011 applies ma_001's principle to the specific case of interpersonal wrong: if someone harms you, the first question is what false belief produced the action — which shifts from resentment to understanding."
  },
  {
    "id": "es_172",
    "source": "ma_012",
    "target": "vf_005",
    "type": "converges",
    "weight": 3,
    "label": "You are the faculty that chooses converges with last human freedom",
    "notes": "One of the strongest converges pairs in the graph. Marcus Aurelius: you are not your body, your reputation, or your role — you are the faculty that chooses how to respond. Frankl: everything can be taken from a person except the last of human freedoms — the choice of one's attitude. Both identify the same inviolable interior faculty in identical practical language, from opposite historical contexts: imperial Rome and the Nazi concentration camps."
  },
  {
    "id": "es_173",
    "source": "ma_013",
    "target": "ma_008",
    "type": "extends",
    "weight": 2,
    "label": "Stop performing extends virtue unwitnessed",
    "notes": "ma_013 is the psychological corollary of ma_008: if virtue witnessed and unwitnessed are the same, the gap between your public self and private self is a measure of disorder, not sophistication."
  },
  {
    "id": "es_174",
    "source": "ma_014",
    "target": "ma_001",
    "type": "extends",
    "weight": 2,
    "label": "Anger at own mistakes extends event and judgment",
    "notes": "ma_014 applies ma_001 reflexively: the event of your own mistake and your anger about it are two separate things. Self-flagellation is just another judgment that compounds the original error."
  },
  {
    "id": "es_175",
    "source": "mm_004",
    "target": "mm_003",
    "type": "extends",
    "weight": 2,
    "label": "Inconsistency as accurate report extends self as flux",
    "notes": "If the self is a process that changes as you describe it, then inconsistency is not a flaw in the Essays but an accurate report. A consistent account of an inconsistent self would be the falsification."
  },
  {
    "id": "es_176",
    "source": "mm_007",
    "target": "mm_010",
    "type": "extends",
    "weight": 2,
    "label": "Cruelty as worst vice extends cultural relativism",
    "notes": "The exception to Montaigne's relativism: while custom shapes almost everything else, cruelty — the active enjoyment of another's suffering — has no confusion at its root, only corruption. This makes it the one vice that cultural context cannot explain away."
  },
  {
    "id": "es_177",
    "source": "mm_011",
    "target": "mm_002",
    "type": "extends",
    "weight": 2,
    "label": "Travel as education extends each person as complete form of humanity",
    "notes": "Travel educates only when you are paying the right kind of attention — specifically the kind that mm_002 describes: looking at what is unfamiliar as a way of understanding what is universal in human experience."
  },
  {
    "id": "es_178",
    "source": "mm_012",
    "target": "mm_009",
    "type": "extends",
    "weight": 2,
    "label": "Essays as preparation for death extends philosophy as learning to die",
    "notes": "mm_012 names explicitly what mm_009 prescribes: the sustained practice of self-examination in the Essays is itself the preparation — by the time death arrives, everything there is to say will have been said."
  },
  {
    "id": "es_179",
    "source": "mm_013",
    "target": "mm_002",
    "type": "extends",
    "weight": 2,
    "label": "Experience as only real teacher extends each person as complete form",
    "notes": "mm_013 specifies the method that makes mm_002's methodology possible: active, reflective engagement with what is actually happening — including what is happening in yourself — is what turns the self into useful philosophical material."
  },
  {
    "id": "es_180",
    "source": "mm_014",
    "target": "mm_013",
    "type": "extends",
    "weight": 2,
    "label": "Books dangerous as substitute extends experience as teacher",
    "notes": "The negative case for mm_013: books are useful preparation for experience but become dangerous when they substitute for it. The well-read person who has hidden from life is merely well-informed."
  },
  {
    "id": "es_181",
    "source": "mm_015",
    "target": "mm_010",
    "type": "extends",
    "weight": 2,
    "label": "First to take marginalized experience seriously extends cultural relativism",
    "notes": "mm_015 extends the methodological move of mm_010: if the cannibals' experience is philosophically relevant data, so is the experience of women, servants, peasants, and indigenous peoples. Cultural relativism consistently applied."
  },
  {
    "id": "es_182",
    "source": "mm_018",
    "target": "eb_018",
    "type": "converges",
    "weight": 2,
    "label": "Ambition not about what it claims converges with depression when immortality project fails",
    "notes": "Montaigne: the ambitious person usually wants the sensation of forward movement and of not being ordinary, not the specific achievement they name. Becker: depression is what happens when your immortality project fails — which reveals that what the project was really providing was not the stated goal but existential buffering. Both diagnose the gap between stated and actual motivation."
  },
  {
    "id": "es_183",
    "source": "mm_020",
    "target": "mm_019",
    "type": "extends",
    "weight": 2,
    "label": "La Boetie's death extends highest friendship",
    "notes": "mm_020 is the experiential evidence for mm_019's philosophical claim: the loss of a soul with whom you shared your deepest self reveals the depth and rarity of what character friendship actually is."
  },
  {
    "id": "es_184",
    "source": "mm_021",
    "target": "mm_002",
    "type": "extends",
    "weight": 2,
    "label": "Room behind the shop extends each person as complete form",
    "notes": "The room behind the shop is the practical site where mm_002's methodology becomes possible: the privacy from public demands where you can attend to yourself with the honesty that produces genuine self-knowledge."
  },
  {
    "id": "es_185",
    "source": "mm_023",
    "target": "mm_022",
    "type": "extends",
    "weight": 2,
    "label": "Pleasure as serious philosophical subject extends body and mind as conversation",
    "notes": "If body and mind are in constant intimate conversation (mm_022), then physical pleasure is philosophically serious — the body's testimony about what is good cannot be dismissed as mere sensation."
  },
  {
    "id": "es_186",
    "source": "mm_025",
    "target": "mm_024",
    "type": "extends",
    "weight": 2,
    "label": "Pain in old age extends old age bringing genuine gifts",
    "notes": "mm_025 provides the honest empirical counterweight to mm_024's more positive account: old age brings genuine gifts but also pain as its primary occupation. Both are true simultaneously."
  },
  {
    "id": "es_187",
    "source": "mm_027",
    "target": "ar_029",
    "type": "converges",
    "weight": 2,
    "label": "More you pursue self-knowledge the less you find converges with bad judges of own cases",
    "notes": "Montaigne: the wisest sentence is Know yourself, but honest pursuit reveals how little of yourself is knowable and how much of what you think you know is wishful. Aristotle: we are systematically bad judges of our own cases. Both identify the epistemic difficulty of self-knowledge, though Montaigne frames it as the discovery of flux, Aristotle as the distortion of self-interest."
  },
  {
    "id": "es_188",
    "source": "mm_029",
    "target": "mm_001",
    "type": "extends",
    "weight": 2,
    "label": "Pyrrhonian scepticism not liveable extends que sais-je",
    "notes": "mm_029 draws the limit of mm_001's sceptical orientation: the suspension of all judgment is not liveable, which is itself a philosophical argument against it. Montaigne's scepticism is practical, not absolute."
  },
  {
    "id": "es_189",
    "source": "mm_030",
    "target": "mm_024",
    "type": "extends",
    "weight": 2,
    "label": "Ageing changing relationship to pleasure extends old age bringing gifts",
    "notes": "The specific phenomenological report of mm_024's more general claim: things Montaigne desired intensely at twenty he regards at sixty with puzzlement — which is itself one of the gifts."
  },
  {
    "id": "es_190",
    "source": "mm_031",
    "target": "mm_002",
    "type": "extends",
    "weight": 2,
    "label": "Most complete honesty to self extends each person as complete form",
    "notes": "If each person carries the complete form of the human condition, the most rigorous obligation is honesty toward oneself — full transparency to others is often cruelty rather than the same honesty."
  },
  {
    "id": "es_191",
    "source": "mm_032",
    "target": "mm_026",
    "type": "extends",
    "weight": 2,
    "label": "Greatest thing to know how to be your own extends belonging to yourself",
    "notes": "mm_032 is the final compressed formulation of mm_026's central claim: self-possession — living by your own judgment — is the whole project toward which the Essays have been working."
  },
  {
    "id": "es_192",
    "source": "mm_033",
    "target": "mm_002",
    "type": "extends",
    "weight": 2,
    "label": "Writing about himself extends each person as complete form",
    "notes": "mm_033 provides the methodological justification: writing about himself was not vanity but the most rigorous method available. By examining the examiner, Montaigne produces something universal because the self he examines carries the complete form."
  },
  {
    "id": "es_193",
    "source": "mm_035",
    "target": "mm_002",
    "type": "extends",
    "weight": 2,
    "label": "Every person as mixture extends each person as complete form",
    "notes": "mm_035 specifies what the complete form contains: not only wisdom but foolishness, not only generosity but pettiness. The project is to understand the mixture honestly, not to eliminate its less admirable ingredients."
  },
  {
    "id": "es_194",
    "source": "mm_036",
    "target": "mm_005",
    "type": "extends",
    "weight": 2,
    "label": "Animals knowing how to die extends philosophy as learning to die",
    "notes": "Animals achieve by constitution what philosophy reaches toward by argument: equanimity in the face of death. This both motivates mm_005's claim and humbles it — the highest human philosophical achievement is what natural creatures do by nature."
  },
  {
    "id": "es_195",
    "source": "sk_002",
    "target": "ht_001",
    "type": "converges",
    "weight": 3,
    "label": "Despair as universal converges with quiet desperation",
    "notes": "Both identify widespread hidden suffering as the baseline human condition. Kierkegaard's despair is the failure to become oneself — a structural analysis. Thoreau's quiet desperation is an observation about the economic and social conditions that prevent it. Two independent diagnoses of the same condition from different angles."
  },
  {
    "id": "es_196",
    "source": "sk_003",
    "target": "sk_002",
    "type": "extends",
    "weight": 2,
    "label": "First form of despair extends despair as universal",
    "notes": "The most common form — unconscious despair, the person entirely absorbed in the immediate — is what makes despair universal: it does not require acute suffering or existential crisis, only the failure to know you have a self to become."
  },
  {
    "id": "es_197",
    "source": "sk_004",
    "target": "sk_002",
    "type": "extends",
    "weight": 2,
    "label": "Second form of despair extends despair as universal",
    "notes": "The conscious refusal to become oneself — choosing comfort, conformity, or distraction — is more culpable than unconscious despair but equally widespread."
  },
  {
    "id": "es_198",
    "source": "sk_006",
    "target": "sk_002",
    "type": "extends",
    "weight": 2,
    "label": "Aesthetic stage extends despair as universal",
    "notes": "The aesthetic life is Kierkegaard's most detailed portrait of unconscious despair: the aesthete does not know they are in despair because the sensations are pleasant, but the organising principle — preservation of interesting experience — is self-undermining."
  },
  {
    "id": "es_199",
    "source": "sk_008",
    "target": "sk_002",
    "type": "extends",
    "weight": 2,
    "label": "Ethical stage extends despair as universal",
    "notes": "The ethical stage is the more dignified form of the same condition: the person who has made a genuine leap beyond the aesthetic but discovers through guilt that even universal duty cannot resolve the self's fundamental requirement."
  },
  {
    "id": "es_200",
    "source": "sk_013",
    "target": "sk_012",
    "type": "extends",
    "weight": 2,
    "label": "Anxiety of possibility extends anxiety as dizziness of freedom",
    "notes": "sk_013 gives the specific theological context for sk_012's general account: the anxiety that precedes the fall is what sk_012 describes — not fear of a known threat but the vertigo of genuine possibility."
  },
  {
    "id": "es_201",
    "source": "sk_021",
    "target": "sk_012",
    "type": "extends",
    "weight": 2,
    "label": "Possibility without necessity extends anxiety as dizziness of freedom",
    "notes": "sk_021 is the pathological extreme of sk_012's account: the person so overwhelmed by possibility that they cannot commit to any actuality — anxiety so total it extends to the self itself."
  },
  {
    "id": "es_202",
    "source": "sk_025",
    "target": "sk_010",
    "type": "extends",
    "weight": 2,
    "label": "Becoming Christian hardest extends religious stage",
    "notes": "sk_025 names the specific failure of institutional Christianity to deliver what sk_010 defines as the religious stage: most of what calls itself religious is domesticated ethical or aesthetic life, not the absolute relation to the absolute."
  },
  {
    "id": "es_203",
    "source": "sw_006",
    "target": "sw_005",
    "type": "extends",
    "weight": 2,
    "label": "Afflicted person in position of Christ extends affliction destroying capacity",
    "notes": "sw_006 names the theological content of what sw_005 describes phenomenologically: the person destroyed by affliction is in contact with something real about existence — the divine silence — that comfort cannot access."
  },
  {
    "id": "es_204",
    "source": "sw_008",
    "target": "sw_001",
    "type": "extends",
    "weight": 2,
    "label": "Supernatural exceeds natural necessity extends gravity vs grace",
    "notes": "sw_008 defines the supernatural precisely in terms of sw_001's framework: it is exactly what exceeds natural necessity — the force that moves against gravity, which cannot be produced by the person who needs it."
  },
  {
    "id": "es_205",
    "source": "sw_009",
    "target": "fn_028",
    "type": "converges",
    "weight": 2,
    "label": "Beauty as trap set by God converges with art as facing existence",
    "notes": "Both take beauty with extreme philosophical seriousness as a contact point with something that exceeds ordinary experience. Weil: beauty arrests the self's movement and makes it available to what is beyond itself. Nietzsche: art is the primary means by which humans face otherwise unbearable truth about existence. Different metaphysical frameworks, same functional claim about beauty's capacity to open the self."
  },
  {
    "id": "es_206",
    "source": "sw_010",
    "target": "sw_003",
    "type": "extends",
    "weight": 2,
    "label": "Genuine reading extends attention as receptive waiting",
    "notes": "sw_010 applies sw_003's account of attention to the specific practice of reading: the text that is genuinely read — received with the fullness of receptive attention — is allowed to make its full demands rather than having confirmation extracted from it."
  },
  {
    "id": "es_207",
    "source": "sw_014",
    "target": "eb_007",
    "type": "converges",
    "weight": 2,
    "label": "Social as idol converges with immortality projects colliding",
    "notes": "Weil: every human collective presents itself as an object of absolute loyalty and demands devotion properly due only to what is genuinely absolute. Becker: when two different immortality projects collide, the result is often extraordinary violence. Both diagnose the same mechanism: the collective demanding unconditional loyalty produces the conditions for atrocity."
  },
  {
    "id": "es_208",
    "source": "sw_017",
    "target": "sw_003",
    "type": "extends",
    "weight": 2,
    "label": "Beautiful true good as one extends attention as receptive waiting",
    "notes": "sw_017 names the unified reality toward which sw_003's attention is directed: beauty, truth, and goodness are not three separate things but three aspects of the same contact with what exceeds the ego."
  },
  {
    "id": "es_209",
    "source": "sw_020",
    "target": "lz_016",
    "type": "mirrors",
    "weight": 2,
    "label": "Most precious gifts received not seized mirrors highest virtue unconscious of itself",
    "notes": "Weil: the most precious gifts come to the person who waits receptively rather than pursues forcefully — grasping produces a simulacrum shaped by desire rather than the thing itself. Laozi: the highest virtue does not think of itself as virtuous — true virtue is unconscious of itself. Both describe a mode of receptivity that excludes the ego's deliberate pursuit as self-defeating."
  },
  {
    "id": "es_210",
    "source": "sw_021",
    "target": "bp_003",
    "type": "converges",
    "weight": 2,
    "label": "Contradiction to be inhabited converges with human contradiction irreducible",
    "notes": "Weil: the contradiction between body and spirit, time and eternity, particular and universal is not to be resolved but inhabited. Pascal: human nature is fundamentally contradictory and any philosophy that resolves this too cleanly is lying. Both identify honest inhabitation of contradiction as the only adequate response."
  },
  {
    "id": "es_211",
    "source": "sw_022",
    "target": "mm_017",
    "type": "converges",
    "weight": 2,
    "label": "Humility as accuracy converges with learned ignorance",
    "notes": "Weil: humility is the accurate perception of one's actual size in relation to what is real — not underestimation but the cessation of inflation. Montaigne: learned ignorance — the recognition of how much you do not know — is a genuine intellectual achievement harder than accumulation of information. Both define the epistemic virtue as precision rather than modesty."
  },
  {
    "id": "es_212",
    "source": "sw_023",
    "target": "sw_005",
    "type": "extends",
    "weight": 2,
    "label": "Reading of affliction extends affliction destroying capacity",
    "notes": "sw_023 names what is available beyond sw_005's destruction: the capacity to perceive in extreme suffering a specific form of contact with the divine. This is not available to everyone and cannot be arrived at by argument."
  },
  {
    "id": "es_213",
    "source": "sw_025",
    "target": "sw_017",
    "type": "extends",
    "weight": 2,
    "label": "Greek heritage extends beautiful true good as one",
    "notes": "The metaxu — the in-between — is the Greek concept that makes sw_017's claim philosophically precise: contact between the human and the divine without confusing them. The Greek heritage matters because it provides the conceptual vocabulary for the threefold unity."
  },
  {
    "id": "es_214",
    "source": "vf_003",
    "target": "vf_001",
    "type": "extends",
    "weight": 2,
    "label": "Existential vacuum extends primary drive as meaning",
    "notes": "The existential vacuum is what the primary drive's frustration produces: when the search for meaning finds no object, the specific condition of pervasive inner emptiness results."
  },
  {
    "id": "es_215",
    "source": "vf_013",
    "target": "vf_002",
    "type": "extends",
    "weight": 2,
    "label": "Meaning not generic extends meaning is discovered",
    "notes": "vf_013 specifies the character of the discovery in vf_002: meaning is not discovered in general terms — it is found only in the specific situation, at this moment, for this person."
  },
  {
    "id": "es_216",
    "source": "vf_014",
    "target": "vf_004",
    "type": "extends",
    "weight": 2,
    "label": "Freedom without responsibility extends stimulus-response gap",
    "notes": "If the space between stimulus and response is freedom, then what fills that space is the responsibility that vf_014 insists accompanies it. Freedom and responsibility are not two things but one."
  },
  {
    "id": "es_217",
    "source": "vf_015",
    "target": "vf_014",
    "type": "extends",
    "weight": 2,
    "label": "Statue of Responsibility extends freedom without responsibility",
    "notes": "The rhetorical formulation of vf_014's philosophical claim: the symbolic incompleteness of liberty without responsibility made concrete."
  },
  {
    "id": "es_218",
    "source": "vf_016",
    "target": "vf_005",
    "type": "converges",
    "weight": 2,
    "label": "Not determined by conditions converges with last human freedom",
    "notes": "vf_016 is the general philosophical claim behind the specific experiential claim of vf_005: the capacity to transcend conditions is what makes you human — and the last freedom of attitude is its most extreme demonstration."
  },
{
    "id": "ei_001",
    "source": "as_025",
    "target": "as_001",
    "type": "extends",
    "weight": 3,
    "label": "Economic engine requires moral foundation",
    "notes": "Reframes the Adam Smith Problem from a 'tension' to an integral dependency: the fellowship of feeling (as_001) is the necessary condition for a non-destructive market economy (as_018)."
  }
]